{
  "course_id": "096290",
  "scraped_at": "2025-12-16T13:48:49.556256",
  "information": {
    "raw_text": "00960290 - נושאים נבחרים בהנדסת נתונים ומידע\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 2.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nנושאים נבחרים ובעיות מאתגרות בהן מתמקד המחקר בהנדסת נתונים ומידע אשר אינם נלמדים בקורסים האחרים. הקורס יוקדש בכל סמסטר לנושא אחר. תוצאות למידה: בסיום הקורס הסטודנט ייחשף לנושאי מחקר שונים בהנדסת נתונים ומידע או להתמודדות עם סוג נתונים שונה. הערה: סילבוס מפורט יוגש לאישור ביה\"ס כתנאי לפתיחת הקורס בכל סמסטר. סמסטר א' תשע\"ט: שילוב נתונים בסביבת אי ודאות. סמסטר א' תש\"פ: שיטות חיזוי בפיננסים. סמסטר א' תשפ\"א: שיטות להסבר מודלים והחלטות בבינה מלאכותית ולמידת מכונה.\n\nמקצועות קדם: 00960411",
    "title": "00960290 - נושאים נבחרים בהנדסת נתונים ומידע"
  },
  "feedback": {
    "summary": {
      "text": "חוות דעת אחת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: עידן האן\nחוות דעת - הרצאות: בפועל לא הייתה חובת נוכחות בהרצאות וגם הרוב המוחלט של ההרצאות לא היו רלוונטיות להגשות, אז לא קריטי אם לא מגיעים, אפשר להשלים הכל מהמצגות. אם בכל זאת הגעתם, עידן מרצה אחלה\n\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 2 הגשות בזוגות - האחת תיאור של סוכן (AI Agent) אותו רוצים לבנות, השני מצגת שאותה מציגים בשיעור על מה הסוכן עושה, איזה בעיה הוא פותר, מה הארכיטקטורה שלו וכו'.\n\nהמבחן: פרויקט שבו נדרש לבנות סוכן (AI Agent) בעזרת LangChain ובהתאם הנושא שנבחר במהלך הסמסטר\n\nהשורה התחתונה: אחלה ניסיון מעשי, כמעט ולא עמוס במהלך הסמסטר (למעט מתי שצריכים להתחלק לזוגות ולהתחיל לעבוד על התרגילים/פרויקט, שזה קורה מתישהו אחרי אמצע הסמסטר). בדיקה הוגנת לחלוטין בכל התרגילים ובפרויקט. ציונים גבוהים. סה\"כ מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2021-2022  א' 96  סופי 96  לויפר שלומי\nחורף 2020-2021  א' 94  סופי 94  עמיר עפרה\nחורף 2019-2020  סופי 94  בן-ארצי אחיקם\nסופי מועד א': 96\nסופי: 96\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n39 39 0 100 90 100 96.077 97\nאיש סגל תפקיד\nגולדבראיך אדם ודים מתרגל\nלויפר שלומי מרצה - אחראי מקצוע\nזיו דוד מורן סגל מנהלי - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}