{
  "course_id": "094423",
  "scraped_at": "2025-12-16T13:08:46.258800",
  "information": {
    "raw_text": "00940423 - מבוא לסטטיסטיקה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nסטטיסטיקה תיאורית ושיטות גרפיות. יסודות דגימה. אמידה נקודתית, רווחי סמך ובדיקת השערות. בדיקת טיב התאמה ואי תלות. רגרסיה לינארית פשוטה ומרובה.\n\nמקצועות קדם: 00940411 או 00940412 או 01040034\n\nמקצועות ללא זיכוי נוסף (מוכלים): 00940429 00940480 00940481 00940493\n\nמקצועות ללא זיכוי נוסף (מכילים): 00460010\n\nמקצועות ללא זיכוי נוסף: 00940424 00940490 03340023\n\nמועד א': 08-02-2026\nמועד ב': 08-03-2026\n\nהערות: הרצאה 10 (יום ב') תערך בחדר 215. מרצה: מרינה בוגומולוב\nהרצאה 20 (יום א') תערך באולם 100. מרצה: נדיה בורדו\nתרגולים: יום ב'-153, יום ד'-424, יום ג'-527\nמועדי המבחנים בקורס -\nמועד א' 8/2/2026 מועד ב' 8/3/2026",
    "title": "00940423 - מבוא לסטטיסטיקה"
  },
  "feedback": {
    "summary": {
      "text": "28 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 4.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: ההרצאות ברורות ומועברות בצורה מסודרת. המרצה נעימה ומאפשרת לשאול שאלות.\n\nשעורי הבית: גליונות בית שבועיים, לרוב השאלות יש רפרנסים אך הגליונות ארוכים ודורשים השקעה.\n\nהמבחן: מבחן אמריקאי\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: ד''ר מרינה בוגומולוב\nחוות דעת - הרצאות: מרינה מאוד מקפידה שכלל הסטודנטים יבינו מרצה מעולה\n\nשם המתרגל/ת: נדיה בורדו\nחוות דעת - תרגולים: נדיה מתרגלת מעולה ! מסבירה הכל לפרטי פרטים.\n\nשעורי הבית: שיעורי בית עמוסים ודורשים זמן\n\nהמבחן: המבחן היה קשה, היו שאלות על R ברמה אחת מעל מה שנלמד בכיתה .\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרצה מקסימה, עונה לשאלות ואיכפתית.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: מתרגלת מקסימה, מסבירה מעולה ומגיעה מוכנה.\n\nשעורי הבית: ארוכים מאוד וקשים, אבל עוברים על כל החומר שנלמד.\n\nהמבחן: לא כל כך קשור לקורס ולמבנה.\n\nהשורה התחתונה: להתחיל לעשות שאלות של מבחן בנושאים הנלמדים כחודש-חודשיים לפני סיום הסמסטר יותר חשוב מש\"ב.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: המרצה הכי נחמדה וסבלנית שיש בעולם. לא שהחומר בשמיים אבל הכל ברור כשהיא מסבירה (במיוחד בפעם השנייה והשלישית כשמישהו מבקש).\n\nשם המתרגל/ת: עדו גרינס\nחוות דעת - תרגולים: מתרגל סופר סבלני, מסביר טוב וברור, מאוד מומלץ.\n\nשעורי הבית: מעיקים יחסית, גיליון כל שבוע ויש רטובים ב-R.\n\nהמבחן: לא מפתיע, לגמרי ברמה של השיעורים, אחרי מספיק מבחנים הוא הופך לטכני.\n\nהשורה התחתונה: קורס כיפי, רלוונטי להרבה תחומים ומאוד מומלץ!\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: הרצאות קצת ארוכות ועמוסות אבל מרינה תמיד מסבירה בסבלנות גם בשעות הקבלה\n\nשם המתרגל/ת: עידו ונדיה\nחוות דעת - תרגולים: מתרגלים מעולים, מעבירים את החומר בצורה מובנת.\n\nשעורי הבית: גיליון אחת לשבוע\n\nהשורה התחתונה: קורס נחמד\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nשם המתרגל/ת: עדו ונדיה\nשעורי הבית: גליונות שבועיים (לא ממש קשים, לפעמים השאלות די חוזרות על עצמן וחלק גם מבוססות על שאלות מגליונות קודמים) מאוד עמוסים עם שילוב של תכנות בשפת R\n\nהשורה התחתונה: קורס מעניין אבל מאוד עמוס נכון לסמסטר חורף 20-21\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: מרינה מרצה מעולה וסבלנית אבל לפעמים הקצב יותר מדי איטי\n\nשם המתרגל/ת: עידו גרינס\nחוות דעת - תרגולים: מתרגל תותח, מומלץ בחום\n\nשעורי הבית: תרגיל בית כל שבוע שהוא קצת ארוך , אבל אפשר לחלק ל3 שותפים לכן יוצא בסדר\n\nהמבחן: היה יותר קשה מהרגיל , בדק הבנה יותר מטכניקה בניגוד למבחני עבר\nהשורה התחתונה: קורס טוב בסה\"כ\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות:\nמרצה נהדרת, מסבירה ממש טוב ועונה על כל השאלות (לטוב ולרע).\n\nשם המתרגל/ת: נדיה בורדו\nחוות דעת - תרגולים:\nמתרגלת מעולה, תרגולים מאוד עוזרים להבנה של החומר ולפתירת שיעורי הבית.\nבנוסף המתרגל עידו מתרגל ממש טוב. לא יצא לי להיות אצל מתרגל שלא היה ממש טוב.\n\nשעורי הבית:\nכל שבוע מתפרסם גיליון שלוקח בערך יום שלם - יומיים לפתור. לא קשים במיוחד אבל ארוכים מאוד.\n\nהמבחן:\nהרמה עלתה בשנים האחרונות אבל אפשרי לגמרי\n\nהשורה התחתונה:\nקורס מאוד מעניין והסגל הופך אותו ליותר כיף\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: משעממות למדי, בקושי יכולתי לשבת בהן, ממליצה פשוט לעבור על המצגות. עוברת על פיתוחים כתובים מראש שלי אישית זה היה סופר לא נוח ולא ברור.\n\nשם המתרגל/ת: עדו\nחוות דעת - תרגולים: בניגוד להרצאות התרגולים דווקא מועילים ועדו מתרגל ממש טוב! סמסטר זום אז הוא השתמש בוורד כדי לכתוב את הפתרון תוך כדי התרגול ולא סתם עבר על הפתרון הכתוב שזה מאוד עזר\n\nשעורי הבית: עמוסים עמוסים עמוסים עמוסים. הרגשתי שכל מה שאני עושה הסמסטר זה סטטיסטיקה. גיליון שבועי שבסוף יוצא 30 עמודים כתובים. אפשר לעשות בזוגות או שלישיות, כחלק משלישיה עדיין לקח לי יום שלם לעשות את השליש שלי.\n\nהמבחן: העלו ממש את הרמה בסמסטר האחרון וגם היה מחסור בזמן. בסוף הרגשתי שניסו להוריד את הממוצע בכח עם מבחן לא פתיר במסגרת הזמן שניתן.\n\nהשורה התחתונה: אם לא חובה - לא לעשות\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות:\nמסבירה לאט וברור את החומר (לפעמים לאט מדי). ההרצאות עמוסות בחומר תיאורטי שלפעמים מרגיש חזרתי\nשם המתרגל/ת: עדו\nחוות דעת - תרגולים:\nטוב לעבור עליהם בשביל הנושאים שמרגישים לא מובנים ולשאול שאלות, עדו ענה בצורה מאוד טובה על השאלות של הסטודנטים ובכללי אחלה. התרגולים עצמם לא הרגישו מסט.\nשעורי הבית: המון שיעורי בית, לוקח הרבה מאוד זמן. לא קפדניים בכלל בבדיקה\n\nהמבחן: המבחן שלנו היה מאוד קשה והחליטו להוריד את הממוצע בעשר נקודות.\n\nהשורה התחתונה: קורס לא הכי מעניין, מרגיש שיש המון דברים שלוקח להם זמן להסתדר ביחד ועמוס בתקופת הסמסטר בגלל עבודות הבית\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: הרצאות ארוכות ומרינה אוהבת לענות על שאלות, לטוב ולרע. אני ראיתי במוקלט על מהירות 1.5, לראות בלייב מאד קשה.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: מתרגלת מדהימה! מעבירה את החומר בצורה אינטואיטיבית ועם הרבה הסברים.\n\nשעורי הבית: ארוכים אבל בסופו של דבר מטמיעים את החומר. החל משב 6-7 השאלות מתחילות לחזור על עצמן ובסוף מסתמכים על חישובים שכבר עשינו בשב קודמים.\n\nהמבחן: ארוך ובודק הבנה עמוקה של החומר, בשונה משנים קודמות פחות טכני\n\nהשורה התחתונה: קורס קשה אבל הצוות של הקורס מעביר את החומר בצורה מעולה, רלוונטי מאד להמשך\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: קשות ומעיקות. מרינה לא ברורה בעליל ולרוב מקשקשת על גבי המצגת הרצאה (בזום). מרינה מאוד מבולגנת וממש גרועה בזמנים, כלומר יכולה לתת לנושא קליל שעה ולנושא יותר מורכב 20 דקות בעקבות חוסר זמן שנוצר בגלל התעכבות על נושא קליל. אפס התחשבות בסטודנטים בהקשר של תרגילי הבית, קרירות ואטימות.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: מתרגלת מאוד מאוד בקיאה ומאוד מסודרת וברורה. לגמרי 10 מתוך 10, הבעיה היא שגם היא תורמת לתחושת עצבים על כך שהתרגילי בית כל כך כבדים כי היא כותבת/עורכת אותם. והסמסטר הם היו מוגזמים, ממש!\n\nשעורי הבית: הזייה. בסמסטר חורף 20-21 התרגילי בית היו פעם בשבוע, לוקח מלא זמן לפתור כל תרגיל ויש בערך 5-6 תרגילים ובכל תרגיל מיליון סעיפים. גם לאחר אינסוף פניות לסגל הם לא התחשבו. כנראה שזה נבע בעיקר מנציגי סמסטר חלשים, מאוד מאוד חלשים שיודעים רק לדבר.\n\nהמבחן: מועד א' היה קשוח, מועד ב' דומה מאוד אך יותר קל. בכל מקרה ביחס לשנים קודמות, שני המועדים היו הרבה הרבה יותר קשים והממוצעים של המבחן עצמו היו בהתאם.\n\nהשורה התחתונה: לא הייתי מוותר על הקורס הזה כי זה מבוא לעולם שלם שלדעתי כל מהנדס צריך לדעת. למרות כל הקושי של הקורס הזה, הוא מאוד חשוב וצריך לעשות אותו על הצד הטוב ביותר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: ההרצאות של מרינה מאוד מסודרות. מאוד חשוב לה שכל הסטודנטים יבינו את החומר ועונה על כל שאלה בסבלנות רבה\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: נדיה מתרגלת מדהימה ומאוד סבלנית.\n\nשעורי הבית: שיעורי הבית גוזלים הרבה מאוד זמן ובסופו של דבר האחוז שלהם מהציון מאוד נמוך!!!!\nלצד זאת הם מאוד מלמדים.\n\nהמבחן: אין קשר בין רמת ההרצאות / התרגולים לרמת המבחן! המבחנים של סמסטרים קודמים לא מייצגים בכלל את הרמה הנדרשת ב3 סמסטרים האחרונים. חבל שאין מקורות נוספים לתרגל מהם\n\nהשורה התחתונה: חשוב להשקיע בקורס לאורך כל הסמסטר ולהבין לעומק את החומר...\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נדיה\nחוות דעת - הרצאות: מרצה אחלה. מעבירה את החומר בצורה ברורה, מסבירה כמה פעמים כל דבר.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: כנ\"ל\n\nשעורי הבית: יוצא גיליון בהגדרה פעם בשבוע. בסמסטר הזה היינו צריכים להגיש 8 מתוך 10 גיליונות. כל גיליון דורש השקעה ועבודה של יום אחד מלא לפחות. יש רפרנסים לרוב השאלות\n\nהמבחן: 20 שאלות אמריקאיות\n\nהשורה התחתונה: קורס מאוד מעניין ומאוד פרקטי! מומלץ לקחת בעיקר בשביל הידע, פחות בשביל הציון.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: מרינה / נדיה\nחוות דעת - הרצאות:\nחמודות. שתיהן מרצות טובות וברורות.\n\nשם המתרגל/ת: נדיה /בר\nחוות דעת - תרגולים: קצרים ופרקטיים. חשוב לראות\n\nשעורי הבית:\nדי עמוסים. כל שבוע. לוקחים 9 גיליונות מתוך 12 (במקרה הטוב שבאמת פירסמו 12)\n\nהמבחן: לא ברור למה - אבל ברור שמכוונים לממוצע נמוך. זה לא קורס קל - אולי מבחינת חומר, אבל ממש לא מבחינת המבחן. מחפשים איפה להפיל, לבלבל ולהטעות.\n\nהשורה התחתונה: צריך לבוא חדים ולא להתייאש בדרך\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "חוות דעת - הרצאות: מרצה טובה אבל אישית לא התרברתי\n\nחוות דעת - תרגולים: חשובים\n\nשעורי הבית: היקר החשוב של הקורס אבל יותר קשים מהמבחן בד״כ\n\nהמבחן: דורש הרבה השקעה של זמן ולמידה. לא מחבן קל\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: מקסימה, משתדלת לשתף את הכיתה ולשאול אותם שאלות, וגם לענות לשאלות בצורה ברורה. מביאה דוגמאות עם R ומסבירה בכיתה על דרכים לפתור את שיעורי הבית. משתדלת מאוד שהכול יהיה אינטואיטיבי. ההרצאות רלוונטיות מאוד לתרגילי בית, וגם למבחן.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: קצת מהירים ומונוטוניים, ומרגישים פחות רלוונטיים מההרצאות. בעיקר עוזרים להתחדד על מה שלא היה ברור בהרצאה, ומדי פעם יש דוגמאות שרואים רק בתרגולים ועוזרות לתרגילי הבית (פחות קורה).\n\nשעורי הבית: כל שבוע גיליון, די ארוכים אבל לא קשים במיוחד. יש לכתוב קצת קוד בR כדי לענות על חלק מהשאלות ביבש אבל זה קליל וקצר, וכל הקוד שצריך לכתוב כבר מופיע בהרצאה אז רק לשנות את הקלט רב הזמן... מלמדים ועוזרים להפנים את החומר, למרות ששונים מהסגנון של המבחן.\n\nהמבחן: אמריקאי 20 שאלות. לבוא עם דף נוסחאות שמכירים טוב ורגילים אליו כבר. העלו את הרמה בסמסטרים האחרונים (מאביב 20) ועכשיו בודקים יותר הבנה (אבל עדיין מאוד טכני). להיזהר לא לסמן בטעות תשובה שונה ממה שהתכוונתם בטופס ולאבד 5 נקודות :(\n\nהשורה התחתונה: קורס ממש אחלה שמלמד דברים מאוד חשובים למי שמתעניין בdata-science/machine-learning. מי שאוהב הסתברות ייהנה. המתמטיקה היא די המשך ישיר של הסתברות, עם פחות אינטגרלים וטורים. בעיקר צריך להבין את האינטואיציה והמשמעויות מאחורי הנושאים שנלמדים בקורס ולראות איך הם מתקשרים, בייחוד החל מהחלק של רווח סמך ובדיקת השערות. הנושא האחרון (רגרסיה) נלמד בצורה מאוד שטחית וטכנית, ורב השאלות במבחן הם הצבה בנוסחאות ותשומת לב ליחידות מידה/שינויים בגדלים ואיך הם משפיעים על הנוסחה. כדאי לעבור טוב על החומר לפני שניגשים למבחנים, ובייחוד לראות שמבינים טוב את המשמעות של p-value כי זה הנושא שהכי קל לשאול עליו שאלות \"הבנתיות\" יחסית.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: מרינה בוגמולוב\nחוות דעת - הרצאות: הרצאות מעולות. בין הקורסים היחידים שאתה מגיע להרצאה ואשכרה מבין הכל. המצגות מאוד ברורות ויש הרבה דוגמאות במהלך ההרצאה. מרינה מסבירה את החומר בצורה מעולה, ותמיד עונה לכל שאלה. תקשיבו טוב לשאלות שלה במהלך ההרצאה כי הבנת השאלה והתשובה חשובה מאוד למבחן.\n\nשם המתרגל/ת: עידו גרינס\nחוות דעת - תרגולים: מתרגל שהוא תותח. סופר מקצועי ורואים שהוא מבין את החומר ברמה מאוד גבוהה. מעטים המתרגלים שהם כל כל חדים ויודעים לענות לכל שאלה מיד, ואפילו לנתח אותה ולתת עוד כיוון חשיבה. כל תרגיל הוא פותר בלי להסתכל בכלל בדף התרגול והוא נותן מלא אינטואיציה לחומר וזה ממש חשוב. יכול לומר ששאלה שהוא הסביר לנו בתרגול, ונתן לנו את דרך הפתרון שלו אליה, הופיעה במבחן. ממליץ בחום לא תתחרטו\n\nשעורי הבית: לא הייתי אומר שהם קשים ממש אבל כן דורשים הרבה מאמץ. גיליון לוקח יום עבודה עליו בערך אז תקדישו לזה יום בשבוע. לא מיותרים בכלל וממש מכינים למבחן, תשקיעו ואל תרפרנסו.\n\nהמבחן: המבחן היה מאוד הוגן לטעמי. היו שאלות שהיו יותר קשות מבדרך כלל והיו שאלות שכבר ראינו משהו מאוד דומה בתרגול או בתרגיל בית. כדאי שיהיה לכם דף נוסחאות ממש טוב לידכם כי אחד כזה יכול בקלות לסדר לכם 10-15 נקודות קלות. יש גם הרבה קוד של R אז כדאי שתכניסו קטעי קוד לדף נוסחאות גם כן.\n\nהשורה התחתונה: קורס ממש חשוב ומועבר בצורה מעולה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: מרינה בוגומולוב\nחוות דעת - הרצאות:\nהרצאות ברורות מאוד, חשוב להיות בהם. מרינה מסבירה טוב ודואגת שכולם יבינו. ממש נחמדה ואווירה נעימה בשיעור.\n\nשם המתרגל/ת: עדו גרינס\nחוות דעת - תרגולים:\nמתרגל מצויין, מסביר הכל ברור ועונה על כל השאלות. ניכר שהוא מבין את החומר שהוא מלמד.\nממש נחמד אצלו בתרגולים :)\nמומלץ מאוד.\n\nשעורי הבית:\nארוכים מאוד ועמוסים. אבל עוזרים להבין את החומר, מומלץ לעשות אותם.\n\nהמבחן:\nהוגן. מבנה דומה במהלך כל השנים.\n\nהשורה התחתונה:\nקורס יחסית עמוס ולא פשוט, אבל הצוות מצויין.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: חמודה בטירוף, אכפת לה שיבינו ומוכנה להתעכב על החומר במקום לרוץ קדימה על מנת לתת הסבר יותר טוב. בפן הבינאישי - מאוד חמודה ומאוד פתוחה לעזור לסטודנטים ולבקשות שנראות חריגות :)\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: תרגולים קולעים בול! הסברים קוהרנטיים ומקיפים ובו זמנית ללא מריחת זמן. מאוד מומלץ!\n\nשעורי הבית: שאלות ארוכות, תהיו מוכנים. פעם ראשונה שראיתי 14 סעיפים לשאלה :) עם זאת, לא קשים מדי, פשוט דורשים זמן.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: מאד איטיים ומשמעממים. מומלץ ללראות הקלטות. אבל היא ממש חמודה, פשוט מתעכבת על דברים לא חשובים.\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: אחלה\n\nשעורי הבית: ארוכים מאד מאד מאד מאד. לוקחים כל כך הרבה זמן - לא פרופורציונלי למשקלם בציון הסופי. מה שכן, שווה לעשות אותם, הרבה שאלות/ראיונות במבחן אומצו מהתרגילי בית.\n\nהמבחן: היתה העלת רמה ב4 סמסטרים האחרונים, ולכן הבמבחן לא פשוט ודורש הבנה של הנושאים מעבר לחישובים וטכניקות. בכל זאת, עם שבוע שלם של הכנה אפשר להגיע לרמת מוכנות מאד גבוהה ולהוציא ציון באמת טוב.\n\nהשורה התחתונה: אחלה קורס סה\"כ ומאד חשוב\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: נדיה\nחוות דעת - הרצאות: מרצה נהדרת, למרות שההרצאות ארוכות וקשה להשאר בפוקוס החומר חשוב ומועבר טוב.\n\nשם המתרגל/ת: גם נדיה, עידו\nחוות דעת - תרגולים: כנ\"ל, בקיאים מאוד והתרגולים פרקטיים וחשובים.\n\nשעורי הבית: שבועיים ארוכים מאוד וקשים בקטע לא סביר וביחס לא הוגן למשקל שלהם בציון (רק 10%).\n\nהמבחן: קשה\n\nהשורה התחתונה: קורס חשוב אבל קשה. סגל מעולה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: נדיה\nחוות דעת - הרצאות: נדיה היא בן אדם באמת עם לב זהב וממש קל להתאהב בה אבל איך אומרים, עם לב זהב לא הולכים למכולת ולא מעלים ממוצע\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים: הוא ממש רץ וקשה לעקוב אחרי מה שהוא עושה, הוא לוקח כל מיני דברים כמובנים מאליהם ולא מבין שהסטודנטים לא סטטיסטיקאים\n\nשעורי הבית: הכי מעיקים בעולם\n\nהמבחן: זוועה, כל סמסטר הם רק מעלים את הרמה וזה אומר שלא משנה כמה תלמדו ותרגישו מוכנים תקבלו זבבים לפנים, תקוו שפשוט יהיה לכם מזל ותנחשו טוב\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: נדיה\nחוות דעת - הרצאות: נדיה ו גם מרינה שתיהן מרצות מדהימות תלכו למי שמתאים בלוז שלכם\n\nשם המתרגל/ת: נדיה\nחוות דעת - תרגולים: טובה מאוד מסבירה טוב התרגולים חשובים מאוד לדעתי\n\nשעורי הבית:\nמאוד ארוכייים שאלות של 13 סעיפים זה מאוד אהוב עליהם אבל לדעתי חשובים מאוד להבנת החומר גם הלחץ יהיה הגיוני אם חילקתם שיעורי הבית עם השותף\nהמבחן: הוגן לדעתי 75 ציון מאוד אפשרי היו שאלות קשות אבל סבבה בכלל\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה:לידיה בורדו\nחוות דעת - הרצאות: לא נכחתי\n\nשם המתרגל/ת: לידיה בורדו\nחוות דעת - תרגולים:\nתירגולים מצוינים. לידיה מסבירה מעולה ובאמת אכפת לה שהסטודנטים יבינו\nשעורי הבית: קצת ארוכים, אבל מאוד עוזרים להבנת החומר\n\nהמבחן: השנה היה קשה במיוחד, לא דומה למבחנים שפורסמו מהשנים הקודמות\n\nהשורה התחתונה: קורס מעניין, אבל הממוצע ירד משמעותית\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: נדיה\nחוות דעת - הרצאות: מסבירה טוב אבל הפסקתי ללכת באמצע הסמסטר\n\nשם המתרגל/ת: עידו\nחוות דעת - תרגולים:\nמתרגל נפלא מסביר את החמור בצורה ברורה.\nשעורי הבית:\nגיליון כל שבוע, לדעתי ארוכים ומסובכים מידי בשביל 10% תקף.\nיש בוחן אמצע של 20% מגן.\n\nהמבחן:\nהמבחן היה טריקי. מה שהפריע לי הוא זה שלא מפרסמים פתרון מלא של מבחני עבר מה שהופך את הלמידה למבחן לסיוט.\n\nהשורה התחתונה: קורס מעניין שמלמד המון אבל לא הייתי ממליצה עליו בתור בחירה פקולטית קלילה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: מרינה\nחוות דעת - הרצאות: אחלה מרצה, ממש חשוב לה שכולם יבינו את החומר ומתעכבת על שאלות (לפעמים קצת יותר מדי). תכלס ההרצאה היא 3 שעות שבועיות, אבל מרצה אחר יכל לסגור את זה בשעתיים (בלי לענות על ככ הרבה שאלות ולתת ככ הרבה דוגמאות). לטובה ולרעה לדעתי\n\nשם המתרגל/ת: נדיה ואז עידו מוקלט\nחוות דעת - תרגולים: בתחילת הסמסטר הלכתי לנדיה, אחלה מתרגלת אבל לא הסתדר לי בהמשך. לקראת המבחן ראיתי תרגולים מוקלטים של עידו- הוא בסדר אבל קצת פחות התחברתי. אם יש אופציה ללכת לנדיה הייתי ממליצה עליה יותר.\n\nשעורי הבית: עמוסים בטירוף. גליון כל שבוע, ומשבוע לשבוע זה ניהיה יותר ויותר עמוס. הרגשה של אינפי 1, למרות שזה כבר לא קורס לשנה א. לדעתי קצת מוגזם, היה אפשר לוותר על רמת העומס הזאת ועדיין לשמור על שיעורי בית שיעזרו להפנים את החומר כמו שצריך. בסופו של דבר לקראת סוף הסמסטר אין ברירה אלא לרפרנס, כי בלי זה אפשר בקלות לשבת על כל גליון 3 ימים.\n\nהמבחן: היה קצת קשה בסמסטר האחרון, הופתעתי שלא היה פקטור. בסה\"כ דומה מאוד למבחני עבר מבחינת הקונספט, אבל השאלות עצמן היו קשות יותר לדעתי. מה גם שעשו 18 שאלות במקום 20, אז כל טעות הורידה יותר ניקוד מבשנים קודמות.\n\nהשורה התחתונה: לא קורס מומלץ בכלל אם זה בחירה, אבל הרוב פשוט חייבים לעשות אותו אז אין מה לעשות. לא לקחת בסמסטר עמוס מדי.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 5.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nאביב 2025       א' 72  סופי 72  בורדו נדיה\nחורף 2024-2025  א' 78  סופי 79\nאביב 2024       א' 73  סופי 77\nחורף 2023-2024  א' 79  סופי 83  בוגומולוב מרינה\nאביב 2023       א' 76  סופי 82\nחורף 2022-2023  א' 68  ב' 67  סופי 71  בורדו נדיה\nקיץ 2022        א' 78  ב' 78  סופי 81  בורדו נדיה\nאביב 2022       א' 64  ב' 62  סופי 67\nחורף 2021-2022  א' 77  ב' 63  סופי 75\nקיץ 2021        א' 71  ב' 78  סופי 78\nאביב 2021       א' 71  ב' 65  סופי 71  בורדו נדיה\nחורף 2020-2021  א' 71  ב' 77  סופי 77  בוגומולוב מרינה\nאביב 2020       א' 76  ב' 78  סופי 80  בוגומולוב מרינה\nחורף 2019-2020  א' 75  ב' 76  סופי 80  בורדו נדיה\nקיץ 2019        א' 86  סופי 88  בורדו נדיה\nאביב 2019       א' 72  ב' 75  סופי 78  בוגומולוב מרינה\nחורף 2018-2019  א' 74  ב' 70  סופי 77  בוגומולוב מרינה\nקיץ 2018        סופי 75  בורדו נדיה\nאביב 2018       א' 73  ב' 74  סופי 78  בוגומולוב מרינה\nחורף 2017-2018  א' 79  ב' 70  סופי 78  בוגומולוב מרינה\nאביב 2017       א' 76  ב' 74  סופי 79  בוגומולוב מרינה\nאביב 2016       א' 79  ב' 76  סופי 81  לביא אביטל\nאביב 2015       א' 80  ב' 80  סופי 83  בוגומולוב מרינה\nמבחן מועד א': 63\nסופי מועד א': 72\nסופי: 72\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n24 21 3 88 30 100 72.667 72.5\nאיש סגל תפקיד\nבורדו נדיה מרצה - אחראי מקצוע\nגרינס עדו מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}