{
  "course_id": "096450",
  "scraped_at": "2025-12-16T13:38:43.871613",
  "information": {
    "raw_text": "00960450 - השוואות מרובות\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהסקה סימולטנית והסקה לאחר בחירה. נושאים: בעיית ההשוואות המרובות, מדדי טעות, עוצמה, רווחי סמך סימולטניים, שיטות להשוואות מרובות במודל ניתוח שונות, שיטות לשליטה על ETAR RORRE ESIW-YLIMAF, שיטות לשליטה על שיעור התגליות השגויות (RDF), רווחי סמך עם שליטה על ETAR EGAREVOC ESLAF שיטות לבדיקת הדירות, יישומים בגנומיקה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לזהות בעיות של השוואות מרובות ביישומים ולהתאים שיטות לשליטה על תגליות שגויות. 2. ליישם שיטות להשוואות מרובות על-ידי כתיבת תכניות מחשב וכן בעזרת שימוש בתוכניות מחשב קיימות. 3. לבנות פרוצדורות לשליטה על ETAR RORRE ESIW-YLIMAF. 4. לבדוק תכונות של פרוצדורות להשוואת מרובות באופן תאורטי ועל-ידי סימולציה נומרית. 5. להשוות בין פרוצדורות להשוואות מרובות באופן תאורטי ועל -ידי סימולציה נומרית.\n\nמקצועות קדם: 00940424 או 00940423\n\nמועד א': 16-02-2026\nמועד ב': 17-03-2026\n\nהערות: הקורס יתקיים בימי חמישי בשעות 12:30-15:30\nהקורס כולל מבחן.",
    "title": "00960450 - השוואות מרובות"
  },
  "feedback": {
    "summary": {
      "text": "4 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: מרינה בוגומולוב\nחוות דעת - הרצאות: מרינה מקסימה! עוזרת ועונה לכל שאלה. מרינה מגיעה מוכנה לשיעורים ומעבירה את ההרצאות מצויין. חומר רלוונטי לרפואה. הרצאות מעניינות מאוד. יש רמה מתמטית גבוהה בחלק מהן. מרינה נהדרת.\n\nשעורי הבית: שב מאוד ארוכים אבל לא מאוד קשים. מרינה עוזרת מאוד.\n\nהמבחן: מבחן הוגן ולא קשה במיוחד.\n\nהשורה התחתונה: מרינה מרצה מדהימה. קורס מומלץ לחובבי הסטטיסטיקה ובפרט לחובבי הסטטיסטיקה ברפואה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: מרינה בוגומולוב\nחוות דעת - הרצאות: הרצאות מבולגנות ולא מובנות בכלל המצגות לא רלוונטיות ולא אינפורמטיביות\nאי אפשר להבין ממנה כלום היא לא מבינה את השאלות ולא מסבירה מובן בכלל\n\nשעורי הבית: ארוכים לא ברורים ולא מובנים\n\nהמבחן: ארוך באורך לא נורמלי והוא גם לא מובן\n\nהשורה התחתונה: מרצה לא טובה במיוחד לא מבינים כלום בקורס\nלהתרחק כמו מאש\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: מרינה בוגלומוב\nחוות דעת - הרצאות: מתישות, מצגות לא מספיק אינפורמטיביות, מבולגן מאוד במהלך ההרצאה וגם בכתיבה\n\nשם המתרגל/ת: אין\nשעורי הבית: ארוכים בטירוף, לא מובנים לפחות בחצי מהם.\n\nהמבחן: דומה לשנים קודמות, ארוך מאוד, נבדק יחסית עדין אבל לא כיף בכלל\n\nהשורה התחתונה: עדיף שלא\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nאביב 2023       א' 86  בוגומולוב מרינה\nאביב 2022       א' 89  סופי 89  בוגומולוב מרינה\nאביב 2021       א' 87  סופי 82  בוגומולוב מרינה\nחורף 2019-2020  א' 92  סופי 92  בוגומולוב מרינה\nאביב 2019       א' 94  סופי 94  בוגומולוב מרינה\nמבחן מועד א': 82\nסופי מועד א': 86\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n11 10 1 91 48 100 86.091 91\nאיש סגל תפקיד\nבוגומולוב מרינה מרצה - אחראי מקצוע\nגרינס עדו מרצה\nזיו דוד מורן סגל מנהלי - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}