{
  "course_id": "094290",
  "scraped_at": "2025-12-16T13:22:21.205632",
  "information": {
    "raw_text": "00940290 - מעבדה באיסוף וניהול נתונים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nקביעת הציון על פי מעקב במהלך הסמסטר והגשת דו\"חות דו-שבועית. המעבדה מכסה את הנושאים הבאים: איסוף נתונים מסנסורים, השמטת נתונים מושכלת, קריאת קובץ פלט ופיצולו לזרמי מאורעות, ניקוי נתונים, שמירת נתונים בענן, שמירת ואחזור נתונים ממסד ECUDER-PAM ,LQSON, ו-.POODAH\n\nמקצועות קדם: 00960224\n\nהערות: שימו לב - המעבדה תערך ביום ג' בשעה 16:30-18:30",
    "title": "00940290 - מעבדה באיסוף וניהול נתונים"
  },
  "feedback": {
    "summary": {
      "text": "5 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: נועם כהן\nחוות דעת - הרצאות:\nהרצאות לא תורמות ככ, רוב התוכן שנלמד זה או מהרצאות אורח או חומר שכבר יודעים.\nנועם בנאדם טוב שממש רוצה לעזור ומאוד מוכן לשמוע לסטודנטים\n\nשם המתרגל/ת: שגיא/עידו\nחוות דעת - תרגולים:\nלא היו תרגולים\n\nשעורי הבית:\nבאיכות נמוכה מאוד. או שהתרגילים ברמת קושי של שנה א' (באסה בקורס חובה שאמור לסגור את התואר) או שהם בנויים עם מלא בעיות לוגיות, שאלות סותרות ומשאבים תכניים (שרת ספארק) מזעזע שלא מאפשר עבודה.\nמקווה שישתפרו לאיטרציות הבאות של הקורס.\n\nהמבחן:\nאין, יש פרויקט\n\nהשורה התחתונה:\nקורס ביזבוז זמן, עדיף היה לוותר עליו ולתת לאנשים לקחת קורס בחירה שהיה יכול אשכרה ללמד אותם.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "נושא הקורס הסמסטר היה זיהוי חריגים ועל פניו צריך היה לדמות פרויקט אמיתי בתעשייה על כל המשתמע מכך. בפועל, רוב ההרצאות היו של מרצים אורחים ורובם לא היה רלוונטי ולא למדנו חומר חדש בכלל.\nהסמסטר כולו היו מלווה בבעיות טכניות נוראיות בשרתים שהקשו על העבודה. עם זאת, ניכר היה ששגיא ועידו היו זמינים וקשובים וניסו לעשות את ההתאמות הדרושות. הייתה גם התחשבות בהגשות חוזרות בפרויקטים הסופים והציונים היו גבוהים.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: נועם כהן\nחוות דעת - הרצאות: הסמסטר לא הייתה חובת הגעה אז לא הלכתי בכלל ותאמת גם לא הרגשתי שזה שינה במשהו. בתור מי שמנהל את כל הקורס נועם עזר לנו מאוד בטיפול בכל הבעיות הטכניות שהיו במהלכו והיה מאוד אכפתי וקשוב לסטודנטים.\n\nשם המתרגל/ת: אילנית וסתיו\nחוות דעת - תרגולים: עזרו כמה שיכלו ונתנו פידבקים ממש טובים במהלך העבודה על התרגילים והפרויקט. היו זמינים במייל ועזרו הרבה בשעות קבלה שלהם.\n\nשעורי הבית: שני תרגילים, כל תרגיל בתכלס מאגד הרבה נושאים שראינו בתואר (מסדי נתונים, סטטיסטיקה, ,ML ומה שאתם לא רוצים תכלס). דורשים השקעה אבל סה\"כ סבבה (למרות שעל תרגיל 2 כן היו ציונים קצת נמוכים).\n\nהפרויקט: הסמסטר קיבלנו המון דאטא של פרופילים בלינקדאין והפרויקט היה תכלס לבנות פיצ'ר חדש מבוסס על ML. נתנו יד חופשית לקחת את זה לאן שרוצים וחוץ מזה שהיה צריך לעשות סקרייפינג לעוד דאטא עם איזו חברה חיצונית וזה היה כאב ראש, סה\"כ תהליך העבודה היה די סבבה ובאמת מדגים שימוש בכל הדברים שלומדים בתואר.\n\nהשורה התחתונה: סה\"כ בסדר, אחלה סגל והתוצאות בסוף היו נחמדות.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: נועם לפעמים בולע מילים ומאוד שקט, אפשר להצליח גם בלי להגיע להרצאות\n\n\nשעורי הבית: היו המון תיקונים תוך כדי תקופת ההגשה אבל המתרגלים מאוד נחמדים מסבירים ועוזרים בשיעורים. מתחשבים בבדיקה. השיעורים דורשים זמן והם עמוסים אבל לגמרי אפשרי\n\nהמבחן: אין, יש פרוייקט סוף עם הצגה הפרוייקט היה מעניין נתן ניסיון עם כמויות גדולות של דאטה שרלוונטי לתעשייה. קורס חשוב.\n\nהשורה התחתונה: קורס חובה ציונים גבוהים\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 89  סופי 91  כהן נועם אשר\nחורף 2023-2024  א' 93  סופי 93\nחורף 2022-2023  א' 92  סופי 92\nחורף 2021-2022  א' 90  סופי 90\nחורף 2020-2021  א' 95  סופי 95\nחורף 2019-2020  א' 97  סופי 97\nסופי מועד א': 89\nסופי: 91\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n92 91 1 99 74 100 91.143 91\nאיש סגל תפקיד\nכהן נועם אשר מרצה - אחראי מקצוע\nגליק אופק מתרגל\nשיתוף היסטוגרמות"
  }
}