{
  "course_id": "096606",
  "scraped_at": "2025-12-16T13:48:17.095594",
  "information": {
    "raw_text": "00960606 - כלכלה התנהגותית בסביבה טכנולוגית\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס יסקור בעין ביקורתית תאוריות ושיטות מרכזיות בכלכלה התנהגותית, בדגש על שיטות יישומיות המיועדות להשפעה על התנהגות בסביבות עתירותטכנולוגיה. ננתח יישומי כלכלה התנהגותית מוצלחים יותר ופחות, נבין את ההזדמנויות והאתגרים שעולים כתוצאה מנטיות התנהגותיות אנושיות ונפתח עקרונות לשימוש אפקטיבי בכלכלה התנהגותית בתכנון מנגנונים מבוססי משתמש ובפיתוחים טכנולוגיים. תוצאות למידה: בסיום הקורס הסטודנט יהיהמסוגל: 1. לתאר שיטות מרכזיות להשפעה על התנהגות מעולם הכלכלה ההתנהגותית, להסביר את הרעיונות התאורטיים העומדים מאחוריהן ולדון ביתרונותיהן ובחסרונותיהן היחסיים. 2. לנבא, ברמת דיוק סבירה, האם ועד כמה התערבות מסוימת מעולם הכלכלה ההתנהגותית תהיה אפקטיבית והאם היא עלולה לגרום לתוצאות לוואי לא מתוכננות, במחקר וביישומים בעולם האמיתי. 3. לתכנן התערבויות התנהגותיות אפקטיביות שיגדילו את סיכויי ההצלחה של מנגנונים ופיתוחים טכנולוגיים המבוססים על התנהגות המשתמשים. 4. ליישם התערבויות מעולם הכלכלה ההתנהגותית בחיי היום יום שלהם ובפיתוח מוצרים טכנולוגיים.\n\nמקצועות קדם: 00960275 או 00950605\n\nהערות: בקורס 3 שעות הרצאה בלבד ביום ה' בשעות 10:30-11:30 ו-12:30-14:30",
    "title": "00960606 - כלכלה התנהגותית בסביבה טכנולוגית"
  },
  "feedback": {
    "summary": {
      "text": "4 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: אורי פלונסקי\nחוות דעת - הרצאות: מעניינות וברורות\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: לא רלוונטי\n\nשעורי הבית: לא קשים.\n\nהמבחן: פרוייקט סופי\n\nהשורה התחתונה: הקורס בנוי היטב, מעניין למי שמעניין אותו איך התנהגות אנשים משפיעה עליהם ביום יום ואיך הטיות מובנות במוח שלנו משפיעות על ההחלטות שלנו.\nהמרצה מסביר ממש טוב ולפני הכל הוא בן אדם טוב מאוד שמתייחס לכולם באופן שווה ומכבד כל השאלות.\nהוא אוהב לפתוח שיח מעניין בהרצאות בינו לבין הסטודנטים, רואים שהוא נהנה ללמד אותנו.\nכל שבוע יש מטלת קריאה.\nבסוף מגישים פרוייקט שהוא דו\"ח, לוקחים בעיה התנגותית, ומנסים לשנות אותה דרך כלים שלמדנו בקורס ועל זה כותבים דוח (כלומר אין תכנות אם לא בא לכם אבל מי שכן מתכנת לו איזשהי אפליקציה יקבל נקודות בונוס טובות)\nשורה תחתונה: מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: אורי פלונסקי\nחוות דעת - הרצאות:\nקצת מפורט מדי\n\nשם המתרגל/ת: -\nשעורי הבית:\nקליל\n\nהמבחן: אמריקאי, קל\n\nהשורה התחתונה: נראה כאילו זה קורס קליל, אבל אצלנו היה גם פרויקט, גם מבחן, גם קריאת מאמרים (כולל להגיב עליהם) וגם ש\"ב, כל אחד לחוד היה סבבה אבל השילוב דרש דיי הרבה שעות\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: אורי\nחוות דעת - הרצאות: שיעורים באווירה טובה, מלמד בצורה מעניינת\n\nשם המתרגל/ת: איל\nחוות דעת - תרגולים: אין\n\nשעורי הבית: 2 תרגילי בית, אחד בזוגות (התאמת עקרונות שנלמדו בקורס על אירועים מהחיים) ואחד ביחידים (לעשות על עצמי ניסוי תוך שימוש בעקרונות שנלמדו בקורס ולתעד). סך הכל סבירים ולא הרגשתי שהעמיסו יותר מדי (אם בכלל), מההרגשה שלי בעיקר צריך לדעת איך להסביר את עצמך כמו שצריך. הבדיקה קצת קוטלת, אבל יש הרבה מקום בתרגילים האלה לרפלקציה אישית, אז עם הסבר טוב אפשר לקבל ציון גבוה (או אפילו לערער ולשפר ציון).\n\nהמבחן: פרויקט בזוגות, או משימת חיזוי תכנותית (שבפועל היא ניסיון לשפר את המחקר של איל) או משימת הצעת מחקר שבה צריך לבחור בעיה כלשהי ולהציע ניסוי שבוחן שאלת מחקר מסוימת. צריך לדעת לחקור ולחפור. ההגשה לאחרי מועדי א'.\n\nהשורה התחתונה: מבחינת החומר קצת מרגיש כמו מל\"ג, אווירה של תואר בפסיכולוגיה. יכול להיות מעניין למי שמתעניין בתחום של כלכלה התנהגותית/קרא קצת דן אריאלי או כהנמן, וגם אלה נקודות יחסית קלות בהשוואה לקורסים אחרים בפקולטה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 91  סופי 91  פלונסקי אורי\nאביב 2024       א' 91  סופי 91  פלונסקי אורי\nחורף 2022-2023  א' 89  סופי 88  פלונסקי אורי\nחורף 2021-2022  א' 90  סופי 90  פלונסקי אורי\nסופי מועד א': 91\nסופי: 91\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n20 20 0 100 82 99 91.6 92\nאיש סגל תפקיד\nפלונסקי אורי מרצה - אחראי מקצוע\nמרנץ איל מתרגל\nשיתוף היסטוגרמות"
  }
}