{
  "course_id": "094312",
  "scraped_at": "2025-12-16T13:26:17.693035",
  "information": {
    "raw_text": "00940312 - מודלים דטרמיניסטים בחקר ביצועים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 4\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nמתודולוגיה של חקר ביצועים. תכנון לינארי. ניסוח בעיות שונות כבעיות בתכנון לינארי. אלגוריתמים לפתרון בעיות ת\"ל, דואליות וניתוח פוסט-אופטימלי. תכנון בשלמים ושיטות סיעוף וחתכים. זרימה ברשתות, תורת המשחקים. תכנון דינמי.\n\nמקצועות קדם: (01040019 ו-02340111) או (01040019 ו-02340221) או (02340221 ו-01040016)\n\nמקצועות ללא זיכוי נוסף (מכילים): 00940390 00950606\n\nמקצועות ללא זיכוי נוסף: 00940313 00940380 00960390 00960609\n\nמועד א': 12-02-2026\nמועד ב': 16-03-2026",
    "title": "00940312 - מודלים דטרמיניסטים בחקר ביצועים"
  },
  "feedback": {
    "summary": {
      "text": "21 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "אם מחפשים חוות דעת תצפו בשל 094313 אותו קורס רק שינו את הניקוד\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: שמרית מרצה מצויינת עם המון ידע וניסיון ותמיד יהיה לה הסבר טוב לכל שאלה שתעלה לכם. האווירה בכיתה הייתה טובה אבל שלוש שעות שלפעמים שעה מתוכן מוקדשת להוכחות מייגעות זה לא קל...\nאחת הבעיות העיקריות של הקורס היא שהוא לא מונגש בכלל. מעבר לכך שאין הקלטות לתרגולים ולהרצאות, הסגל מפרסם רק את השלד של השיעור (שזה נוח) אבל לא מפרסם את השלד המלא אחרי השיעור. זה הופך את ההשלמה של החומר, אם פספסתם, לקשה במיוחד.\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: בסך הכל יוני מתרגל טוב. הוא מאוד השתדל להנגיש את החומר בצורה ברורה ונתן הסברים ודוגמאות טובות.\n\nשעורי הבית: גליונות שבועיים. לרוב לא קשים מאוד אבל בהחלט ארוכים ולקראת סוף הסמסטר כבר מייגעים ממש.\n\nהמבחן: מבחינת רמת השאלות, המועד א' היה מאוד מאוד הוגן הסמסטר. הבעיה הייתה דווקא בזמנים באופן מפתיע. כתיבת הפתרון בחלק מהשאלות לקחה המון זמן ככה שהיו אנשים שהגיעו לסוף המבחן ולא סיימו סעיפים או אפילו שאלה שלמה(!).\n\nהשורה התחתונה: בסך הכל קורס מעניין ונותן בסיס רחב לתכנות ליניארי ואופטימיזציה. יש מקום לשיפור בכל מה שקשור להנגשה שלו לסטודנטים :)\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: מרצה מצוינת. צריך להגיע להרצאות פרונטלית ואין הקלטות, אבל הרבה פעמים החומר בהרצאות חופף ב-100% לחומר בספר הקורס אז לא להיבהל אם פספסתם הרצאה.\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: מתרגל לא טוב, חסר ניסיון. מבולגן, איטי מאוד, הופך גם חומר מעניין למייגע. הנקודה הטובה - הוא באמת אכפתי לסטודנט. אם במקרה אתם מוצאים הקלטות של אייל גור, כדאי לצפות בהן. אני לא מצאתי לצערי.\n\nשעורי הבית: הוגנים בסה\"כ, לא לוקחים יותר מאחה\"צ אחד בשבוע. טיפ: בהרבה שיעורי בית ניתן לוודא את התשובות בעזרת צ'אטג'פט. לא מומלץ בכלל לפתור בעזרתו מלכתחילה כי לא תלמדו ככה כלום וחבל, אבל אתם כן יכולים לתחקר אותו בסוף כדי לוודא שאתם לא מגישים שטויות וללמוד מזה.\n\nהמבחן: הוגן. ראיתי שהרבה אנשים התלוננו שלא היה מספיק זמן, לדעתי העניין הוא יותר חוסר איזון בין הזמן שלוקחות השאלות השונות (השאלה הראשונה של כ-30 נקודות לקחה לי שעה, השאלה השנייה של 20 נקודות לקחה לי 5 דקות).\nהמסר אליכם: לא להיתקע על שאלות, ולהתחיל מהשאלות הקלות יותר.\n\nהשורה התחתונה: סה\"כ קורס מעניין, בניגוד להרבה קורסים בפקולטה שלנו הוא בנוי טוב ויש מספיק משאבים ללמוד מהם, אם יש לכם מתרגל שאינו יוני כדאי לבחור בו. יהיה בסדר :)\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: מרצה ברורה, תמיד עונה על כל השאלות. לא מנגישה הקלטות בכלל. מעלה סיכומים לא מלאים לפני ההרצאה ובהרצאה משלימה אותם ועוברת עליהם. חסר לה סדר. אצלנו ההוכחות היו לא רלוונטיות למבחן, פחות מומלץ להתעכב. בדרכ השעה האחרונה של ההרצאה מוקדשת להוכחות מתישות ולא תמיד חשובות.\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: יוני מתרגל בסדר יחסית לסטונדט שנה שלישית. מרגיש שבחלק מהנושאים, בעיקר באחרונים שהם חדשים בקורס הייתה לו פחות שליטה.\n\nשעורי הבית:\nלא היו קשים או ארוכים. לקראת הסוף הגליונות קצת יותר ארוכים, אבל לא משהו מיוחד. ברמה אחת מעל התרגול\n\nהמבחן: המבחן היה הוגן מבחינת רמת השאלות, לא הייתה אף שאלה שלא ראינו בתרגול או בהרצאה(שאלה אחת הייתה מועתקת אפילו מההרצאה ועוד שאלת הדגמה והייתה אפילו שאלה שהועתקה ממבחן ישן מאוד/ספר הקורס). הייתה בעיה קריטית של זמן(מי שאומר שלא כנראה היו לו שבועיים להתכונן כי היו כמה שחוזרים על הקורס או עם מערכת שונה ולא 4 ימים כמו רוב הסטודנטים) וכדי להגיע לרמת שליטה ומהירות בפתרון הבחינה היה צריך תרגול מסיבי ולזכור הרבה טריקים מקצרים(בין אם זה אלגברה או כל מיני נקודות קטנות שנאמרו בהרצאות), רוב הסטודנטים לא פתרו שאלה אחת או כמה סעיפים וזה בה לידי ביטוי בציונים. למרות זאת הציונים היו בסדר ולכן לא נתנו פקטור.\n\nהשורה התחתונה: החלק הראשון בקורס מאוד מזכיר אלגברה לינארית בגרסה \"פשוטה\" יותר(עם כמה מושגים מחדווא 2 כמו גרדיאנט) ופחות מעניין. החלק השני והחדש בקורס הוא מעין המשך של מבני ומתעסק בבעיות בגרפים(בעיקר יישומים של בעיות זרימה) והוא מאוד מעניין ומאוד נהנתי ממנו. חבל שהמבחן היה בנוי בצורה הזאת(5 שאלות ב3 שעות לעומת 4 במבחנים קודמים או מבחנים ישנים 5 שאלות ו-3 וחצי שעות) ואני בספק שהמתרגל פתר אותו על זמנים בעצמו(בלי הגבלת זמן כנראה שרובנו היינו מקבלים ציון גבוה יותר)\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המתרגל/ת: יוני\nחוות דעת - תרגולים:\nיוני מתרגל מאוד אכפתי וממש חשוב לו להנגיש את החומר בצורה הכי טובה ונוחה לסטודנט ..\nתמיד נתן טיפים תוך כדי התרגולים לדברים שעזרו לו להצליח בקורס וטכניקות בכדי לא לבזבז זמן במהלך המבחן\nאחלה מתרגל\nשעורי הבית:\nסבירים אך לפעמים צריך לעשות דירוג מטריצות הרבה פעמים וזה מעצבן\nהמבחן:\nהמבחן היה ארוך במקום 4 שאלות היו לנו 5 וכמעט ולא היה זמן לפתור את הכל האמת וזה מה שתכלס הוריד את הציון , לא נתנו פקטור\nהשורה התחתונה: קורס סבבה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה:שמרית\nחוות דעת - הרצאות: ההרצאות היו מעניינות אבל היה קשה מאוד להתרכז 3 שעות ברצף , היה קצת קשה להבין את החומר בצורה מלאה כי לא היה הקלטות להרצאות , גם היה קשה לכתוב בו זמנית .\n\nשם המתרגל/ת: יוני\n\nחוות דעת - תרגולים: מתרגל מהמם! העביר לנו את החומר בצורה יפה מאוד , הוא השלים את הפערים שהיו לנו מההרצאות , הסביר את החומר היטב לפני שהיה פותר שאלות, הוא מצוין , מתרגל שאכפת לו מהסטודנטים שלו , התרגולים מאוד עזרו לי להבין את החומר , ולפעמים אפילו היה מספיק ללכת לתרגולים שלו\nשעות הקבלה שלו ממש עוזרות, עשה לנו שעת קבלה לפני מועד א שהייתה אמורה להיות שעה או שעתיים הפכה להיות 4 שעות\nכי פשוט הוא רוצה שנבין ונצליח\nאם יש לכם מתרגל בשם יוני , ללכת רק אליו .\n\nשעורי הבית:\nעמוסים , לוקחים זמן , אבל המתרגל עוזר אם תשאלו אותו בשעת הקבלה\n\nהמבחן:\nמועד א׳ לא היה קל , אבל ניתן להצליח בקלות\n\nהשורה התחתונה: הקורס היה מעניין, בזכות יוני (המתרגל) הבנתי לעומק והתעניינתי יותר בקורס.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: שמרית מעבירה את החומר טוב, הייתי שמחה אם הייתה מנגישה יותר את החומר (למשל לפרסם רשימות של הוכחות), אבל סהכ היא לימדה באווירה טובה, פתוחה לשאלות ומאוד נחמדה. כדאי להיעזר בספר קורס ולהיות על זה בסמסטר כי זה הרבה חומר :)\n\nשם המתרגל/ת: יוני המלך!!!!!\nחוות דעת - תרגולים: אחלה מתרגל שבעולם. כל תרגול מעמיק, וממש הסביר את כל מה שלא הבנתי בהרצאה. תמיד עם רצון טוב לעזור, ובאמת עוזר. מסביר את החומר באופן שבאמת מונגש לסטודנט ולא מלמעלה- ולדעתי זה בעיקר היתרון בזה שסטודנט מתרגל אותנו. מבחינתי אחד המתרגלים היותר טובים, סבלנות אין קץ והטוב מקרין החוצה- אז מאוד נהניתי ללכת לתרגולים שלו הסמסטר\nממליצה\n\nשעורי הבית: שבועיים, קאדר אבל חשוב\n\nהמבחן: הוגן\n\nהשורה התחתונה: בצ'יז פורק מגיבים או מי שמבסוטים או מי שממורמרים, לרוב מי שממורמרים, אז קחו את הביקורות הרעות בפרופורציות, מנקודת מבט של סטודנטית זה אפילו מרגיש שיש כאן ליטרלי קנאה במתרגל. אמרתי את זה. drop the mic\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nאני חושבת ששמרית מרצה טובה ושולטת בחומר בצורה יפה ומעבירה גם החומר בצורה טובה\nחוות דעת - הרצאות:\nסבבה , לפני המבחן חזרתי עליהם במהירות\nשם המתרגל/ת: יוני המלךך!!!!\nחוות דעת - תרגולים: יוני המתרגל הכי טוב שראיתי בטכניון, הוא נותן מהלב שלו אוהב את החומר ואנחנו יכולים לראות את זה מהצורה שהוא מלמד בה\nהוא עונה על המיילים במהירות , פשוט נותן מהלב שלו\nוהוא היה המתרגל היחיד בקורס! וגם סטודנט\n! הוא פשוט superman\n\nשעורי הבית: סבבה והם מלמדים את החומר בצורה אובה עדיף לחזור עליהם לפני הבחינה\n\nהמבחן:\nהרמה של הבחינה היתה סבבה פשוט הזמן לא היה כל כך מספיק\nהשורה התחתונה: קורס סבבה החומר סובר מעניין לא כל כך קשה אבל גם לא קל\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית שטרן\nחוות דעת - הרצאות:\nמרצה טובה ושולטת בחומר. אם פונים אליה עם שאלה ספיציפית היא עוזרת מאוד.\nאין הקלטות, לכן עדיף להקשיב בהרצאות במקום להתעסק בטבלאות ו...\nאם מתקשים בהבנת הוכחות לא להתעקב. מה שיותר חשוב זה התרגולים לדעתי.\n\nשם המתרגל/ת: יונתן וולך המלך\nחוות דעת - תרגולים:\nהתרגולים חשובים מאוד!!!!\nכסטודנט שנה שלישית ולמרות היותו מתרגל פעם ראשונה, יוני הוכיח את עצמו בתור מתרגל השולט בחומר והצליח לתת מענה לכל השאלות תוך מתן יחס לכל הסטודנטים, והיה מוכן לשאר לאחר סיום התרגול (אפילו שעת הקבלה לפני המבחן נמשכה בין 4-5 שעות עד שנתן תשובות לכל השאלות ועוד זה לאחר שעות הקבלה של המילואמניקים!!)\nתכלס מתרגל מומלץ ואחד הטובים בטכניון.\n\nשעורי הבית:\nשיעורי בית שבועיות, הגשה בזוגות. לפעמים עמוסות אך חשובות להבנת החומר - במיוחד שאלות ההוכחה/הפרכה.\nאפשר שתחלקו שאלאות בין השותפים אם אתם לחוצים אבל *תמיד* לעבור על הפתרון הרשמי של כל השאלות!\n\nהמבחן:\nהאמת: לא קשה, אבל לא היה מספיק זמן.\n\nהשורה התחתונה: יוני מלך.\nקורס מעניין וניתן לקבל ציון, אבל *אסור לוותר* על התרגולים. ותלכו אצל יוני. יוני מלך.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: גם אם לא תבינו כמעט כלום בהרצאה תבינו קצת אחרי זה בתרגול. ממליצה לקחת שקפים מלאים משנים קודמות ולנסות לעבור עליהם במהלך השיעור. כי אחרת אתה נמצא במרתון כתיבה במקום בנסיון הבנה של החומר התכלס לא ככ מסובך הזה.\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: יוני באמת ניסה, והראה מאמץ עם זאת לעיתים היה לא מוכן מספיק לתרגול בימי ראשון ואז כן מוכן לתרגול ביום שני.\n\nשעורי הבית: זה השלב בו אתה פותח רפרפנס הרצאה ותרגול וביחד מבין את החומר ואומר אהההה כל מה שהם חפרו אליו דווקא אלגוריתם מכאני ולא מסובך בכלל.\n\nהמבחן:הפתיע לטובה. ממש סביר, אשכרה בודק את חומר הקורס ואת ההבנה שלו. כן צריך ללמוד המון דברים ואלגוריתמים בעל פה אבל אז אתה בא מקיא אותם במבחן והולך הביתה לישון.\n\nהשורה התחתונה: חבל שצוות הקורס לא בא יותר לקראת הסטודנטים (פרט לשעות קבלה לפני המבחן שיוני עשה המון) למה אם השותפה שלי יוצאת לחודש מילואים אני צריכה לעשות את המטלות השבועיות לבד או לנטוש אותה שתסתדר להשלים את החומר כשהיא חוזרת ותמצא שותף חדש. חבל מאוד שלא אישרו הצטרפות לזוג אחר במידה ויש אישור מילואים. חבל ששמרית ויוני לא מפרסמים את החומר ההרצאה והתרגול לפני/אחרי כדי שלא אאלץ לשבור את היד במרתון כתיבה אינטנסיבי. המון דברים בקורס הזה נפתחים בחבל כשהוא 4 נקז ומאוד שטחי. אבל הוא חובה אז מה יש לעשות\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: שמרית מרצה וותיקה בסמסטר, אני חוזר על הקורס ועדיין לא היה משעמם איתה, מרצה מקצועית מאוד קשובה מאוד והכי חשוב נותנת הרגשה טובה בקורס.\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: בתחילת הסמסטר הייתה אמורה להיות מתרגלת נוספת ביום ראשון בערב, אבל בגלל מילואים יוני מילא את מקומה, אין מה לומר על יוני, בתור אחד שחזר על הקורס, אני באמת חושב שהוא היה מדהים, כמה כריזמה כמה מקצועיות כמה אדיבות, מזל שהלכתי אליו, חשוב לציין שיוני היה מתרגל אחראי על הסמסטר הראשון שהוא מתרגל, והוא צלח את זה בטירוף, אני חושב שעצם זה שהוא עשה שעת קבלה לפני המבחן שהייתה במשך 4 וחצי שעות (זה כי אני פרשתי) מראה כמה רצון ומקצועיות יש בו. בשונה ממתרגלים אחרים בשנים קודמות יוני היה כותב תשובות *מלאות* לכל תרגיל ותמיד היה שולח במייל השלמות לדברים שלא הספיק או שלא היו ברורים לטענתו. כשהתלבטתי האם לגשת למועד ב' - יוני הציע לי לשבת על המועד א' לחדד דברים שאולי אני צריך בהם עזרה.\n\nהחסרון היחיד היה הזמן הקצר של התרגול וכמות המידע שצריך להעביר בו, לפעמים היו תרגילים ארוכים, או פשוט שזו השעה המאוחרת של אותו היום, מה שחשוב זה שיוני סיפק הקלטות והיה קשוב.\n\nשעורי הבית: ממוחזרים, אבל עדיין נראה שקצת מיותר להתעסק בקוד כשזה לא רלוונטי לקורס הזה, יש חבילות מובנות לכל הקקי הזה\n\nהמבחן: קצת מבאס לגלות שבמועד א' שהיו 5 שאלות, לא היה נקודה אחת של פקטור, אבל במועד ב' היו 4 שאלות. המבחן במועד א' לא היה קשה בכלל, הוגן לחלוטין, הלוואי היה לי זמן לסיים אותו\n\nהשורה התחתונה: אחלה קורס, הוא במגמת שיפור, הופך רלוונטי יותר, חוץ מהאלגוריתם ההונגרי מה דה פאק\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שימרית\nחוות דעת - הרצאות: לא יצא לי ללכת יותר מדי אך מהפכנים היחידות שהלכתי היא מעולה\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: מעולה ושום מילה אחרת לא תתקבל\n\nשעורי הבית: לא כאלו נוראיים , עושים אותם בזוגות , 4-6 שעות השקעה בשבוע\n\nהמבחן: אני לצערי ניגשתי רק למועד ב אך ממה שיצא לי לראות שני המועדים הוגנים .\nמה שכן תשקיעו בנושא של השבועיים הראשונים עם כל האינדיקטורים כי חבל , זה 20 נקודות מתנה לרוב\n\nהשורה התחתונה: אחלה קורס נותן קדימון נחמד בסך הכל הכללי\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: יחסי אנוש פח ולא אכפת לה מהסטודנטים. הייתה תחושה שצריך לבוא להרצאות כי גם אין הקלטות, אבל בדיעבד אפשר לקרוא סיכום של מי שהיה או לעבור על זה לבד. היא כן עונה על שאלות אבל מבזבזים ככ הרבה זמן מהשיעור על הוכחות לא רלוונטיות שחבל שלא קיצרו את ההרצאות לשעתיים. בכללי היה לנו בלגן עם הקורס כי איחדו אותו עם קורס אחר והעלו את הנקז, מה שגרם גם לבעיות עם המטלות ובסוף כולם קיבלו 100 אחרי השקעה של כל הסמסטר.\n\nשם המתרגל/ת: יוני וולך\nחוות דעת - תרגולים: אי אפשר לומר שהוא לא התאמץ, הוא בהחלט ניסה להסביר ולענות על שאלות, אבל הרבה פעמים הוא פשוט היה מסתבך עם עצמו בהסברים ורק היה מבלבל אותנו, או שהוא היה נתקע על נקודות לא קריטיות שקשורות לסיפור של השאלה במקום לדאוג לflow של הפתרון. הוא כן השקיע והיה לו אכפת, אבל לא תרגל טוב בעיניי. לפני המבחן הוא עשה שעת קבלה של איזה חצי יום שזה היה מטורף. זה פעם ראשונה שהוא מתרגל, וכשהוא עשה את הקורס הוא היה במתכונת הישנה, לכן היה הרבה חומר שהוא למד בפעם הראשונה איתנו. הוא גם היה אמור להתחלק עם מתרגלת נוספת ובסוף הוא עשה את שתי הקבוצות. פשוט לצערי זה לא היה מספיק טוב.\n\nשעורי הבית: גליון בזוגות כל שבוע, קצת מעיק אבל יש רפרנסים לחלק. אנחנו גם השתמשנו פעם ראשונה בג'ופיטר שזה לתכנת קטעי קוד קצרים, אבל זה רק לגליונות ואין לזה שום זכר במבחן.\n\nהמבחן: היה קשה ללמוד אליו בגלל האיחוד של הקורסים והסגל לא ככ בא לקראתנו. היה צריך לפתור חלק מהשאלות ממבחנים ישנים מאוד וחלק מהאחרונים וגם זה לא הקיף את הכל. סהכ הוא כן היה הוגן, אבל ארוך מאוד לפתרון ולא הייתה לזה התייחסות תוך כדי המבחן/פקטור. המון ממנו מתבסס על גרפים שאתם משרטטים ועל חישובים שאפשר לטעות בהם אז צריך לשים לב ברמת הסרגל.\n\nהשורה התחתונה: החומר עצמו מעניין בחלקו, בסוף זה בעיות אופטימיזציה וקצת תורת המשחקים ובעיות התאמה. מקווה שהקורס יתייצב ויעבור יותר חלק בהמשך כי אצלנו הוא היה צולע.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: אישית, העדפתי ללמוד דרך הסיכומים שיש וממש אפשר להבין הכל דרכם. שמרית בחרה הסמסטר לא להעלות הקלטות לא מהסמסטר ולא מסמסטרים קודמים, אבל נראלי שהיא פיספסה שמה שטוב באקדמיה זה שניתן ללמוד בדרך האישית שהכי נוחה ויעילה לכל אחד, ואני לא בן אדם שיכול ללכת להרצאה ולהישאר מרוכז ובאמת להבין.\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: אין על יוני!! יכול להיות שהוא טיפה מהיר אבל אם לא מבינים משהו ניתן לשאול והוא יענה בכל שמחה (ואם לא אז הוא בטח יעזור בשעת הקבלה).\n\nשעורי הבית: הגשות בשותפים, לפעצים צריכים טיפה יותר זמן אבל בסה\"כ הם מהווים רק 10% מהציון (ז\"א 1% לכל תרגיל בית)\n\nהמבחן: מפתיע טיפה שמועד ב הגיע פחות או יותר ברמה של המועד א! (למעט שאלת כתיבת בעית תכנות:( ) . בבדיקה לא מתייחסים לטעות נגררת כטעות נגררת, ואפילו ההערות שקיבלתי לא היו מוצדקות (בעיניי). כמו למשל לרשום את הרעיון שיש לי ואז שורה מתחת להגדיר משתנים (או לבצע חישובים) ולרשום לי הערה של: \"לא הבנתי בשביל מה זה\" כאילו מה נסגר אני ליטרלי שורה למעלה הסברתי!!\n\nהשורה התחתונה: לדעתי הנהלה לא נכונה של הקורס (שחבל!!), המרצה לא משתפת פעולה בכלל ורוב הפעמים שפנינו לה בכל מני נושאים חשובים היא לרוב סירבה! ולא מסיבות מוצדקות. לא צריך להיות כזה קשוח ו\"סגור\".\nניתן למצוא לא מעט מקורות מידע לחומר באינטרנט, אך עדיף לא לפספס את התרגולים של יוני! אם לא מבינים משהו אז ללכת לשעות הקבלה. תמיד בקבצי הרצאות ותרגולים לנסות לפתור את השאלה לפני שבאמת מסתכלים על הפתרון (ממש עוזר). להיעזר גם בדרייב יש שם חומר, יש את הספר שממש תואם את קבצי ההרצאות.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שימרית\nחוות דעת - הרצאות: משעממות מאוד, לא מתחשבת בבקשות פשוטות כמו להעלות קובץ הרצאה למודל כמו מרצים אחרים (למה? במקום שנתרכז בשיעור אז נתרכז בלהעתיק?)\n\nשם המתרגל/ת: יונתן/חאיסה\nחוות דעת - תרגולים: אחלה מתרגלים, עונים על הכל בפשטות\n\nשעורי הבית: מטלה כל שבוע.\nלא מסובכים, בסוף הכל אותו דבר\nהמבחן: המועד היה קשה יותר ממועדים קודמים ובערך רמה אחת מעל, אולי כדי להוריד ממוצע\n\nהשורה התחתונה: קורס עם חומר מעניין ומרצה לא\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "חוות דעת - הרצאות: לא הלכתי, יש רשימות בדרייב וספר הקורס\n\nחוות דעת - תרגולים: לא הלכתי\n\nשעורי הבית: אפשר ללמוד מהם ומהספר\n\nהמבחן: ארוך אבל טכני\n\nהשורה התחתונה: מרגיש כמו מבוא לתעו\"נ 2 .\nלא באמת קורס שלומדים משהו.. אבל 4 נקז משום מה אז תשקיעו\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: מרצה טובה אבל בלי יחסי אנוש ולא באה לקראת הסטודנטים בכלל, למרות שהסמסטר שחררה הקלטות אבל אולי כי סמסטר מלחמה\n\nשם המתרגל/ת: חאסה ויוני\nחוות דעת - תרגולים: מקריאים מהמצגת תרגול, חבל שלא משחררים פשוט את המצגת עם הפתרונות ומתעקשים שנגיע כי גם אין הקלטות\n\nשעורי הבית: ארוכים.. לא קשים אבל מייגעים\n\nהמבחן: מועד א היה ממש ארוך הסמסטר ולא היה אפשר לסיים בזמן, אפשר לראות זאת בהיסטוגרמה הנמוכה ביחס לשנה שעברה. מבחן הזוי מהבחינה שיש בו שאלה שצריך לסרטט גרף כמו בחטיבת ביינים(כן כן עם סרגל) וצריך להריץ פתרונות ארוכים מאוד שבפועל זה אותו רעיון שחוזר על עצמו (להריץ אלגוריתם ידנית)\n\nהשורה התחתונה: חצי קורס ראשון חופרים על טבלת סימפלקס שמשעממת אפילו את המתרגלים. חצי שני שלו הוא מבוא להרבה נושאים אך מה שנשמע בהרצאה כמו תאוריה נחמדה נהיה מאוד סיזיפי בש.ב ושוב פשוט צריך לכבות את הראש וללכת כמו איך ששמרית לימדה...\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שמרית\nחוות דעת - הרצאות: שמרית מרצה די טובה בסך הכל אבל מאד נוקשה ולא גמישה (לא הסכימה לשחרר לנו הקלטות) - כאלו רבאק אנחנו לא ילדים בני 3 שצריך להכריח אותנו ללמוד בזמן הסמסטר\n\nשם המתרגל/ת: חאיסה ויוני\nחוות דעת - תרגולים: חאיסה לא מאד מקצועית, מנסה להסביר אבל מתבלבלת לא מעט ולא מעבירה את האינטואיציה בצורה ברורה. יוני יותר טוב בעיניי וגם רואים שיש לו יותר ניסיון.\n\nשעורי הבית: ארוכים ויש גליון כל שבוע אבל בזוגות וכן מאד משפר בחומר ובהבנה וגם בחלקים הטכניים של הקורס.\n\nהמבחן: המבחן היה פשוט גרוע, אכזבה מהקורס. גרוע בהיבט שהוא בעיקר בדק שאנחנו יכולים להפוך מטריצה בלי להתבלבל או להריץ כמה פעמים את האלגוריתם ההונגרי בלי להתבלבל במספרים ולהריץ טבלאות סימפלקס. מי שטעה בקטנה במספרים איבד המון נקודות כי כל המשך השאלה נדפקה לו, אפשר להבין את החומר פיקס ועדיין לקבל 70. חבל שהמבחן לא בחן באמת על ההבנה של החומר ולא הייתה שאלת תורת המשחקים.\nממוצע הזוי (62 סופי כולל מגן) ובלי פקטור...\n\nהשורה התחתונה: יש חלקים שהקורס מרתק ויש חלקים טכניים שהוא מאד משעמם, יש לו פוטניצאל להיות אחד המעניינים אבל בינתיים לא ממומש\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שימ-רית במלעיל\nחוות דעת - הרצאות: במילה אחת: משעמם, בשתי מילים? משעמם מאוד\n\nשם המתרגל/ת: יוני וחאיסה, היו בסדר סהכ התרגולים כשלעצמם היו מאוד חזרתיים וטכניים בלי עומק מיוחד\n\nשעורי הבית: שבועיים, לא קשים בכלל אבל לפעמים מייגעים(לעשות טכלאות בפעם המליון)\n\nהמבחן: פח.אשפה. לא בדק ידע בכלל, הבדיקה הייתה אובר-קפדנית וממוצע 62 מזעזע. הייתי מעל הממוצע ועדיין זה מבאס לקבל ציון כזה אחרי השקעה (אני הייתי על הקורס כל הסמסטר בלי לחפף) אז קחו בחשבון שלא שווה להשקיע הרבה רק תעשו ש.ב ואתם בסדר.\n\nהשורה התחתונה: שמרית לא צריכה להעביר את הקורס הזה לדעתי, גם בסמסטר שהתחיל על רקע מלחמה היא התנהגה כמו פאקינג ילדה בת 4 ולא שיתפה הרצאות כתובות (למה??).\nעשו טובה לעצמכם ותלמדו מסיכומים, גם ככה הם מוסברים טוב יותר\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שימרית\nחוות דעת - הרצאות:\nהאמת לא היה לי כוח להילחם באנשים בכניסה לתפוס מקום אז לא הלכתי. קראתי סיכומים משנים קודמות מספיק לעבור עם זה. היא נראית נחמדה לא יודע\n\nשם המתרגל/ת: חאיסה ויוני\nחוות דעת - תרגולים:\nכפרה עליהם אין לי מה להגיד, עזרו כמה שיכלו גם בשעות קבלה אני לא הכי הלכתי אבל השותפה שלי הלכה ואמרה שממש עזרו לה להבין ולפני המבחן כשהלכתי עזרו לי לסדר את המוח\nשעורי הבית:\nבכנות השותפה שלי עשתה הכל כי היא התעקשה לעשות ולי היה מילואים חלק מהזמן או שבאמת לא היה לי כוח\nהמבחן:\nקשה, מאוד טכני כמו שבטח אמרו ועוד יגידו אבל אפשר לעבור למרות שהממוצע היה ממש ממש נמוך יחסית\nהשורה התחתונה:\nקורס חובה מה עוד אפשר להגיד.\nאבל מה שכן רואים שלמתרגלים אכפת בין אם זה חאיסה שעזרה לאנשים גם לא בשעות קבלה כאילו שמעתי על אנשים שהיא עזרה להם אפילו בספריה או יוני שבאמת רואים שהוא יודע מה הוא עושה ורואים שיש לו ניסיון. בקיצור אפשר לעבור למי שזה כל מה שאכפת לו\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 62  ב' 61  סופי 67  שטרן שמרית\nחורף 2023-2024  א' 70  ב' 71  סופי 74  שטרן שמרית\nסופי מועד א': 62\nסופי מועד ב': 61\nסופי: 67\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n116 79 37 68 10 100 67.495 71\nאיש סגל תפקיד\nשטרן שמרית מרצה - אחראי מקצוע\nשוט סטיינברג חאיסה מתרגל\nוולוך יהונתן מתרגל\nשיתוף היסטוגרמות"
  }
}