{
  "course_id": "094101",
  "scraped_at": "2025-12-16T13:19:18.570761",
  "information": {
    "raw_text": "00940101 - מבוא להנדסת תעשיה וניהול\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 2.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס מציג את מכלול הנושאים בהם מטפל מהנדס תעשיה וניהול תוך הדגשת הנושא של שילוב מערכות בתחומי תכון מוצרים ושירותים, תכון מערכי ייצור ושירות, תכון מערכות מידע, ניהול של שרשרות אספקה, מערכי שירות ועוד. יסקרו שיטות ומודלים בסיסיים כלים לקבלת החלטות וכלי תוכנה התומכים ביישום. לקורס יהיה פרויקט מלווה.\n\nמקצועות ללא זיכוי נוסף: 00940100\n\nמועד א': 03-02-2026\nמועד ב': 05-03-2026",
    "title": "00940101 - מבוא להנדסת תעשיה וניהול"
  },
  "feedback": {
    "summary": {
      "text": "10 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: אסף\nחוות דעת - הרצאות: כל שבוע הרצאה עם נושא חדש, מדברים על נושאים ודנים בהם, מרענן את השבוע מאלגברה ודיסקרטית. הרצאות שמדברות תכלס על התפקיד בתעשייה, אחלה לסמסטר ראשון.\n\nשם המתרגל/ת: נחמיה\nחוות דעת - תרגולים: אין על נחמיה, חבל שלא יצא לנו ללמוד איתו בלייב.\n\nשעורי הבית: כל שבוע עבודה קלילה בזוגות, בסוף הסמסטר מעבדת רובוטיקה (גם בזום).\n* את הציון של העבודות תהיו מוכנים לקבל אחרי הציון של המבחן\n\nהמבחן: הזכיר לי נשכחות של מבחנים מימי התיכון\n\nהשורה התחתונה: אחלה קורס, מעלה ממוצע לסמסטר ראשון, ומעשיר את הידע לגבי התחומים של מהנדס תעשייה בעתיד\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: אסף\nחוות דעת - הרצאות: כל שבוע מדברים על נושא אחר. ממש נהניתי בהרצאות! אחלה הפוגה משאר הקורסים היותר מתמטיים במהלך השבוע. אסף מרצה מעולה ורואים שאכפת לו מהקורס ושהוא אוהב את התחום.\n\nשם המתרגל/ת: נחמיה\nחוות דעת - תרגולים: לא הלכתי לתרגולים האמת, הספיק לי לעבור על המצגת והפתרונות בבית.\n\nשעורי הבית: גיליון להגשה כל שבוע בזוגות/יחידים. לא קשה במיוחד :)\n\nהמבחן: אני כן חושבת שהיה מבחן הוגן מבחינת רוב השאלות שנשאלו בו והם הצליחו לכסות כמעט את כל החומר הנלמד. עם זאת, היו לא מעט סעיפים טריקיים ומבלבלים ועיקר הבעיה היה הזמן. פשוט יותר מדי שאלות וסעיפים למבחן של שעתיים כך שהרבה אנשים אפילו לא הספיקו חלק מהמבחן. אפשר להביא דף נוסחאות אישי שמכינים לבד אז גם ההכנה שלו עוזרת לעבור על החומר.\n\nהשורה התחתונה: אחלה קורס לסמסטר ראשון. תעברו על המצגות לפני המבחן ועל שאלות ממבחני עבר ותוסיפו לדף נוסחאות כל דבר שנראה לכם רלוונטי ותהיו בסדר :)\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: אסף\nחוות דעת - הרצאות: נוכחות חובה\n\nשם המתרגל/ת: נחמיה\nחוות דעת - תרגולים: לא הכרחי להבנת החומר\n\nשעורי הבית: תואם לרמת המבחן\n\nהמבחן: כל החומר הנלמד בתרגולים הצליח להכנס למבחן של שעתיים אז כדאי לעקוב אחרי מה לומדים במהלך הסמסטר\n\nהשורה התחתונה: אפשרי וסביר, ניתן ללמוד גם בלי להגיע להרצאות או לתרגולים פרט לעניין הנוכחות החובה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: אסף (איירון מן) אברהמי\nחוות דעת - הרצאות: תתכוננו לזה שרוב הזמן אסף מדבר על עצמו ועל כמה הוא תותח. את החומר הוא לרוב מעביר מהמצגת. יש שאלת שבוע כל שבוע ככה שלפעמים זה כן מתפתח לשיח נחמד, תלוי כמה הוא נותן לזה מקום וזמן. הנוכחות חובה אז אין יותר מדי ברירה. לנו זה היה פתיחת שבוע חמודה ולא מעבר. תשתדלו כן להשתתף בשביל העוד כמה נקודות האלה בסוף הקורס (ושיזכור את השם שלכם), ותעשו את המצגת 5 דק' שמוסיפה נקודות חינם לציון הסופי.\n\nשם המתרגל/ת: נחמיה ירון\nחוות דעת - תרגולים: נחמיה לא באמת יודע ללמד, עד היום לא ברור לי מה ההשכלה/המקצוע שלו. כדי למלא את כל השעה שיש לו הוא פשוט פותר את השאלה מהמצגת על הלוח (מה שמופיע בשקופית הבאה אשכרה), וגם יש במודל פתרונות לתרגולים שלו כקובץ ולא רק כמצגת. התרגולים אצלנו לא היו חובה וגם הם תקעו אותם ב6 בערב אז אף אחד לא הלך. בקיצור- מיותר.\n\nשעורי הבית: כל שבוע, ממוחזרים רצח. אפשר לרפרנס אבל אפשר בכיף גם לפתור אותם לבד (או בזוגות) כדי לוודא הבנה של החומר השבוע (כאמור- כל שבוע נושא אחר לגמרי בקורס). תתכוננו נפשית לזה שהוא לא מחזיר ציונים על המטלות עד המבחן (תנסו להציק לו ולאסף על זה במהלך הסמסטר יותר).\n\nהמבחן: בעיקרון אמור להיות מבחן מתנה אם לומדים אליו באמת. לא לזלזל כי זה באסה לקבל ציון גרוע (או לא לעבור) מבחן שיכול ללכת סבבה לגמרי, לעומת השאר בסמסטר הזה. מה שכן- אצלנו הם יצאו מניאקים קצת. הם ניסו לדחוס את כל החומר של הקורס במבחן אחד ככה שכל סעיף לקח נצח ואנשים לא הספיקו לענות על כל המבחן (שעתיים). במבחני עבר זה לא היה ככה (וגם הם לא הסכימו לפרסם את המבחן של שנה שעברה והפתרון). וגם היו בעיות בניסוחים. סהכ כל הבעיות התנקזו ל5 נק פקטור שטרחו לתת, מקווה שיהיו יותר הוגנים להבא.\n\nהשורה התחתונה: החומר עצמו לא מאוד קשה, אבל כן מורכב מהרבה נושאים שכל אחד עומד בפני עצמו וכדאי לשים לב לכולם. סהכ קורס חביב, נותן סיפתח (קלוש אבל נותן) לתואר. תתעקשו על דברים שמגיע לכם לקבל ותזרמו עם ההנפצות שלהם (סיור מיותר, סדנת הדפסת תלת מימד, עבודה על התוכנה שאסף המציא וכו')\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: פרופסור אסף אברהמי\nחוות דעת - הרצאות: אסף מדבר על עצמו בקטע שכבר גורם אי נוחות\n\nשם המתרגל/ת: נחמיה ירון\nחוות דעת - תרגולים:\nחחחחח\nשעורי הבית:\nתקוע בין כל שאר המטלות האמיתיות, לא כזה קריטי להתעמק במהלך הסמסטר אפשר להעזר ברפרנסים.\nהמבחן:\nלקחת 4 ימים לפני לחרוש רק על זה ואז מוציאים ציון טוב\nהשורה התחתונה: קורס מבאס אין מה לעשות. הנושאים עצמם סופר מענינים ובהתחלה של כל נושא יש פוטנציאל שבאמת יהיה מעניין, אבל ... אסף ונחמיה... זה לא קורס אמיתי ותנסו להתכונן נפשית לכל הדברים שהם תוקעים במהלך הסמטסר(חשבשבת, סדנה,פרויקטון)\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: פרופ' מנכ\"ל קצין בדימוס וגיבור המולדת אסף אברהמי\nחוות דעת - הרצאות: תכלס, חוץ מזה שהוא מתנשא, זה דיי אחלה, צריך להקשיב כי יש שאלה על מה שהוא מדבר במבחן. לפעמים יש הרצאות אורח שיכולות להיות אחלה, הדברים באמצע (תכ\"ן וחשבשבת) חרטא לגמרי. בסוף חמוד, אמור להעלות ציון בסמסטר א'\n\nשם המתרגל/ת: נחמיה \"זה אינטואיטיבי\" ירון\nחוות דעת - תרגולים: חמוד, בסוף זה החלק האמיתי של הציון, מומלץ לראות את המצגות ואם לא הבנתם לבוא.\n\nשעורי הבית: חרטא, פעם בשבוע שעה גג בזוגות\n\nהמבחן: הוגן, כאילו החומר לפעמים ממש לא מרגיש חשוב אבל צריך להבין את מה שרוצים ממך.\n\nהשורה התחתונה: אין בחירה אז בואו, בראשון זו אחלה דרך לפתוח שבוע בכיף\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: אסף אברהמי\nחוות דעת - הרצאות: נוכחות חובה. בגדול נחמד לפתוח ככה את יום ראשון ולא בקורסים של מתמטיקה. אסף מת על עצמו ובעיקר מדבר עליו ועל החברה שלו בהרצאות.\n\nשם המתרגל/ת: נחמיה ירון\nחוות דעת - תרגולים: מפסיקים ללכת אחרי התרגולים הראשונים, לא חובה\n\nשעורי הבית: העתק הדבק מהמצגת של התרגול, אבל מעיק שיש שיעורי בית בזה פעם בשבוע כי לפעמים זה גוזל זמן.\n\nהמבחן: המבחן השנה היה ארוך וקשה מאוד ביחס לשנים קודמות. לא היה הוגן.\n\nהשורה התחתונה: קורס חמוד, לא צריך להשקיע יותר מידי חוץ מהשיעורי בית כל שבוע.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: אסף\nחוות דעת - הרצאות:\nמלא פוטנציאל להיות מעניין וכייפי אבל אסף כלכך אוהב את התחת של עצמו שזה די הורס את השיעור. היה יכול להיות אחלה הזדמנות לפתח שיחה מעניינת בכל מני נושאים (כל שבוע יש שאלת שבוע ופותחים עליה דיון) אבל מרגיש שאין מקום אמיתי לשתף בכלום. הנוכחות היא חובה אבל זה חרטא זה רק כי בסוף הסמסטר אסף מביא ציון על ההשתתפות בכיתה. הייתי ממליצה פשוט לדבר מספיק כדי שיזכור את השם שלכם ואז מקבלים מאה\nבנוסף יש מצגת שלא חייבים לעשות אבל מעלה את הציון הסופי אז למה לא\n\nשם המתרגל/ת: נחמיה\nחוות דעת - תרגולים:\nלא הלכתי היה מיותר\n\nשעורי הבית:\nיש כל שבוע, ובסוף זה 15% מהציון. ממחוזרים לגמרי, אפשר לעשות 99 אחוז עם רפרנסים אבל גם ממש קל לעשות לבד. הם תכלס להגשה בזוגות אבל לא חובה. לנו הסמסטר הייתה בודקת (לא נחמיה) אז דווקא החזירו ציונים די מהר.\nהשיעורי בית המעצבים באמת זה העבודה על החשבשבת והפרוייקטון. הייתי ממליצה להתחיל את הפרוייקטון כמה שיותר מוקדם (אפילו שבוע 3-4) ולא להשאיר את זה לסוף הסמסטר כשכבר יש עומס ומבחנים על הראש\n\nהמבחן:\nהיה עמוס ממש ולא אפשרי לסיים בשעתיים, נתנו פקטור של 4 נקודות שבאמת היה בדיחה יחסית לממוצע. בתכלס החומר לא מסובך (חוץ מהשבוע של הסתברות שהוא חרא ותמיד מופיע במבחן) אבל פשוט יש מלא חומר, ומותר רק דף נוסחאות אחד אז צריך לכתוב ממש קטן כי באמת יש מלא מידע שצריך למבחן.\n\nהשורה התחתונה: קורס חובה חמוד, ואחלה הזדמנות להכיר את האנשים שאיתכם בתואר. המבחן קצת מבאס\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: אסף אברהמי\nחוות דעת - הרצאות: נוכחות חובה אבל נחמד לפתוח את השבוע במשהו שהוא לא מתמטיקה. אסף בעיקר אוהב לדבר על עצמו ועל החברה שלו ומכניס את זה לדיון בכל הזדמנות. מעבר לזה ההרצאות נחמדות, לא מעבר. הרצאות האורח של נועם היו אחלה לגמרי.\n\nשם המתרגל/ת: נחמיה ירון\nחוות דעת - תרגולים: אחרי שני תרגולים הבנו שהם מיותרים והפסקנו ללכת.\n\nשעורי הבית: הרוב זה העתק הדבק מהמצגת של התרגול רק שמשנים נתונים. אבל שזה לא כמו במצגת זה שבירת ראש. יש גיליון כל שבוע שזה מעיק כי לפעמים יוצא שמקדישים הרבה זמן לקורס יחסית קטן יותר ביחס לשאר.\n\nהמבחן: המבחן הפעם היה ארוך ממש ביחס לשנים קודמות ולדעתי גם קשה הרבה יותר. מבאס כי הקורס אמור להעלות את הממוצע אבל בגדול אין מה לדאוג מלעבור את המבחן.\n\nהשורה התחתונה: קורס חמוד לסמסטר ראשון בתעשייה וניהול\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 77  ב' 75  סופי 77  אברהמי אסף\nחורף 2023-2024  א' 79  סופי 80  אברהמי אסף\nחורף 2022-2023  א' 74  ב' 71  סופי 78  אברהמי אסף\nחורף 2021-2022  א' 75  סופי 76\nחורף 2020-2021  א' 74  ב' 74  סופי 75  אברהמי אסף\nחורף 2019-2020  א' 78  סופי 77  אברהמי אסף\nאביב 2019       א' 79  סופי 79  אברהמי אסף\nחורף 2018-2019  א' 78  ב' 68  סופי 77  אברהמי אסף\nאביב 2018       א' 78  סופי 77  אברהמי אסף\nחורף 2017-2018  א' 80  ב' 77  סופי 81  אברהמי אסף\nאביב 2017       א' 80  סופי 80  אברהמי אסף\nחורף 2016-2017  א' 83  ב' 85  סופי 86  אברהמי אסף\nאביב 2016       א' 81  סופי 82  אברהמי אסף\nמבחן מועד א': 67\nסופי מועד א': 77\nמבחן מועד ב': 65\nסופי מועד ב': 75\nסופי: 77\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n53 49 4 92 52 96 77.98 79.5\nאיש סגל תפקיד\nאברהמי אסף מרצה - אחראי מקצוע\nירון נחמיה מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}