{
  "course_id": "094564",
  "scraped_at": "2025-12-16T13:11:43.567193",
  "information": {
    "raw_text": "00940564 - מבוא לניהול פיננסי\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 2.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nחישובים פיננסיים, שימושים פשוטים בהערכת מניות ואג\"ח, חישובי הלוואות והצמדה, קריטריונים להערכת השקעות, כדאיות פרויקטים בתנאי וודאות,מבוא למודל MPAC, קביעת מחיר ההון של הפירמה, מבוא לניתוח השקעות בתנאי אי-וודאות. ארביטרז'.\n\nמקצועות ללא זיכוי נוסף (מוכלים): 00940593\n\nמקצועות ללא זיכוי נוסף (מכילים): 00940565\n\nמקצועות ללא זיכוי נוסף: 00140603 00980565\n\nמועד א': 27-02-2026\nמועד ב': 22-03-2026",
    "title": "00940564 - מבוא לניהול פיננסי"
  },
  "feedback": {
    "summary": {
      "text": "29 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 1.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2019-2020",
        "content": "שם המרצה: רון\n\nחוות דעת - תרגולים: חשובים ופרקטים\n\nהמבחן: מאוד קשה\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רון\nחוות דעת - הרצאות: היו בזום, מסביר בסך הכל בסדר, קצת משעמם, לראות רק מוקלט אין טעם לבוא לייב\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: ברמה הרבה יותר נמוכה מהמבחן\n\nשעורי הבית: 4 גליונות לא קשים במיוחד, בלי ציון רק הגשה\n\nהמבחן: סביר. חוזר על עצמו בסופו של דבר אחרי הרבה מבחנים אותם רעיונות.\n\nהשורה התחתונה: קורס נחמד, נותן ידע פיננסי כללי שכל אחד צריך להכיר\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רון לביא\nמרצה הכי אבל הכי גרוע שתיתקלו בתואר לא יודע ללמד המצגות לא מספיק מלאות בידע וברמה בשביל להכין אותך למבחן,בעבר המומצע בקורס היה ממש גבוה עד שיום אחד הדיקן/מיכל פן הגועלית,ביקשו ממנו להוריד את הממוצע והשפוט הפחדן הסכים להוריד ל70,כשיש לו חופש אקדמי להחליט מה שבא לו (הוא סיפר לנו את זה) .\n\nשם המתרגל/ת:\nיונתן מתרגל מעולה מאוד עוזר ומשקיע !\nהמבחן:קשה פצצות\nהשורה התחתונה: אמן שיחליפו אותו ותלמדו חזק במהלך הסמסטר !!\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מרצה בצורה ממש מעניינת קורס מאוד משעמם\n\nשם המתרגל/ת: יונתן וגנר\nחוות דעת - תרגולים: בקיא בחומר אך מתרגל בצורה ממש משעממת\n\nשעורי הבית: חובב מפרסם דפי תרגילים ופותר אותם בשעת הקבלה, לא נכנס לציון.\n\nהמבחן: הוגן וברמה שנלמדה, תבניתי כמו שחובב אוהב.\n\nהשורה התחתונה: אם חובב מעביר שוב חובה לקחת את הקורס!! הפך קורס סיוט לקורס מעולה עם ממוצע גבוה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מרצה מצויין.\nמעביר הכל בצורה מאוד מסודרת, לפני כל הרצאה מעלה דפי ״שלד״ עם עיקרי הדברים של ההרצאה ככה שאפשר לרשום עליהם או לחכות לסוף ההרצאה והוא מעלה את הדפים עם ההערות שהוא כתב במהלך השיעור.\n\n\nשם המתרגל/ת: יונתן\nחוות דעת - תרגולים: עוזרים להבנה של החומר, השאלות בנויות שונה מהשאלות שחובב מנסח.\n\nשעורי הבית:\nלא כל שבוע, ולא להגשה.\nחובב מעלה תרגילים ואחר כך פותר אותם בשעות הקבלה שלו, ומקליט את שעות הקבלה.\nמומלץ לראות את שעות הקבלה, חובב נותן דגשים חשובים לפתרון התרגילים.\n\nהמבחן:\nהוגן מאוד ולא קשה.\nסוג השאלות והמבנה ידועים מראש.\nהמבחן עם חומר פתוח.\n\nהשורה התחתונה:\nקורס לא עמוס ואפשר בקלות להצליח ולקבל ציון גבוה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: ההרצאות היו נחמדות ומלמדות. חובב לימד את החומר בצורה ברורה.\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: התרגולים היו טובים אבל אני חושב שהיה אפשר טיפה להאריך אותם (בפועל תמיד היה מעט מדי תרגילים והיינו מסיימים הכל בחצי שעה).\n\nשעורי הבית: לא היה\n\nהמבחן: סביר +\n\nהשורה התחתונה: קורס מעניין ונחמד\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מעניינות, מלמדות ומעשירות את הידע. חשוב להשתתף די להגיע מוכנים למבחן\n\nשעורי הבית: אין שיעורי בית להגשה, אבל חובב נותן תרגילים לתרגול ופותר אותם בשעת הקבלה השבועית שלו. ממש מומלץ לפתור ולעלות לשעות הקבלה\n\nהמבחן: הוגן ויחסית קליל למי שלמד לאורך הסמסטר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: לצערי בניגוד לחוות הדעת הקודמות התאכזבתי מהקורס. חובב כן מרצה מאוד מסודר ומעלה מראש שלד להרצאה כך שמאוד נוח לעקוב אחרי מה שהוא אומר, אבל בעייני הוא היה מאוד מונוטוני ובשלב כלשהו הפסקתי להגיע פרונטלית וצפיתי בהקלטות.\n\nשעורי הבית: אין\n\nהמבחן: סביר\n\nהשורה התחתונה: ציפיתי לקורס מעניין יותר והתאכזבתי... חומר משעמם ולא פשוט בכלל להבנה, במיוחד בסוף.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב קלאסי. מעלה מראש שלד הרצאה למודל ואחרי ההרצאה מעלה את כל מה שהוא כתב ומפרסם גם הקלטה של השיעור\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: תרגולים טובים, יודע טוב את החומר ומסביר מעולה\n\nשעורי הבית: אין, הוא מפרסם תרגילים שכדאי לפתור לקראת המבחן והוא פותר אותם בשעות קבלה (וגם שם מקליט ומעלה למודל)\n\nהמבחן: תבנית שמאוד דומה למבחני עבר בקורס - שאלות מאוד דומות למעט שינוי מספרים ואולי קצת שינוי נוסח. מספיק לתרגל 3-4 מבחנים ואפשר להוציא ציון מעולה במבחן\n\nהשורה התחתונה: קורס לא קשה ולא מעמיס, ואפילו מעניין אם הנושאים מדברים אליכם. נק\"ז קל עם ציון גבוה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מלך מה שיש בהרצאות ובשעות קבלה שלו זה המבחן\n\nשם המתרגל/ת: גוני\nחוות דעת - תרגולים: לא צריך ללכת ביזבוז של זמן המבחן לא בתבנית הזאת\n\nשעורי הבית: אין\n\nהמבחן: תבניתי ולא קשה בכלל\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nחובב מקליט ו מעלה כל ההרצאות ו שעות הקבלה אז אין על זה אבל לדתי ההרצאות מעניינות אז נוכחתי\nשם המתרגל/ת: אין צורך\nחוות דעת - תרגולים: אבל ברומן אמליץ לכם לצפות בשעת הקבלה קצרות ו מאוד עוזרות\n\nשעורי הבית: אין יש משימות אני ממליצה לעשות אותם אז לא תהיו לחוצים בזמן המבחן\n\nהמבחן:90+ מאוד אפשרי\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: חובב משדר בזום וגם מעלה הקלטות שזה אחלה, אבל זה בא על חשבון הסטודנטים שכן רוצים להגיד פרונטלית. לפחות חצי מהשיעורים במהלך הסמסטר הועברו רק בזום וסטודנטים שלא היו בבית היו צריכים להסתדר בדקה 90. סה\"כ, הקורס הועבר בעצלנות.\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: לא רלוונטים כי הם לא תואמים להרצאות. יותר חשוב ללכת לשעות הקבלה של חובב, שם הוא פותר תרגילים בסגנון של המבחן.\n\nשעורי הבית: לא להגשה. יש רק את התרגילים שחובב מעלה פעם בשבועיים וכדאי לנסות אותם לבד לפני שמגיעים לשעת הקבלה.\n\nהמבחן: תבניתי מאוד. אין סיבה ללמוד ממבחנים שהם לא של חובב. חבל שהמבחן בנוי ככה כי זה יוצר מצב שלא לומדים באמת ניהול פיננסי. מספיק 3-4 ימים ללמוד.\n\nהשורה התחתונה: נורא התייאשתי מהקורס.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: הוא מקליט שזה נחמד\n\nשם המתרגל/ת: ג'וני\nחוות דעת - תרגולים: לא הלכתי ופתרתי בעצמי את התרגילים. בדיעבד גם לפתור את התרגילים לא היה צריך\n\nשעורי הבית: אין (חובב מרפסם 5 תרגילים שהם לא להגשה שזה סתם שאלות ממבחנים שהוא פותר בשעת קבלה מיוחדת לזה)\n\nהמבחן: חומר פתוח, תמיד אותם שאלות שבו הוא משנה את המספרים. הדרך המנצח ללמוד זה פשוט לפתור את המבחנים של חובב רק, להבין טוב את הפתרונות, ולהביא אותם למבחן. זהו\n\nהשורה התחתונה: קורס סביר ולא מרגש לטוב ולרע. ממליץ למי שלא חייב לקחת אם החומר מעניין אותך או יש צורך בו כקדם לשוק ההון\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מאמין בהוראה היברדית ומנגיש את כל החומרים, כדאי לראות את ההרצאות ושעות הקבלה ולא רק לקרוא את החומר\n\nשם המתרגל/ת: יוני מוקלט\nחוות דעת - תרגולים: למרות הדעה הרווחת לדעתי התרגולים תורמים להבנת החומר ועושים סדר בנוסחאות הרלוונטיות\n\nשעורי הבית: אין\n\nהמבחן: מבנה של מבחני עבר עם חומר פתוח\n\nהשורה התחתונה: אחלה קורס\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: גם כאן, כמו בעקרונות הכלכלה, ההרצאות נמרחות בטירוף. מוקלט על 1.75 לגמרי עושה את העבודה.\n\nחוות דעת - תרגולים: לא רלוונטי בשום צורה ולפעמים סתם מבלבל\n\nשעורי הבית: אין שיעורי בית להגשה אלא שאלות לפתור לשעת קבלה של חובב. מאוד מאוד חשוב להבנת החומר כי השאלות באמת ברמת מבחן.\n\nהמבחן: טכני וחזרתי אבל כמובן, גם כאן תמיד יהיה טריק חדש שחובב המציא שיכול להפיל שאלה שלמה.\n\nהשורה התחתונה: יכל להיות קורס טכני ופשוט. הטריקים של חובב כל מבחן מחדש הופכים אותו לבלתי נסבל.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה:חובב\nחוות דעת - הרצאות:\nכמו כל הקורסים של חובב, הכל מוקלט ואין שיעורי בית\nלראות את כל השעות קבלה וההרצאות הן בעיקר לחבר את כל המושגים\n\nהמבחן:\nאפשר לסיים את המבחן שעה לפני הזמן ולהוציא ציון טוב רק להזהר לא ליפול בהפתעות של חובב.\nהשורה התחתונה:\nקורס קליל עם ממוצע גבוהה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מעביר הכל גם בזום ומקליט כל הרצאה, שזה טוב תמיד. אני מצאתי את החומר די מעניין (מניות, השקעות וכו') והוא לא מורכב מדי להבנה.\n\nשם המתרגל/ת: יונתן וגנר במוקלט\nחוות דעת - תרגולים: עוזר להבין את החומר טוב אך בסופו של דבר את המבחן צריך לפתור לפי הדרך של חובב, לכן יכול לבלבל. אפשר לוותר.\n\nשעורי הבית: אין. יש אחרי כל שיעור דף משימות רשות- שאלות ממבחני עבר שהוא מציין איזה בדיוק לפתור ואז עושה על זה שעת קבלה בזום ופותר אותן.\n\nהמבחן: בניגוד לקורס אחר של חובב, המבחן הזה הרבה יותר טכני ורובו תקתוקים במחשבון. הרגיש לי שאין הרבה קשר בין החומר בהרצאה, שחלקו כן היה פרקטי ולא רק תיאורטי, למבחן עצמו. צריך לפתור בדיוק בדרך שחובב פותר כל שאלה ואתם מסודרים. מומלץ לראות את השעות קבלה לפני המבחן או תוך כדי הסמסטר כדי להבין את השיטה. חשוב לציין שכל סמסטר הוא מוצא דרך להקשות פה ושם או טריקים נוספים אז כן כדאי להגיע עם הבנה של החומר ולתרגל מבחני עבר. אמריקאי עם מסיח מכשיל של \"יותר מתשובה אחת נכונה/אף תשובה\".\n\nהשורה התחתונה: אחלה קורס, מעט מאוד השקעה במהלכו וציון גבוה. לא כדאי לזלזל בו כי אפשר ליפול בקלות.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: נחמד במהלך הסמסטר\n\nשם המתרגל/ת: שעות קבלה של חובב\nחוות דעת - תרגולים: אחלה\n\nשעורי הבית: אין\n\nהמבחן: הגעתי כשאני אחרי שבועיים של למידה למבחן, למה? כי זה אני אני לומד תמיד הרבה למבחן גם כשהוא קליל.\nכשהגעתי למבחן, נתקלתי בסוג בעיות שמעולם לא ראינו בשיעורים, או במבחני עבר, כי ככה זה חובב, הקורס היה ברמת לגו בשנים הראשונות, ואז הוא מתחיל להכנס בסטודנטים.\nזה בכלל קורס בחירה שלי, וואלה כלכלה זה מעניין\nאלא אם כן אתם רוצים טריקים אחרי טריקים אחרי טריקים בגרון שלכם\nכי זה חובב, אין בו מעבר, הוא ימצא איפה להוציא לכם ניקוד.\n\nהשורה התחתונה: חרא של קורס, איבד כיון לפני שנה כבר במבחנים שהוא עושה, לא ברור איך הוא פותר תרגילים מ2019-2020 בשעות הקבלה ובהרצאות ואז במבחנים יש לכם שאלות שאין לכם מושג איך לגשת אליהם, גם אנשים שהם עם תואר בכלכלה לא יודעים איך לפתור את השאלות האלו, להתרחק כמו מאש. קורס מזעזע והוריד לי את הממוצע\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חבל שלא המשיך להקליט מהבית היה מעולה בהתחלה\n\nשם המתרגל/ת: לא הלכתי\nשעורי הבית: אין\n\nהמבחן: וואלה אני לא מבין איך לא עצרו את הטירוף שקורה בקורס הזה\nלפני שנתייים היית בא ביום של הבחינה עם דף נוסחאות מקבל 100\nהיום גם אחרי למידה של סמסטר שלם - עברתי בקושי את הקורס.\nשאלה עמוסה בנתונים, בלי קשר למה שלמדנו בקורס\nהיו שאלות סבירות, אבל נמאס שבעבור טעות נגררת אתה מעיף לעצמך את הציון למטה, ובטח שיש 13 אלף חישובים לכל שאלה שם.\nנמאס נמאס נמאס\n\nהשורה התחתונה: לא לקחת אם זה לא קורס חובה שלכם, חובב בנאדם מקסים, אבל במבחנים הוא רק מחפש להוריד ממוצע שלא יגידו שזה קורס קל בטעות, אבל לעשות הוגן? מה עם לעשות הוגן?!\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nוואלה הרצאות מעולות, פותר מבחנים, למדתי משהו\n\n\nשם המתרגל/ת: לא ראיתי\nשעורי הבית: אין\n\nהמבחן:\nברוכים הבאים לשעשועון של חובב\nלמדתם? אתם יודעים את החומר? מבינים לעומק מה שעשיתם במהלך סמסטר שלם?\nזה לא יעזור לכם פה, המבחן של חובב באופן קבוע בשנים האחרונות - לא הוגן.\nלמה? כי בפועל אתה מגיע למבחן, רואה משהו שלא ראית מעולם, מבחן אמריקאי כנראה כי חובב אוהב את זה שיש לכם טעויות חישוב, אז מה אם היה צריך 24 חישובים של שברים ומכפלות להגיע לתשובה.\nכנראה שאם לא ניחשתם נכון - אתם לא יודעים\nהיה משהו לא ברור אצלי באחת השאלות שהוא ניסח במניות בבחינה, הוא נתן נתונים על 2 חברות שונות - ובפועל שאל שאלה על חברה כלשהי מבלי לציין מה קורה, אני נאבדתי שם.\nמלבד זה, הוא מתגאה שאין פקטורים, לא משנה שאף אחד לא הצליח שאלה.\nאני מתחרט על זה שבחרתי בקורס הזה, בזבוז זמן, ו65 לא ציון שאני גאה בו, אבל אני יותר מתבייש שזה הרמה של הלימודים של הפקולטה הזו בטכניון, זה לא תעשייה וניהול זה פקולטה להסתברות, מה ההסתברות שתדע את השאלה במבחן, מה ההסתברות שלא תטעה ב24 חישובים שונים במחשבון, ההסתברות שתנחש נכון.\n\nמזעזע, תיקחו גנטיקה או משהו, עדיף.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה:חובב\nחוות דעת - הרצאות: חובב מקסים, מחשבון מהלך. מעביר את החומר בצורה ברורה ומנסה לתת ערך מוסף ככה שחצי מההרצאה היא בכלל לא על החומר אלא על מה קורה בשווקים.\n\nשם המתרגל/ת: יונתן / ג׳וני\nחוות דעת - תרגולים: קצת מיותרים, אבל הדף הראשון בכל תרגול זה אחלה חומר פתוח.\n\nשעורי הבית: היו 5 דפי תרגול שהוא פתר בשעת קבלה לאחר מכן. לא עשיתי אותם במהלך הסמסטר אלא כהכנה למבחן לפני שהתחלתי לפתור מבחנים (וזה מה שעשיתי גם עם השאלות מהתרגולים, ממליץ מאוד על הגישה הזו).\n\nהמבחן: אני חושב שהסטודנטים שכתבו פה לפני הפריזו לחלוטין. מ2022 יש בכל מבחן שאלה שבה חובה העלה את רמת המורכבות (משקיע שמשקיע במט״ח בשווקים שונים אחוזים לא שווים מסרום ההשקעה, הלוואה עם תזרים מורכב יותר וכו). במבחן הזה כן הורגש שהוא מכניס את הטוויסט בכל שאלה במקום בשאלה נבחרת מתוך המבחן, אבל להגיד דברים כמו ״לא ראינו דברים כאלה״ זה סתם מפחיד ולא מידתי. המבחן היה יותר ארוך מהמבחנים שתרגלתי ובאמת נדרשו שם הרבה חישובים, אבל לא משהו שלא נראה כמותו במבחנים הקודמים. אני חושב שהיה פה ניסיון הוגן לתת מבחן מאתגר יותר שמתכתב לגמרי עם מבחני העבר, ולא איזה ניסיון נבזי להוריד את הממוצע. השאלות דרשו בדיוק את אותה רמת הבנה ואת אותם הטריקים, פשוט שאלות יותר מורכבות מבחינת נתונים ולכן נדרשת זהירות בפתרון.\n\nהשורה התחתונה: קורס חמוד, לקחתי אותו כרשימה ב. לגמרי אפשר לשכוח ממנו כל הסמסטר ובשבוע וחצי להשלים אותו בתקופת מבחנים - אני ממליץ לעבור על ההרצאות המוקלטות זריז, לפתור את דפי התרגילים ולוודא הבנה מול ההקלטה, לפתור את השאלות מהתרגולים, לעשות את המבחן לדוגמה המוקלט ולהבין את הטריקים שחובב מפרט בהקלטה, לפתור 4 מבחני עבר ביום (אפשרי לגמרי), לבוא עם חומר פתוח מינימלי (באתי עם ה9 דפים מהתרגולים ושבלונות לטבלאות, תזרימים וכו).\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: ההרצאות ומעניינות ושם באמת לומדים, חובב מרצה טוב וברור ושיטת הלימוד ההיברידית שלו מצוינת. הלמידה למבחן לא קשורה להרצאות אלא רק לשעת הקבלה\n\nשם המתרגל/ת: לא יודע\nחוות דעת - תרגולים: לא הלכתי\n\nשעורי הבית: לא עשיתי, ראיתי רק את השעות קבלה\n\nהמבחן: לא קשה בכלל, המבחנים של חובב מאד תבניתיים ולא קשה כל כך להוציא 100\n\nהשורה התחתונה: קורס חמוד סה\"כ\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: ההרצאות המונוטוניות והרגילות, באמת מבינים הכל ומוסבר טוב\n\nשם המתרגל/ת: לא הלכתי (תיכף תדעו למה)\n\nשעורי הבית: אין, יש מידי פעם שאלות ממבחני עבר שאני עושה ישר אחרי השיעור\n\nהמבחן: פה הטוויסט, התרגול לא קשור בכלל למבחן אז זה בזבוז זמן אחד גדול. בנוסף, השאלות שהוא הציג השנה לא באותו סגנון ולא באותה צורה שהוא מלמד. לא ברור על מה הוא מנסה לבחון, למי יש תוספת זמן ולמי לא? אי אפשר לסיים את המבחן מרוב חישובים ככה שבסוף אחרי שאתה מבזבז זמן על שאלות שבהבנה הן לא קשות מידי אבל לוקחות מלא זמן בסוף זה ניחוש. זה סתם כדי להוריד ממוצע. לדעתי מי שקיבל פה ציון סביר אלה אנשים עם תוספת זמן או כאלה שהצליחו לנחש פה ושם מאמין שכדאי לבדוק את זה. בקיצור חרא של דבר וחבל שזה קורס חובה כי זה (וכלכלה גם שלו) הורידו לי מלא את הממוצע ואני ממש לא חוזר עליהם.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: ראיתי רק את המוקלטות. הרצאות בסדר, קצת יותר מדי ארוך לפעמים אבל הוא מסביר טוב וזה עוזר להבנה של המבחן.\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: לא הייתי. ראיתי הקלטה או 2 והבנתי שאין כל כך קשר למבחן או להרצאות. לא ממליץ ללכת\n\nשעורי הבית: אין. הוא מפרסם אחרי כל כמה הרצאות תרגילים שקשורים לחומר, לא להגשה.\n\nהמבחן: הרבה נאמר על המבחן פה. לדעתי הוא מבחן דיי פשוט - תמיד באותו מבנה של שאלות, עם טריקים דיי דומים בכל אחד. עם למידה של שבוע של חזרה על מבחני עבר +צפייה בשעות קבלה יכולים בקלות להוציא ציון טוב.\n\nהשורה התחתונה: קורס בסדר, המבחן לא כזה קשור למשהו באמת אבל אם מבינים את הטריקים של חובב, ומבינים את החומר בצורה בסדר אפילו אפשר להוציא ציון טוב.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות:\nהלכתי חצי סמסטר והבנתי שמיותר לחלוטין אז הפסקתי ללכת.\n\nחוות דעת - תרגולים:\nלא רלוונטיים בכלל, לא הלכתי ולא ממליצה ללכת בזבוז זמן.\n\nשעורי הבית:\nאין\n\nהמבחן:\nפה הנקודה החשובה - יש 6 נושאים למבחן ולכל נושא פתרון קלאסי. עד המבחן שלנו חובב היה מגוון ב-2 שאלות, בסמסטר שלנו הוא שינה את כל השאלות ממש הוסיף פרטים חדשים שלא נתקלנו בהם בכלל ואמריקאיות חדשות.\nאיך להצליח במבחן? נטו שעות קבלה (ואין הרבה אז זה בקטנה) ותרגול מבחנים!!! הטיפ הכי חשוב שאני יכולה לתת בקורס הזה זה פשוט לתרגל כמה שיותר מבחנים ולהבין בכללי על מה הוא יכול לשאול.\nלא למדתי את הקורס הזה כל הסמסטר וסגרתי בערך בשבוע את כל הלמידה שלי למבחן.\n\nהשורה התחתונה: קורס מתעתע כי במהלך הסמסטר מרגיש שהוא הכי \"לא קשה\", ואז המבחן תלוש לגמרי - תתרגלו מבחנים!\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nסביר ומשעמם\nהמבחן:\nדי כבר חובב מה עשינו לך במחזור הזה שהממוצע שלך בכל קורס נושק ל55? תעזוב אותנו! זה קורס מיותר!, הוא קורס לא שימושי, הוא בעיקר קורס של תעשייה וניהול, לא רוצה לדעת איך מניות עובדות ובטח לא את הטריקים שלך במועד הזה\nמבחן של \"שעה\" הוא אמר\nישבתי 4 שעות!!!! 4!!!!\nחשבתי שנכשלתי עד שגיליתי שאני מעל הממוצע\nקורס חמוד! חומר נחמד!\nמבחן מזעזע! בשנים האחרונות חובב מנסה להפוך לדן גרבר הבא והוא מצליח להוריד ממוצעים כמו שפוקדים עליו!\nהשורה התחתונה: לאאאאאאאאאאאא לקחתתתתתתתתתת את הקורסיםםםםםםםםםםם של חובבבבבבבבבב כקורסי בחירהההההההההה אף פעםםםםםםםםםםם אני אצליח לשנות ואני אציל אתכם! זה לא קורס בחירה קל! זה קורס בחירה חרדה!!!\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות:\nמהר מאוד מבינים שזה לא המקום ללמוד בו, משעמם, יבש והמקצוע בצורתו הנוכחית בעיקר מרגיש זלזול באינטליגנציה שלנו. הרבה יותר משיש נסיון ללמד אותנו רעינות כלכליים יש התעמקות יתרה בטריקים של חובב שאין בהם כל מהות חוץ ממשחק אלגברי מעיק.\nחוות דעת - תרגולים:\nחבל על הזמן שלכם\n\nהמבחן:\nאסון, לא בודק אפילו קצת ידע כלכלי. מרגיש כמו גרסה אכזרית של החלק הכמותי בפסיכומטרי, כל שנה יש הדרדרות מטורפת בממוצע והשאלות רק נהיות יותר קשות ומעיקות בלי כל פואנטה נראית לעין.\n\nהשורה התחתונה:\nאל תתקרבו אם יש לכם ברירה.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nההרצאות היו די מעניינות, חובב מקליט הכל (כולל שעות קבלה!) ומתייחס מדהים לסטודנטים.\n\nהמבחן:\nשאלות אמריקאיות קלילות עם חומר פתוח ( מה זה כל הטוב הזה?) צריך לשים לב לא להתבלבל בחישובים ולהדפיס מבחני עבר\nהשורה התחתונה:\nהתחלתי ללמוד את הקורס שלושה ימים לפני המבחן וזה היה מספיק. ממליץ מאד! 2.5 נ״ז עם מינימום השקעה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 79  ב' 69  סופי 77  פרץ חובב\nחורף 2023-2024  א' 83  ב' 84  סופי 86  פרץ חובב\nחורף 2022-2023  א' 82  ב' 71  סופי 81  פרץ חובב\nחורף 2021-2022  א' 80  ב' 77  סופי 85\nחורף 2020-2021  א' 70  ב' 62  סופי 71  לביא אהרן רון\nחורף 2019-2020  א' 69  ב' 65  סופי 71\nאביב 2019       א' 72  ב' 68  סופי 75  לביא אהרן רון\nחורף 2018-2019  א' 67  ב' 79  סופי 76  לביא אהרן רון\nאביב 2018       א' 76  ב' 72  סופי 77  לביא אהרן רון\nחורף 2017-2018  א' 77  ב' 73  סופי 79  לביא אהרן רון\nחורף 2016-2017  א' 80  ב' 66  סופי 77  לביא אהרן רון\nאביב 2016       א' 81  ב' 78  סופי 83  לביא אהרן רון\nחורף 2015-2016  א' 86  ב' 84  לביא אהרן רון\nאביב 2015       ב' 84  סופי 86  טל גרעין שרון\nסופי מועד א': 79\nסופי מועד ב': 69\nסופי: 77\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n245 188 57 77 24 100 77.163 77\nאיש סגל תפקיד\nפרץ חובב מרצה - אחראי מקצוע\nוגנר יונתן מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}