{
  "course_id": "094591",
  "scraped_at": "2025-12-16T13:04:59.339467",
  "information": {
    "raw_text": "00940591 - מבוא לכלכלה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nבקוש והצע: שווי המשקל בשוק, מדיניות הממשלה בתחום המיקרו והשפעתה על שווי המשקל. פונקצית העלויות וגזירת עקומת ההצע. התנהגות בתנאי שוק שונים: מונופול ותחרות בלתי משוכללת. המשק הלאומי: החשבונות הלאומיים. קביעת התוצר המקומי במשק. שער הריבית והשפעתו על ההשקעה. הבקושלכסף. הבנקים המסחריים, הבנק המרכזי והצע הכסף. שווי משקל בשוק הכסף ושווי משקל כללי. מדיניות הממשלה בתחום המאקרו והשפעתה על התוצר, שער הריבית ושעור האינפלציה.\n\nמקצועות קדם: 01040017 או 01040018 או 01040031 או 01040195 או 01040003 או 01040042\n\nמקצועות ללא זיכוי נוסף (מוכלים): 00940501 00940511\n\nמקצועות ללא זיכוי נוסף (מכילים): 00960501\n\nמקצועות ללא זיכוי נוסף: 00940592 00940593 00940594\n\nמועד א': 18-02-2026\nמועד ב': 12-03-2026",
    "title": "00940591 - מבוא לכלכלה"
  },
  "feedback": {
    "summary": {
      "text": "82 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 1.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2019",
        "content": "שם המרצה: -\nחוות דעת - הרצאות: -\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית: אין :)\n\nהמבחן: ממוחזר ממאגר שאלות שמפורסם במודל.\n\nהשורה התחתונה: לא נגעתי בקורס בכלל בסמסטר. למדתי למועד ב' דרך studies והוצאתי 100. קורס נחמד ואפילו מעניין, ממליץ ממש.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: לא צריך ללכת להרצאות, נטו ללמוד מstudies. החומר שם מקיף את כל מה שלומדים בקורס וברמה יותר גבוהה אפילו.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: מתרגלת טובה, הולכים לתרגולים נטו בשביל לקבל את הבונוס על מטלות כיתה. חוץ מזה שהיא נותנת טיפים וטריקים בכל נושא ולקראת המבחן.\n\nשעורי הבית: אין\n\nהמבחן: ממוחזר רצח, בנוי מהמאגר. פשוט לפתור את המאגר וכמה שיותר מועדים ישנים של הקורס\n\nהשורה התחתונה: קורס שעם קצת השקעה אפשר לקבל בו 100 בקלות. מומלץ גם כי הוא נותן מושגים בעולם הכלכלה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "השורה התחתונה: קורס בשביל 100 קל.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: אחלה קורס, מעניין ולא קשה מדי. המרצה ככה ככה לפחות בזום ובמהלך הסמסטר עברתי להרצאות המוקלטות.\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים:\nמתרגל מצוין, אכפתי ומקצועי ביותר.\nשעורי הבית:\nאין\nהמבחן:\nסביר לגמרי\nהשורה התחתונה: אחלה קורס, המלצה חמה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2020",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מעולות , בזום ועם אייפד מאוד נוח להבנה.\n\nשם המתרגל/ת: חובב פרץ\nחוות דעת - תרגולים: מעולים עוברים בצמוד להרצאות\n\nשעורי הבית: אין\n\nהמבחן: פרונטלי מול המרצה קשה ומלחיץ. החומר לא קשה אך פלטפורמת המבחן מאוד קשוחה\n\nהשורה התחתונה: קורס מעניין\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: מרצה מצויינת!\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: מתרגל מצוין!\n\nשעורי הבית: אין\n\nהמבחן: קליל ביותר, חצי מבחן היה מרופרנס מהמאגר והיה חומר פתוח\n\nהשורה התחתונה: 100 קל\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שעורי הבית: אין\n\nהמבחן: ממוחזר\n\nהשורה התחתונה: למדתי רק מ-studies אחרי שלא הייתי כל הסמסטר והוצאתי אחלה ציון. ממליצה להפנות להרצאות ב-studies לפחות חמישה ימים, ולפחות שלושה ימים לפתור שאלות מהמאגר\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2020",
        "content": "חוות דעת - הרצאות: ההרצאות מעניינות אבל ארז ממש מגזים\n\nשם המתרגל/ת: ארז\nחוות דעת - תרגולים: הוא פתר כמה תרגילים\n\nשעורי הבית: אין חובה\n\nהמבחן: היה זוועתי, בעל פה , המרצה התייחס לסטודנטים באופן משפיל\n\nהשורה התחתונה: אם המבחן נעשה עם ארז בעל פה אל תתקרבו לזה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: סטאדיז\nחוות דעת - הרצאות: מסביר מעולה וממוקד למה שרלוונטי למבחן, מצד שני זה קצת חופר לפעמים ולכן למעשה לא ראיתי את כל ההרצאות והשלמתי את מה שהיה קריטי בזמן הלמידה למבחן.\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: מסביר טוב, התרגולים היו בשיטת כיתה הפוכה וצפיתי בהם רק כאשר היה בונוס במודל.\n\nשעורי הבית: אין הגשות במובן הרגיל, בחלק מהתרגולים היתה שאלת בונוס אחת לא קשה.\n\nהמבחן: היה מקוון עם חומר פתוח במחשב ומרופרנס ברובו מהמאגר, ידע סביר בקורס ושימוש בקונטרול F הספיקו ל-100.\n\nהשורה התחתונה: קורס קל מאד שנותן רקע בסיסי בנושא שחשוב לקבל בו רקע בסיסי ועם מעט השקעה במהלך הסמסטר אפשר לקבל בו ציון מעלה ממוצע.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: הרצאות מעניינות, משתדלת לשלב אקטואליה שזה נחמד, עושה הרבה דוגמאות\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: תרגולים ממוקדים ומועילים.\n\nשעורי הבית: אין\n\nהמבחן: די ממוחזר, יש מאגר שאלות באתר שפשוט צריך לעשות הרבה ממנו. המבחן של הסמסטר הזה היה יותר מבוסס הבנה ופחות חישובים, לטוב ולרע. בכל מקרה הדרך ללמוד למבחן זה לדאוג שיהיו איזה 4-5 ימים פנויים ופשוט לעשות מלא שאלות מהמאגר\n\nהשורה התחתונה:\nלגבי סטאדיס: אם נשארים יחסית על החומר במהלך הסמסטר זה ממש לא נחוץ, אם רוצים ללמוד בקיץ למועד ב' ויש זמן זה גם לא נחוץ, אם רוצים ללמוד בלחץ שבוע לפני המבחן יש מצב שסטאדיס יותר הגיוני כי הוא יותר ממוקד (כך אומרים).\nבכל מקרה אחלה קורס, אם יש זמן ללמוד למבחן אז הוא אפילו קליל וגם די מעניין לעתים.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "חוות דעת - הרצאות:\nלא חייב להגיע (אפשר להשלים את החומר לבד דרך סיכומים, יחסית קל).\n\nחוות דעת - תרגולים:\nאחלה תרגולים, מומלץ להגיע בעיקר כדי לקבל את הנקודות בונוס לציון הסופי (בסמסטר הנוכחי אפשר היה להגיע ל7 נקודות בונוס לציון הסופי בקלות).\n\nשעורי הבית:\nאין\n\nהמבחן:\nממליץ ללמוד לפחות שבוע לפני עם סיכום טוב ולפתור את כל המאגר. המבחן דיי ממוחזר מהמאגר (בעיקר מהשאלות בסוף המאגר).\n\nהשורה התחתונה:\nאחלה קורס\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: שרון רגב\nחוות דעת - הרצאות: לא חובה להיות בהן. לי לא מאוד הועילו.\n\nשם המתרגל/ת: איילת קוגוס\nחוות דעת - תרגולים: תרגולים מעולים, בעיקר כי שווה להרוויח 7 נקודות בונוס לציון הסופי. מעבר לזה שהם מלמדים מאוד לקראת המבחן.\n\nשעורי הבית: אין.\n\nהמבחן: מאוד הוגן ומאוד קל למי שמבין את החומר. הוא מבוסס על שאלות ממאגר השאלות שמפורסם במודל, ומדובר בקונספט שמאוד חוזר על עצמו.\n\nהשורה התחתונה: קורס קליל ומעולה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2021",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: קצר ולעניין. משחרר הכיתה בכיף שעה-שעתיים לפני הזמן ברגע שהוא מסיים את החומר של אותו שיעור. מעביר את החומר בצורה טובה.\n\nשם המתרגל/ת: חובב פרץ\nחוות דעת - תרגולים: משולב תוך-כדי ההרצאות. אותם שאלות חוזרות על עצמם כל שנה, אז הוא מראה פעם אחת איך עושים כל סוג שאלה ולא צריך שום דבר מעבר לזה.\n\nשעורי הבית: אין.\n\nהמבחן: ממוחזר לגמרי ( רק המספרים שונים). קל מאוד להתכונן, אין הפתעות.\n\nהשורה התחתונה: קורס קל וקצר עם ציון טוב די מובטח למי שעובד. החומר עצמו דיי תאיורטי ולא ישים בעולם האמיתי, לא יוצאים עם שום דבר קונקרטי.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר קיץ 2021",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nהרצאות נחמדות\nשם המתרגל/ת: אין\nחוות דעת - תרגולים:\nאין\nשעורי הבית:\nאין\nהמבחן:\nלא מסובך.. תלוי תרגול\nהשורה התחתונה:\nתרגול של הרבה מבחנים והכל חוזר\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2021",
        "content": "שם המרצה: חובב פרץ\n\nחוות דעת - הרצאות + תרגולים:\nההרצאות משלבות בפנים גם את התרגול, ואת שניהם מעביר חובב פרץ. חובב סיים את כל החומר של הקורס בעשרה מפגשים של בערך 3 שעות אקדמיות לכל מפגש (לא 4 שעות כמו שמופיע במערכת). החומר עובר בקצב איטי, ואם יש הקלטות אז זה לגמרי ריאלי לצפות בהן על הילוך מהיר יותר. החומר של הקורס לא קשה ומערב בעיקר למידה של נושא בכל שיעור ואז פתרון תרגילים ממבחנים באותו הנושא. בסך הכל יש כאן פיתוח אינטואיציה קלה בכלכלה אבל בעיקר ללמוד להציב בנוסחאות ואלגוריתמי פתרון קבועים מראש את נתוני השאלה.\n\nשעורי הבית: חובב מפרסם אחרי כל הרצאה תרגילים מומלצים ממבחני עבר לפתור בחומר הנלמד. זה לא חובה ולא מביא מגן. אני אישית לא נגעתי בזה ועדיין הצלחתי בקורס.\n\nהמבחן: מבחן שמאוד חוזר על עצמו. תבנית קבועה עם כמות שאלות קבועה מכל סוג. אין הפתעות, והרוב המוחלט של השאלות זה פשוט שאלות ממבחני עבר עם נתונים מספריים מעט שונים. המבחן עם חומר פתוח אז אפשר להביא פתרונות לכל סוג של שאלה ולגמרי להיות מסודרים.\n\nהשורה התחתונה: קורס קליל שאפשר להצליח בו בלי יותר מדי מאמץ.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "חוות דעת - הרצאות: לא ראיתי\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: מלמדים את החומר שצריך למבחן, לדעתי לא בצורה הכי ברורה, כדאי לשלב למידה מסיכום\n\nשעורי הבית: לא היו\n\nהמבחן: שאלות חוזרות על עצמן הכי חשוב להתאמן\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: מרצה די מעניינת, מציגה גם נושאים אקטואליים\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: קצת מבולגן לטעמי, אבל יודע את החומר\n\nשעורי הבית: אין\n\nהשורה התחתונה: אני קצת משוחד כי לקחתי את הקורס כי הנושא באמת מעניין אותי וזה לא סתם בשביל להעלות ציון. מי שרוצה לקחת אותו בשביל לשפר ממוצע יכול להשקיע רק בלמידה של שבוע לפני המבחן ולקבל ציון טוב.\nהערה שחשוב לציין: בכל קבוצת ווטסאפ של הקורס מסתתר סוכן מכירות של האתר STUDIES. אני לא יודע אם האתר עצמו באמת מועיל או לא אבל אל תתפתו להוציא כסף אלא אם כן אתם ממש חושבים שאתם לא על החומר. במידה ובחרתם בכל זאת להוציא כסף על קורס, שתדעו שיש גם את GOOL, אז שווה לבדוק גם אותו לפני שקונים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות:\nמיותר לחלוטין. 3 שעות ברצף והכל אפשר ללמוד בתרגולים.\n\nשם המתרגל/ת: הייתי אצל שניהם. איילת יותר טובה ומסודרת בעיניי.\nחוות דעת - תרגולים:\nאפשר ללמוד את החומר רק מהם. יש שאלות בונות בזמנים אקראיים כדי לעודד להגיע לתרגולים. כל שאלה כזו היא נקודת *בונוס* לסופי. עד צבירה של 7 בסמסטר שלי. מאוד מאוד שווה. עושה את ההבדל כדי להגיע ל100.\n\nשעורי הבית:\nרק שאלות פתע בזמן תרגולים.\nהמבחן:\nאמריקאי בדרך כלל. הוגן מאוד. חומר סגור.\n\nהשורה התחתונה:\nקורס מומלץ בשביל הבנה בסיסית של השוק וכבונוס זה בוסט יפה לממוצע.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: טטיל שרון\nלא נכנסתי - לא באמת חשוב\nשם המתרגל/ת: איילת\nגל בסדר\nאיילת קונגרס מדהימה -\nשווה לעבור אליה\n\nשעורי הבית:\nלא קיימים\nהמבחן:\nקליל\nהשורה התחתונה:\nקורס שווה פיצוצים\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון טייטלר\nחוות דעת - הרצאות:\nלא תמיד קשורות לחומר, הרבה רקע\n\nשם המתרגל/ת: איילת קוגס\nחוות דעת - תרגולים:\nמתרגלת מצויינת\nבנוסף יש בחנים בחלק מהתרגולים שמעלים ציון\n\nשעורי הבית:\nאין, אבל כדאי לתרגל במהלך הסמסטר\n\nהמבחן:\nלא מבחן כזה פשוט כמו שמתואר פה בחוות דעת אחרות , מתוך 20 שאלות במבחן היו בערך רק 3-4 שאלות טכניות שרק דורשות וכל השאר שאלות הבנתיות וטריקיות.\n\nהשורה התחתונה:\nהרבה אנשים רשמו שזה מקצוע להוציא בו 100 קל, ולא דורש הרבה השקעה, אני חייב להגיד שגם נעזרתי בסרטונים של סטאדיס וגם הלכתי לתרגולים ובתור סטודנט עם ממוצע ציונים גבוה, המבחן לא היה כזה פשוט ולמדתי אליו 6 ימים, אז קחו את זה בחשבון.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: אחלה של מרצה - חשוב לציין שהי אכן מרחיבה בחומר ומקשרת את ההרצאות לחיים ( פחות קריטי למבחן )\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: קצת מפולגן.. עדיף איילת אם אפשר\n\nשעורי הבית: אין\n\nהמבחן: בשונה מהנוהל המבחן פחות טכני ודורש הבנה מעמיקה... לא קל ולא מצליח לראות איך ניתן לקבל 100 בקלות.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "אמרו שזה קורס קל. אז אמרו...\nבפועל, מבחן מועד א' בסמסטר חורף 2022 עם פקטור של 7 נקודות וציונים שלא משקפים כמה הקורס הזה 'קל' כמו שכולם אומרים\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם הקורס:\nמבוא להיגיון בסיסי\n\nשם המרצה:\nניר חן (Studies.co.il)\nשם המתרגל/ת:\nניר חן (Studies.co.il)\n\nחוות דעת - הרצאות ותרגולים:\nלקחתי את הקורס של ניר דרך סטאדיס והתחלתי ללמוד אותו ברצינות כשבוע וחצי לפני הבחינה.\nכשאני אומר ברצינות, הכוונה היא שהתעקשתי להבין, ופתרתי בעצמי את התרגילים שניתנו לפני שצפיתי בפיתרון.\nהיתרון הוא שיכולתי לראות את ההרצאות על פי 2, וזה עזר לסיים את החומר מהר יותר ועם הבנה טובה יותר מללכת לשיעורים, או אפילו מלראות את ההרצאות בפנופטו (דבר שניסיתי לעשות, וויתרתי דיי מהר כי זה היה לא טוב מספיק).\n\nהחיסרון היחיד של לא ללכת להרצאות והתרגולים שיש במהלך הסמסטר הוא שמפספסים אקסטרה 5 נקודות לציון הסופי שמחולקות לאורך הסמסטר, אבל לדעתי חיסכון הזמן בסופו של דבר שווה את זה.\n\nסיימתי את תהליך הלמידה אצל ניר כשאני מבין ממש טוב את החומר. אמנם לא יכולתי אחרי הקורס לתרגל שאלות ממאגר השאלות והבחינות לדוגמא בגלל שחליתי בקורונה באמצע הלמידה, ולא היה לי זמן - אבל התרגול במהלך הקורס של סטאדיס הוכיח את עצמו, כי סיימתי את הקורס עם 97 סופי.\nאני כמובן ממליץ - אם יש זמן, תפתרו שאלות מהמאגר כדי להבטיח את ה-100.\n\nהמבחן: דורש הבנה טובה של החומר, אבל אם מגיעים מוכנים, אפשר להוציא ציון של מעל 90 ואפילו 100 דיי בקלות.\n\nהשורה התחתונה:\nהקורס לא קשה ועם 0 עומס, הוא באמת דורש הבנה שגובלת בהיגיון בסיסי, כל עוד משקיעים בלהבין את החומר.\nאפשר ללמוד את הקורס גם שבוע וחצי-שבועיים לפני המבחן ולהפציץ, רק שימו לב שאני עשיתי את זה בעזרת סטאדיס, ואני לא יודע איך זה הולך בדרכים רגילות.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון רגב טייטלר\nחוות דעת - הרצאות: מעניינות, מעבירות את החומר בצורה מסקרנת, אך אורכות 3 שעות. עושים תרגילים ביחד בכיתה כדי להבין את החומר. אם היה סיכום רשמי מסודר של החומר המועבר בהרצאות היה מצוין. (ולא מפוזר)\nאבל בדרייב ניתן למצוא סיכומים טובים של החומר.\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים:\nמתרגל מצוין, מסביר את החומר בצורה ברורה ונותן טיפים להתמודדות עם התרגילים.\nהמבחן:\nבזמן האחרון הפך להיות מבוסס יותר על שאלות הבנה מאשר תרגילי חישוב. צריך אולי בתרגולים לתת יותר דגש לתרגילים מהסוג הזה ואיך לגשת אליהם.\nהשורה התחתונה:\nקורס מומלץ ומעניין, עם למידה בהתאם אפשר להגיע לציון טוב.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שעורי הבית:\nאין\nהמבחן: שאלות ממוחזרות מתוך מאגר של כ-500 שאלות. אז אפשר לא להבין את החומר ופשוט לפתור את כל השאלות (אישית העדפתי לראות את ההרצאות ולהבין את החומר ולפתור רק חלק מהמאגר, וזה עבד טוב)\n\nהשורה התחתונה: קורס קל ומעלה ממוצע.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון (וסטאדיס)\nחוות דעת - הרצאות: שרון מסבירה אחלה אבל זה לא יעיל מבחינת זמן להיכנס להרצאות כי זה לא קורס קשה. בפועל אחרי 3 שבועות בסמסטר הפסקתי להיכנס להרצאות ובהמלצת חבר למדתי רק דרך Studies כשבוע וחצי לפני המבחן והקדשתי יומיים של פתירת שאלות מהמאגר. המבחן היה תיאורטי ולא ממוחזר כמו שחשבתי שיהיה אבל הוצאתי 100 בלי הבונוס שכופה השתתפות פעילה לאורך הסמסטר. חייב לפרגן לסטאדיס על קורס מעולה ומושקע ברמות.\n\nהשורה התחתונה: ללמוד בתקופת המבחנים דרך סטאדיס + לפתור שאלות מהמאגר. להתעקש להבין את החומר כי המבחן תיאורטי ולא ממוחזר. הבונוס לא שווה את זמן ההשתתפות לאורך כל הסמסטר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: הרצאות נחמדות, עוסקת בעיקר באקטואליה ושיח פתוח עם הסטודנטים במהלך ההרצאה ומעבירה חומר חדש בערך בשעה אחת במצטבר מתוך 3 שעות הרצאה, למי שמתעניין בכלכלה אז יכול להיות ממש נחמד, למי שלא אז פחות. בסמסטר שלנו היו הקלטות אז זה היה יתרון משמעותי.\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: מסביר ממש טוב, נותן מקום לשאלות ומתעכב יותר על הבנה מאשר פתירת תרגילים, אם מסיים מוקדם יותר אז משחרר לפני. כמה פעמים יצא שלא ראיתי את ההרצאה מראש והוא הצליח להסביר בתרגול את כל הנושא. מומלץ מאד להגיע גם לתרגולים פרונטלי בשביל בחני בונוס שנותנים עוד 1-2 נקודות בונוס! (לא מגן) לציון הסופי ולמי שנכח בתרגול הם ממש קלים.\n\nשעורי הבית: אין (תכלס יש אבל הם לא להגשה, בדיעבד אולי שווה לפתור אותם במהלך הסמסטר או שאלות מהמאגר בשביל להקל למידה לקראת המבחן)\n\nהמבחן: המבחן הסמסטר במועד א' היה מאד לא פשוט הוסיפו 7 נקודות פקטור לציון הבחינה, דבר חריג יחסית לקורס הזה. כהכנה פתרתי את כל מאגר השאלות שהיו להם פתרונות מלאים (כ-200 שאלות) ועדיין התקשיתי מאד במבחן, מחברים שפרתו את כל המאגר המלא (400 שאלות) הבנתי שהיה הרבה יותר קל - כי המבחן בסופו של דבר מתבסס על כל ה400 שאלות האלו. בכל מקרה בשביל להצליח להוציא מעל 90 בבחינה חשוב להבין טוב את החומר,\n\nהשורה התחתונה: קורס שלא דורש הרבה השקעה במהלך הסמסטר אבל ההכנה למבחן לא פשוטה בכלל ודורשת כמעט שבוע של למידה אינטנסיבית! המבחן האחרון התבסס בעיקר על הבנה ופחות על חישובים לעומת מבחני עבר אז למי שמעוניין לגשת רק בשביל 100 קל - להבין שהוא אמנם הרבה יותר אפשרי מאשר בקורסים אחרים של 3.5 נק\"ז אבל הוא בכלל לא קל.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "הקורס לא עמוס ולא דורש למידה לאורך הסמסטר אבל הוא לא כזה קל כמו שעושים ממנו. מועד א' היה קשה ועם 7 נקודות פקטור כדי שהממוצע יהיה נורמלי. לא הייתה אפילו שאלה אחת ממוחזרת מהמאגר והיו הרבה שאלות תיאורטיות כך שמי שרק שינן טכניקות נפל (כנראה הסגל החליט לשנות מדיניות אחרי הרבה שנים של שאלות ממוחזרות).\nאישית אני למדתי עם Studies ואני מרגיש שבזכותם הוצאתי את הציון שכיוונתי אליו. לקח לי 7 ימי לימוד אינטסיביים.\nבלי קשר, החומר הנלמד הוא סופר מעניין ופותח את התיאבון.\n\nשורה תחתונה: הקורס הוא לא Walk in the park. תלמדו עם Studies ותמשיכו הלאה בחיים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "האמת שהקורס מאכזב ולדעתי לא מומלץ. מרצה שמקדישה את מרבית הזמן לאקטואליה ולא ללימוד חומר. המתרגל היה טוב אבל כנראה שזה לא הספיק כדי להוציא ציון נורמלי. החומר דורש הבנה ולא רק שינון.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: מרצה רעה שגם לא מלמדת ומשהו וגם נעלבת שהרוב משתמשים במקור חיצוני מסוים ולא מגיעים להרצאות אז דופקת מבחן קשה במכוון ביחס לשנים קודמות. היא שכחה שזה לא קורס ליבה.\nהיא גם לא מבינה שככל שהמבחן קשה יותר זה דווקא דוחף יותר אנשים ללמוד דרך המקור החיצוני כי מלמדים שם הרבה יותר טוב והרבה יותר מסודר ממנה.\n\nהשורה התחתונה: כך או כך, לא ללכת להרצאות. בזבוז זמן. המבחן קשה יותר משנים קודמות (אבל עדיין לא בשמיים).\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "אני מתחרט שלקחתי את הקורס הזה.\n\nהמבחן ברובו תאורטי ולא טכני כמו התרגילים מהתרגולים והמאגר. כמו כן, נראה שהמבחן נבנה כדי לפגוע בסטודנטים שמשתמשים בהקלטות או במקורות חיצוניים.\n\nאפשר להוציא ציון גבוה, אבל צריך להיות \"על זה\" במהלך הסמסטר. ואם אני כבר מעוניין להשקיע בקורס, זה לא בקורס הזה.\n\nאז אם מישהו שרואה את זה מתכנן לקחת את הקורס כ\"קורס קל שמעלה ממוצע\". אל.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "כשנרשמתי לקורס הייתה עליו סטיגמה של קורס קליל שדורש רק תרגול ממאגר של 400 שאלות שתמיד ממוחזרות במבחן.\nבפועל, הסמסטר המרצה שינתה את המדיניות ולא הייתה שאלה אחת ממוחזרת מהמאגר אלא מלא שאלות תיאורטיות שדורשות הבנה עמוקה וזה גרר ממוצע נמוך יחסית לקורס כזה (77).\n\nבשביל להוציא ציון גבוה צריך או להיות \"על\" הקורס לאורך כל הסמסטר ולהשקיע הרבה זמן בהקשבה למרצה שהיא חצי כוח או להוציא 250 שקלים על קורס חיצוני של סטאדיז שמכין למבחן תוך כמה ימים שזה לא משהו שמסתדר לכל אחד (אומר לזכותם שהם כן בנו קורס ממש מושקע ומדויק). בכל מקרה אי אפשר לחפף כמו פעם ולצפות לציון גבוה.\n\nמבחינת עומס: תלוי באיזו אופציה בוחרים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון טייטלר\nחוות דעת - הרצאות:\nהרצאות מאוד מעניינות למי שמתעניין בכלכלה!\nמוסיפה הרבה דוגמאות אקטואליות ומרחיבה מעבר לחומר למבחן.\n\nשם המתרגל/ת: איילת קוגוס\nחוות דעת - תרגולים:\nמתרגל מעולה, תמיד מגיעה עם חיוך ומסבירה את החומר לעומקו.\n\nשעורי הבית:\nאין - היה בונוס של עד 5 נק' לציון הסופי בבחנים לנוכחים בתרגולים (שאלה ממש קלה מהחומר הנלמד באותו תרגול)\n\nהמבחן:\nהיה כמעט אך ורק תאורטי בניגוד למועדים האחרונים.\nמומלץ בלמידה למבחן לעבור על המאגרים ולאחר שמגיעים לרמה הטכנית הנדרשת (משמע כל תרגיל חישובי יודעים לעשות בדיוק את מה שצריך) לעבור על כלל השאלות התיאורטיות ולזהות את הטריקים או להשלים חורים קטנים שלא ידעתם.\n\nהשורה התחתונה:\nקורס שלא דורש אף מאמץ במהלך הסמסטר, למידה למבחן כ-3 ימים צריכים להספיק.\n\nלמי שמתעניין בכלכלה קורס מאוד מומלץ ולא קשה, אם אתם לא מתעניינים בכלכלה בכלל וזה נושא שרק משעמם אתכם אל תצפו למל\"ג קליל.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: studies\nחוות דעת - הרצאות: ממליץ\n\nהמבחן: אין כמעט שאלות חישוביות בכלל, אם אני לא טועה שני המועדים שהיו עכשיו היו ממוחזרים באיזור ה80% מכל ארבעת המאגרים (סדר גודל של 400 שאלות). היו פקטורים של 7 נקודות בשני המועדים, נראה שהרמה גבוהה יותר והשאלות תיאורתיות יותר.\n\nהשורה התחתונה: זה לא מלג. אבל גם לא המקצוע הפקולטי הכי קשה. אם לוקחים אז לטחון מאגרים ולהתייחס לזה ברצינות כי זה לא כזה פשוט.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "מרוב סוכני מכירות של Studies קשה למצוא פה כבר ביקורות אובייקטיביות לקורס עצמו, מאוד מאכזב.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון רגב טייטלר\nחוות דעת - הרצאות: לא ראיתי\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: אחלה מתרגל\n\nשעורי הבית: אין\n\nהמבחן: יצא לקורס שם שהוא קליל ואני לא הרגשתי ככה במבחן, מה שכן, ב-10 ימים *רציניים* אפשר ללמוד אותו מ-0.\n\nהשורה התחתונה: לא מעניין כמו שחשבתי\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: מעניינת אבל רוב הדברים לא באמת חשובים למבחן\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: מבולגן אבל יודע טוב את החומר\n\nשעורי הבית: אין שיעורים, תרקדו\n\nהמבחן: אמריקאי ממוחזר מהמאגר\n\nהשורה התחתונה: לפתור את המאגר, לפתור מבחני עבר, להגיע לתרגולים ולקבל את הבונוס - 100 מובטח\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: לא ראיתי ואין צורך, בעיקר אקטואליה ולא מיועד למי שבא לעשות מבחן וללכת.\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: מעביר את התרגול מעולה, מי שרוצה להיות באיזשהוא קשר עם החומר תוך כדיי הסמסטר יכול להגיע רק לתרגולים/לראות הקלטות שלהם, אבל לא חובה.\n\nשעורי הבית: אין כאלה שהם חובה.\n\nהמבחן:\nבשנים האחרונות כמות השאלות החישוביות במבחן ירדה כמעט ל0 ורוב המבחן מתבסס על הבנה, לכן האמירה שמי שיעשה את המאגר יצליח כבר איבדה מערכה כי רוב השאלות במאגר עם התשובות הן שאלות חישוב שלא מגיעות למבחן. אני ממליץ להשיג כמה שיותר מבחני עבר מחברים ולתרגל אותם עד שמבינים את כול הניואנסים הקטנים של השאלות, בסוף זה מתחיל לחזור על עצמו והרבה דברים שמעצבן לזכור מופיעים בדף הנוסחאות.\n\nלגביי סטאידס? לא חובה בכלל כשיש את ההרצאות המוקלטות והתרגולים המוקלטים, אין ערך מוסף אלא אם כן אתם ממש צריכים שיאכילו אתכם בכפית ויסבירו לכם איך הגיעו לכול משוואה בדף נוסחאות.\n\nהשורה התחתונה: תפנו שבוע של למידה אינטנסיבית למבחן, תתרגלו מבחני עבר ואת המאגר בלי התשובות, 95+ מובטח בלי צורך בפאקטור ומגן. 3.5 נק״ז באווירה של מל״ג עמוס.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: ראיתי מוקלט על X2, הרצאות סבבה.\n\nשם המתרגל/ת: גל/איילת\nחוות דעת - תרגולים: ראיתי מוקלט של גל, בגדול הוא מתרגל טוב אבל מאוד מבולגן ולא עובד לפי התרגילים במודל שקצת הפריע לי.\nשיצא לי, הייתי בתרגולים של איילת והיא מתרגלת מעולה פשוט קצת איטית. מומלצת.\n\nשעורי הבית: אין\n\nהמבחן: ממוחזר כולו משנים קודמות, לא לבזבז יותר מידי זמן על המאגר עם התשובות המלאות.\n\nהשורה התחתונה: 100 קליל, אין צורך לשלם לגופים חיצוניים\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2022",
        "content": "חוות דעת - הרצאות: ניר חן-סטאדיס\n\nשם המתרגל/ת: ניר חן-סטאדיס\nשעורי הבית: אין\n\nהמבחן: אמריקאי 20 שאלות\n\nהשורה התחתונה: קורס מעניין שטוב כדי לשבור שגרה מהפקולטה שלכם וללמוד משהו שכל אחד צריך לדעת בחיים. בתור עולה בארץ שקורא עברית יותר לאט מאחרים, למדתי למבחן דרך אתר סטאדיס וזה מאוד עזר לי לקבל ציון גבוה בקורס. אני חששתי בהתחלה לקחת בגלל העברית אפילו שאנשים ממליצים על הקורס אבל ניר והאתר כללו הרבה מאוד תרגילים שהכינו אותי מצויין למבחן, השאלות היו בסגנון מאוד דומה למבחן. מאוד מומלץ!\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שעורי הבית: לא עשיתי\nהמבחן: 100 אפשרי בהחלט בהשקעה מינימלית\n\nמתכון ל100:\n1. אפשר להזניח את הקורס כל הסמסטר ולהתחיל ללמוד לקראת מועד ב\n2. לקראת מועד ב לצפות בתרגולים, אין צורך בהרצאות\n3. הכי חשוב - לתרגל את המאגר ולהבין את הפתרונות. בהתחלה נראה קצת מפחיד אבל אחרי יומיים שלושה של פתירת תרגילים שמים לב שיש מספר סופי ונמוך של עקרונות שחוזרים על עצמם והכל נהיה קל.\n4. אין צורך בסטאדיס. בכלל. חבל על הכסף.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: סבבה תרגול טוב\n\nשם המתרגל/ת: כמו המרצה\nהמבחן:\nחופף לתרגול בשיעורים ולמבחנים של המרצה הזה.\nחייבים ללמוד רק ממנו ולא מסמסטרים אחרים!\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "חוות דעת - תרגולים: אצל אילת לא הבנתי כלום. עדיף לראות את המוקלטים של גל דנינו.\n\nשעורי הבית: אין\n\nהמבחן: השאלות חוזרות משנה לשנה. מומלץ לעשות את מאגר השאלות ומבחנים משמנים קודמות, להבין את הפתרונות או להיזכר איך עושים בגדול. שבוע מספיק להוציא ציון טוב.\n\nהשורה התחתונה: 3.5 נקז קלים\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מעביר את החומר בצורה טובה\n\nשעורי הבית: תרגילים ממבחנים - לא חובה\n\nהמבחן: דורש חדות ותשומת לב לפרטים שאינם קשורים לידע והבנה של החומר. צריך כל הזמן לחשוב בכל שאלה וסעיף האם מנסים להפיל אותי באיזה פרט שולי ולא סביר שהינדסו אותו במיוחד כדי לבלבל.\n\nהשורה התחתונה:\nחשוב לשים לב שבקיץ מועבר למעשה הקורס \"עקרונות הכלכלה למהנדסים\" תחת השם \"מבוא לכלכלה\" מה שלא ידוע לרבים שלוקחים את הקורס, ואני ביניהם.\nמבוא לכלכלה הוא קורס קליל שעם שבוע למידה מ-0 מקבלים בו 100. הטכניון יודע את זה לכן הוא משתמש בשם הקורס בקיץ כדי שתירשמו ותשלמו ממיטב כספיכם על קורס שונה לחלוטין - הרי ל\"עקרונות הכלכלה למהנדסים\" לא הייתם נרשמים.\nכדי לקבל 100 בעקרונות הכלכלה ראשית תידרשו לשלוט בחומר לחלוטין(לא אסון), אבל מה שיותר קריטי זה שפשוט תצטרכו מזל כי הסיכוי שלא תפספסו כלום במבחן שנועד לבלבל הוא אפסי.\nבסופו של דבר במועד ב קיבלתי 100 ובכל זאת אני ממליץ לא לקחת את הקורס בקיץ אלא רק בחורף\\אביב(עם עדיפות לחורף), פשוט כי יהיה לכם הרבה יותר קל וחלק. מנגד, אם אתם מאלא שאוהבים לסבול - עדיין לא הייתי ממליץ על הקורס, קחו אינפי 3 או משהו.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר קיץ 2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מעביר את החומר בצורה טובה\n\nשעורי הבית: תרגילים ממבחנים - לא חובה\n\nהמבחן: דורש חדות ותשומת לב לפרטים שאינם קשורים לידע והבנה של החומר. צריך כל הזמן לחשוב בכל שאלה וסעיף האם מנסים להפיל אותי באיזה פרט שולי ולא סביר שהינדסו אותו במיוחד כדי לבלבל.\n\nהשורה התחתונה:\nחשוב לשים לב שבקיץ מועבר למעשה הקורס \"עקרונות הכלכלה למהנדסים\" תחת השם \"מבוא לכלכלה\" מה שלא ידוע לרבים שלוקחים את הקורס, ואני ביניהם.\nמבוא לכלכלה הוא קורס קליל שעם שבוע למידה מ-0 מקבלים בו 100. הטכניון יודע את זה לכן הוא משתמש בשם הקורס בקיץ כדי שתירשמו ותשלמו ממיטב כספיכם על קורס שונה לחלוטין - הרי ל\"עקרונות הכלכלה למהנדסים\" לא הייתם נרשמים.\nכדי לקבל 100 בעקרונות הכלכלה ראשית תידרשו לשלוט בחומר לחלוטין(לא אסון), אבל מה שיותר קריטי זה שפשוט תצטרכו מזל כי הסיכוי שלא תפספסו כלום במבחן שנועד לבלבל הוא אפסי.\nבסופו של דבר במועד ב קיבלתי 100 ובכל זאת אני ממליץ לא לקחת את הקורס בקיץ אלא רק בחורף\\אביב(עם עדיפות לחורף), פשוט כי יהיה לכם הרבה יותר קל וחלק. מנגד, אם אתם מאלא שאוהבים לסבול - עדיין לא הייתי ממליץ על הקורס, קחו אינפי 3 או משהו.תונה:\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: ד\"ר טייטלר- רגב שרון\nחוות דעת - הרצאות: ההרצאות הרגישו לי קצת מתפזרות מידי, עם שיח מעניין על דברים שלא בחומר, 3 שעות הרצאה שהיו יכולים לצמצם לשעתיים ממוקדות. בעיקר עוזרות לתת את הרעיונות של החומר. תעבדו בהרצאה עם הסיכום זה יעזור מאוד כי יש הרבה מושגים מבלבלים ולא תמיד דואגים להזכיר מה זה כל דבר. **יש הקלטות**\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: גל אלוף, עושה חזרה בתחילת השיעור על החומר וב25 דקות ממצה את כל מה שקרה בהרצאה, אחר כך פותר שאלות ממבחנים ומעביר את העקרונות בצורה טובה. **יש הקלטות**\n\nשעורי הבית: אין\n\nהמבחן: המגן הוא 100% מהציון הסופי. חלק לא קטן (איזה 6 מתוך 20) ממוחזר ממש והיתר דומה לדברים שראיתם. אפשר להתכונן כמה ימים אליו ולהוציא ציון יפה שמעלה ממוצע בייחוד ביחס לנקז. לקרוא סיכום ולהבין, 4 מבחנים ואתם יכולים להיות רגועים.\n\nהשורה התחתונה: לי היו 3 ימים ללמוד למבחן, רוב הסמסטר הרגשתי שאני לא על החומר בכלל(!) וגם ההרצאות היו מבלבלות.\nאם תתאמצו להקשיב בהרצאות ובתרגולים ותקראו סיכומים תגלו שהבנתם הרבה יותר ממה שחשבתם. ב3 ימים אפשר להגיע מרמת הבנה נמוכה ל90+\nבאמת!\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר קיץ 2022",
        "content": "שם המרצה: חובב פרץ\n\nשעורי הבית:\nשאלות ממבחנים שחובב נותן, הן לא חובה\n\nהשורה התחתונה:\nחזרתי על הקורס עכשיו בחורף כדי לשפר ציון\nבקיץ ממש השקעתי, עברתי על המון מבחנים ועדיין לא קיבלתי את הציון שרציתי.\nעכשיו בחורף כל הסמסטר לא הגעתי בכלל להרצאות, 5 ימים לפני המבחן התחלתי ללמוד וגיליתי שיש הרבה שינויים ביחס למה שלמדתי בקיץ, אז די נלחצתי, אבל תוך יומיים של למידה כבר הבנתי שהחומר פשוט והמבחן ברמה נמוכה.\nבקיצור, לא לקחת בקיץ - אני בזבזתי על זה סתם כסף וממש מצטערת על כך - עם 7 ימי למידה רציניים מ-0 בסמסטר חורף/אביב אתם על 100 קל\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: לא הגעתי למעט פעמיים אחרונות\n\nשם המתרגל/ת: אלישבע\nחוות דעת - תרגולים: מזעזעת, לא יודעת את החומר\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: טובה, הגעתי ל2 תרגולים אחרונים. אם מסתדר במערכת תגיעו אבל לא להתאבד על זה\n\n\nהמבחן: ממוחזר ולא קשה - אפשר להסתדר עם 3 ימים למידה מסיכומים\n\nהשורה התחתונה: כל השנה לא עשיתי כלום, למדתי 3 ימים ברצינות וקיבלתי 100. הקורס לא מעניין אבל אחלה סימון וי\n\n*לא לקחתי מקור מידע חיצוני, למדתי מהסיכומים שמפרסמים בקבוצה + בעיקר מאגר השאלות הפתורות שמפורסם במודל\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: מרצה מאוד נחמדה אבל יש פער בין איך שהיא מלמדת לרמת המבחן. היא גם נוהגת להתפזר לדברים אקטואליים שממש מעניינים אבל לא עוזרים למבחן\n\nשם המתרגל/ת: אל תגיעו לתרגולים. גרועים.\n\nהמבחן: הסטיגמה שהמבחן ממוחזר לא עבדה לי במועד ב'. הוצאתי בלחץ 70.\n\nהשורה התחתונה: הקורס לא ממוחזר/קל כמו שסיפרו עליו. הוא דורש השקעה ובעיקר הבנה של החומר.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: הרצאה של 3 שעות בנושא כזה זו הגזמה,אפשר להפסיק את החומר בשעתיים,\nהלכתילכמה הרצאות בהתחלה אך ראיתי שלא באמת מועילות אז הפסקתי\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: מעולה,מסבירה הכל ,בשעה חוזרת על חומר 3 שעות,\n\nשעורי הבית: אין\n\nהמבחן: אני לא פתרתי מבחנו עבר אלא עברתי על 70 שאלות ממאגר א ו60 ממאגר ג,אבל המבחן לא היה דומה לשאלות שם, השאלות שם טכניות מדי ולא דורשות כל כך הבנה,פשוט תפתרו עד שתבינו שיטת הפתרון,אך המבחן לא היה כזה,הופתעתי לרעה את האמת :(\nהשורה התחתונה: :(\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: לדעתי היה אפשר להעביר את החומר בצורה מרוכזת בשעתיים ולא ב3 מה שהופך את ההרצאות לקשות. יתר על כן שרון לדעתי יותר מדי נותנת לאנשים להשתתף ולהביע את דעתם (הלא מעניינת) ככה שזה קוטע את הרצף של הריכוז במהלך השיעור והופך את ההרצאות לקשות מאוד, הייתי ממליץ לכם לראות את ההרצאות במוקלט והלריץ את החפרנים.\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: אלוף עולם, מסביר את החומר כמו שצריך בצורה הבנתית וברורה, עוזר מאוד בליישם וגם להבין את החומר.\n\nשעורי הבית: אין וחבל שאין.\n\nהמבחן: המבחן הוא ממש ממש על ההבנה של החומר, כלומר כן כדאי להבין את ההרצאות ואת התרגולים ופחות רק לדעת איך לעבוד עם הנוסחאות ולדעת לחשב. בנוסף אין פתרון רישמי למבחנים אז קצת באסה, בגדול כדאי לפתור רק מהמאגרים עם הפתרונות המלאים ולעשות מבחן אחד או שתיים ואם אתם באמת מבינים *הבנתית* את החומר לא אמור להיות לכם בעיה לקבל את ה90+. לצערי הקורס נהיה כמו כל קורס טכניוני שרוצה להוריד ממוצעים אז את ה100 תצטרכו להתאמץ מאוד כדי להשיג אותו.\n\nהשורה התחתונה: סה\"כ קורס לא רע, נותן באמת ידע בסיסי *וחשוב מאוד* בכלכלה, לא לקחת את זה כקורס של יאללה נבוא ונריץ את זה כי כן צריך להתאמץ.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: -\nחוות דעת - הרצאות: לא הגעתי\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: מתרגלת מעולה, התרגול ממש מהיר כיוון שיש רק שעה לכן צריך להיות קשובים ממש.\n\nשעורי הבית: אין\n\nהמבחן: מבחן קשה יחסית למה שציפיתי , דורש המון הבנה בשונה מהשאלות שנמצאות במאגר שרובן חישוביות.\nממליצה לפתור בעיקר *מבחני עבר* ולא שאלות מהמאגר.\n\nהשורה התחתונה: לא לזלזל!\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: ד\"ר טייטלר- רגב שרון\nחוות דעת - הרצאות: לא ממוקדות ומדברות על רעיונות כלליים במקום להתמקד בחומר. יש יותר מידי שאלות בכיתה וכל אחד חושב שהוא ד\"ר לכלכלה ומביע את דעתו המלומדת וזה די מעיק. לדעתי מיותר.\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: תרגולים מצוינים ומאוד יעילים בלסכם את מה שנלמד בהרצאות. גל מלמד בחצי מהזמן את מה ששרון מלמדת בשיעור שלם. החיסרון היחיד של התרגולים הוא שגל פותר שאלות משנים קודמות שהיו בעיקר חישוביות בעוד המבחן בסוף היה בעיקר תיאורטי וזה הפיל הרבה אנשים.\n\nשעורי הבית: אין\n\nהמבחן: יותר קשה ממה שאתה מאמין שיהיה לקורס כזה. היה מאוד תיאורטי בניגוד למה שתורגלנו עם גל. במועד א' לא הוצאתי ציון גבוה. למרות הסלידה שלי מתכנים חיצוניים, בהמלצת ידידה השתמשתי בקורס חיצוני (סטאדיס) שסגר את הפער מצוין לקראת מועד ב'. בדיעבד הייתי משנה את האסטרטגיה שלי לצפייה בסטאדיס + תרגולים עם גל בלבד. לא להגיע להרצאות.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: לא נכנסתי\nשם המתרגל/ת: לא נכנסתי\nשעורי הבית: אין\n\nהמבחן: התחלתי ללמוד את החומר של הקורס שבוע לפני המבחן. לגמרי מספיק. בסך הכל החומר מובן ומה שלא מבינים רואים בהקלטה. לתרגל המון שאלות ובעיקר את התיאורטיות ומובטח לכם ציון טוב\n\nהשורה התחתונה: מלג מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: שרון רגב טייטלר\nחוות דעת - הרצאות: ראיתי מוקלט, חופר אבל כדאי לראות על x2 ולדלג על החפירות מהקהל וההפסקות\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: מוקלט. לא ממש מתמקדים בשאלות מגמתיות כמו שיש במבחן, אבל צריך לראות כדאי להבין את העקרונות ולהתרענן על החומר\n\nשעורי הבית: אין\n\nהמבחן: מבחן הוגן סה\"כ, היו שאלות ממוחזרות משנים קודמות או דומות.\nלפני שעשיתי את הקורס קצת פחדתי בגלל הביקורות.\nאחרי שעשיתי את הקורס, מרגיש שכל הביקורות פה קיצוניות, זה לא קורס מאוד קשה (השאלות ה\"תיאורטיות\" שיש במבחנים זה להבין איך הזזות של דברים משפיעות, לא משהו מפוצץ)\nומצד שני צריך לדעתי יותר משבוע כדי ללמוד מאפס (עבור סטודנט ממוצע), משהו כמו שבועיים אם לא רואים אף הרצאה ותרגול במהלך סמסטר - כמובן שזה אינדיבידואלי.\n\nהשורה התחתונה: סה\"כ קורס חביב, אפשרי בהחלט להוציא ציון טוב, לפתור שאלות מהמאגר רק כדי להתרענן קצת על המושגים ואז לעבור לפתור רק מבחנים, יש מספיק.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: שרון מוקלט\nחוות דעת - הרצאות: לא ענייניות כל כך בהקלטות, ב-10 דקות הראשונות מעבירה חומר ואז יש דיון כיתתי של שני אנשים שאת שמם לא אזכיר (אתם תדעו טוב מאוד על מי אני מדבר).\nמדי פעם כדאי להקשיב כי יש שאלות במבחן שתלויות בדברים שהיא אומרת בהרצאה.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: סופר נחמדה ומדברת תכלס איך לפתור שאלות.\nבכל אופן לקראת המבחן ראיתי שוב את התרגולים המוקלטים של גל שגם הוא אחלה.\n\nשעורי הבית: אין\n\nהמבחן: אם השקעתם במהלך הסמסטר (עשיתם משהו במהלך הסמסטר שקשור לללמוד כלכלה בין אם זה לראות מוקלט או לבוא פרונטלי) אני חושב ש4 ימים זה מספיק זמן כדי ללמוד למבחן.\nאם לא אז תפנו שבועיים מהחיים שלכם כדי ללמוד את כל הקורס ולקוות שהבנתם מה קורה.\nסך הכל המבחן דיי סבבה, אם לומדים נורמלי ולא זורקים אפשר לעקוץ אחלה ציון.\n\nלסיום ממליץ לכם לשיר את החמשיר הזה בלחן של טרנטולה של סטטיק ואגם בוחבוט:\n\nכל ה- כל ה- כל המשק אבטלה.\nאין יותר תעסוקה.\nמה שווה המס הזה אם אין לך סובסידיה?\nתייצא בשביל הרווחה,\nחולם על תעסוקה מלאה,\nכש-IS זז ימינה מה קרה?\nריבית עולה\nריבית עולה\nריבית עולה.\n\nמילים - אני והשותפה שלי\nלחן - עממי\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: שרון טייטלר-רגב (מוקלט)\nחוות דעת - הרצאות: אחלה.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: אני הלכתי לתרגולים לאורך כל הסמסטר. בהתחלה הצלחתי להתמיד בצפייה בהקלטות של ההרצאות ובאמת הצלחתי לקלוט קצת דברים בתרגולים אבל בחלק השני, כשלא צפיתי בהרצאות כמעט ולא קלטתי כלום. מה שכן, אח\"כ בלמידה למבחן, נזכרתי בכל מיני דברים שנאמרו בתרגול שהתחברו ועזרו.\n\nשעורי הבית: ללא.\n\nהמבחן: הוגן, יחסית לא מעט שאלות ממוחזרות.\nבעיקרון מהרגע שמסיימים לראות את כל ההקלטות (ממליץ הרצאות ותרגולים) ארבעה ימים (גג חמישה) של תרגולים ופתירת מבחנים אמורים להספיק. בהתחלה ניסיתי לפתור על בסיס הקשרים בין המשתנים והמשוואות אבל זה לא באמת תופס וצריך להבין את התאוריה ואז זה הרבה יותר קל.\n\nהשורה התחתונה: אפשר להזניח לכל אורך הסמסטר בהינתן שיש שבוע לפני המבחן שאפשר להשקיע בהקלטות ופתירת תרגילים. לא מספיק רק להציב במשוואות צריך גם להבין מה עושים. בהינתן שני אלה אפשר להוציא ציון גבוה מאוד בהשקעה יחסית לא גדולה לכמות הנק\"ז.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "חוות דעת - הרצאות: לא הייתי, ניסיתי לראות את המוקלטים אבל הדיונים האינסופיים ו-3 שעות הרצאה זה יותר מדי.\nבתכלס? יכולים לדחוס את השיעור לשעה ורבע, משום מה אבל חושבים שאם ימלאו חצי מההרצאה עם דיונים עם סטודנטים זה יעזור להבנה. ספוילר: זה לא. תפסיקו לבלבל תשכל ותלמדו תכלס, לא באתי להיות כלכלן, כולה רוצה לסגור תתואר.\n\nשם המתרגל/ת: גל דנינו מוקלט\nחוות דעת - תרגולים: אחלה תרגולים, קצר, קולע ולעניין. עדיף להבין באופן כללי מה עשו בהרצאה לפני. בלי קשר הוא גם בחור סופר נחמד.\n\nשעורי הבית: אין. יש תרגילי רשות אבל אל תעשו אותם.\n\nהמבחן: אם באים מוכנים המבחן קליל מאוד. בניגוד לרוב השאלות במאגר שהן חישוביות, השאלות במועדים האחרונים יותר מתבססות על הבנה - אבל בקטע טוב, אין טעויות חישוב וההבנה הנדרשת היא בסיסית ולא מורכבת.\n\nהשורה התחתונה: קורס קליל. קחו מתכון ממני אליכם איך להוציא מעל 90:\n- במהלך הסמסטר תעקבו בחצי העין אחרי החומר שלא תצטרכו ללמוד מאפס לקראת המבחן.\n- תפתרו 30 שאלות במאגר ממיקרו ו-30 במקרו (נשמע הרבה, בפועל יקח לכם יומיים בלחץ).\n- תפתרו 6-8 מועדים מהשנים האחרונות ותבינו את הקונספט.\n- ???\n- ציון מעל 90 בום!\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: שרון טייטלר-רגב\nחוות דעת - הרצאות:\nהייתי ברוב ההרצאות במהלך הסמסטר אבל הקשבתי בחצי אוזן. ההרצאות היו די משעממות אז עשיתי גליונות או הייתי בטלפון, וחשבתי שאני אספוג מספיק בשביל להשאר על החומר. בפועל היו הרבה מושגים שברגע שהיא הסבירה, היא השתמה רק בראשי תיבות שלהם ולא בשם עצמו, ואני שלא ממש הקשבתי לא הייתי מסוגל לעקוב יותר כי פשוט לא הבנתי את המילים שהיא אומרת.\nבדיעבד הייתי צריך בשלב הזה כבר לוותר ולחסוך את ה3 שעות השבועיות האלה.\nבכללי ההרצאות מאוד פרוסות, היה אפשר בקלות לצמצם את החומר לשעה שבועית אחת וזה היה ממש מספיק. ממליץ לוותר על ההרצאות.\n\nשם המתרגל/ת: גל דנינו מוקלט.\nחוות דעת - תרגולים:\nלא הייתי בתרגולים במהלך הסמסטר אבל לקראת הסוף התחלתי להשלים את החומר מהתרגולים של גל. הקלטות סבבה לגמרי, אם כי בעיקר תרגילים חישוביים בניגוד למבחן שבו השאלות יותר תאורטיות. בכל זאת אני חושב שזה הכין אותי טוב להתחלה של הלמידה למבחן.\n\nשעורי הבית: אין\n\nהמבחן:\nאני יודע שזה נשמע טיפשי, אבל אם מבינים את החומר אז המבחן באמת בדיחה. הרמה לא עוברת משוואות בנעלם אחד או איך שינוי של משתנה אחד משפיע על שאר המשתנים. גם יש דף נוסחאות מעולה שהיה קלאץ' בכל הקטע ה\"מתמטי\".\nעם זאת, הרגיש לי שאם לא באמת מבינים את הסיבה שהדברים קורים בצורה מסויימת ומנסים לזכור על \"יבש\" אז הרבה דברים לא אינטואיטיביים ויש הרבה שאלות שאפשר בקלות לטעות בהם. ככה הגעתי למועד א והוצאתי 75.\n\nלגבי הכנה למבחן, לפני מועד א לא היה אוסף מסודר של מבחנים עם תשובות ככה שנאלצתי לתרגל בעיקר מהמאגר (אוסף של מלא שאלות), וזה לא אידיאלי כי השאלות שם בעיקר חישוביות.\nכשהתחלתי להתכונן למועד ב ישבתי לסדר את כל המבחנים עם התשובות אליהם, ותרגול של מבחנים היה סופר אפקטיבי. תוך שלושה מבחנים בערך כבר קלטתי את רוב הרעיונות והתחלתי לענות על הכל נכון, מקסימום תשובה אחת לא נכונה פה ושם. בקיצור, אפשר לתרגל מהמאגר בקטנה בשביל להתרגל לנוסחאות אבל לעבור כמה שיותר מהר למבחנים. אני אעלה הכל בהזדמנות ל study buddy ככה שאמור להיות סבבה לדורות הבאים.\n\nהשורה התחתונה:\nקורס קליל ביחס לנק\"ז, אבל כן דורש השקעה כלשהי להבנה של החומר. אבל לימדתי חבר כמעט מ-0 את כל החומר תוך כדי שפתרנו מבחנים תוך כמה ימים אז אני חושב שכל אחד מסוגל להשיג ציון טוב.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר קיץ 2023",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: שימו לב שכשחובב מעביר את הקורס, המבנה שלו שונה. ההבדלים העיקריים הם:\n\n1. מבחן עם חומר פתוח, שונה לגמרי במבנה שלו מסמסטרים בהם חובב לא מעביר את הקורס.\n\n2. ההרצאות מאוגדות עם התרגולים (בממוצע 3 שעות שבועיות)\n\nחובב מרצה מצוין ומעביר את החומר בצורה טובה מאוד. השילוב של התרגול בהרצאה מוכיח את עצמו כמוצלח, כי לומדים נושא וישר מתנסים בשאלות.\n\nשם המתרגל/ת: חובב פרץ (ראה למעלה - לא היו תרגולים בקיץ)\nשעורי הבית: 4-5 שאלות ממבחנים בכל שבוע. לא חובה, עוזה להבנה ולא מאוד מציק.\n\nהמבחן: 20 שאלות אמריקאיות עם חומר פתוח, כך שבכל שאלה, התשובה האחרונה היא תמיד: \"אין תשובות נכונות, או שיש יותר מתשובה אחת נכונה\". (אם הבנתם שתשובה א' נכונה, עדיין צריך לבדוק את ב' וג', כי לפעמים גם אחת מהן תהיה נכונה).\n\nמומלץ להדפיס טיפים לכל שאלה, אבל בלי הבנה של החומר זה לא יעזור. המבחן הזה לא רק חישובי (במיוחד חמש השאלות האחרונות שלו)\n\nהשורה התחתונה: קורס מאוד מעניין, מלמד נושאים חשובים שאנשים שלא עושים תואר עם נגיעות בתחום לא מכירים לפני כן, ולא מאוס עמוס. אפשר לקבל ציון טוב, גם בקיץ.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר קיץ 2023",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: טובות ומעניינות ובזום\n\nחוות דעת - תרגולים: היו משולבות עם ההרצאות ובמקום שהיה לנו 4 שעות שבועיות (2 שעות הרצאה + 2 שעות תרגול), היה לנו רק שעתיים שהרצה בהן ותרגל... פשוט אלוף.\n\nשעורי הבית: אין. בעצם יש אבל לא הכרחיות, אבל הם מתוך מבחנים קודמים ולכן ממש כדאי לפתור.\n\nהמבחן: נורא ואיום למי שמזלזל בקורס הזה בקיץ. שימו לב זה ממש לא אותו קורס שמועבר בחורף/אביב, שם קהל היעד הם אני אנשים לא מתחום הכלכלה, אלא שבקיץ קהל היעד הם כלכלנים. אם מקשיבים למרצה במהלך הסמסטר ועם שבוע למידה אפשר להוציא 90+. לצערי שבאותו זמן אנשים מקבלים ציון דומה רק עם 5 ימי למידה למבחן בסמסטרי החורף/אביב ועם 0 הכנה במהלך הסמסטר. אל תקנו סטאדיז, רק להקשיב להרצאות של המרצה, חבל לכם על הכסף!!!\n\nהשורה התחתונה: לא הייתי ממליץ לקחת בקיץ אם מערכת המבחנים שלכם עמוסה או אם בא לכם סתם באס...\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: דר. טייטלר- רגב שרון\nחוות דעת - הרצאות:\nהרצאות של 3 שעות שזה מיותר לדעתי. קרה הרבה שסיימו מוקדם.\nחלק מהן היו משעממות וחלק מהן היה מרתק.\nהחומר עצמו שצריך לדעת אותו למבחן הוא תיאורטי מדי ומשעמם.\n\nשם המתרגל/ת: ההקלטות של גל\nחוות דעת - תרגולים:\nמתרגל מצויין סידר לי הרבה עניינים, אישית. הוא מתמקד הרבה בלהסביר את החומר ונותן אינטואיציה (לפחות בהקלטות). שזה חשוב יותר מפשוט לפתור שאלות כי בסופו של דבר זה לוקח 2-5 דקות *בלחץ* לפתור שאלה בקורס הזה לדעתי.\n\nשעורי הבית:\nאין\nהמבחן:\nאם מבינים את הנושאים ואיך הדברים עובדים ולא רק משננים, אתם תוציאו 90+ בקלות. הממוצע אצלנו היה 85. כפי שציינו פה אנשים, אל תתרכזו במאגר כל כך הרבה. תפתרו כמה שאלות מהמאגר כדי לתרגל את החומר טכנית ואז תנסו לעבור למבחנים.\n\nהשורה התחתונה: קורס קליל. לא הכי כיפי. רובם לוקחים אותו בשביל להעלות את הממוצע. יש כמה נושאים מעניינים אבל לרוב הוא משעמם. צריך הרבה הבנה ולא רק לשנן. המבחנים חוזרים על עצמם (יש שאלות שבהן רק משנים את המספרים ממועד למועד וזהו), ואם לא, אז יש בדיוק את אותם הרעיונות כך שמספיק לפתור 6-9 מבחנים (וזה לא לוקח זמן). בסהכ הקורס והמבחן לא דורשים השקעה לדעתי לפחות בסמסטר חורף/אביב\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: ראיתי את כולן על כפול 2 בערך שבוע לפני המבחן, לא תרם הרבה\n\nשם המתרגל/ת: לא ראיתי\nשעורי הבית: אין\n\nהמבחן: פשוט לפתור כמה שיותר שאלות מהמאגר ומבחני עבר, ההרצאות/ תרגולים לא תורמים במיוחד\n\nהשורה התחתונה: אחלה קורס אם לומדים טוב, אפשר לקבל ציון גבוה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: שרון (מוקלט)\nחוות דעת - הרצאות: ההרצאות לא עקביות, המונחים לא מוגדרים היטב, אפילו השמות לא עקביים בין ההרצאות והתרגולים. זה מתמטיקה ברמה של כיתה ט' שאיכשהו הצליחו לסבך, אולי כי לא רצו שהקורס יהיה קל מדי. בדיעבד אני קצת מתחרט שלא לקחתי את הקורס הזה שדיברו עליו במקום לסבול מול ההקלטות. שלא לדבר על הכמה חפרנים שם שטעו לחשוב שכל הרצאה היא שיעור פרטי.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: היא אחלה, והשאלות כן דומות למה שרואים במבחן. למעשה במבחן הן אפילו פחות חישוביות.\n\nשעורי הבית: אין\n\nהמבחן: הוגן, שם דגש על שאלות הבנה ולא חישוביות, ולפי דעתי זה בא לטובת הסטודנט. פתרתי את כל החלק של מאקרו נכון, ובלי לחשב שום דבר. ברגע שבאמת מבינים את המודל המשולב ו-ISLM, אפשר לפתור כל שאלת מאקרו בשניות.\n\nהשורה התחתונה: לקחתי את הקורס כדי ללמוד כלכלה, ולא מרגיש שלמדתי יותר מדי חוץ מאיך להציב בנוסחאות. אבל הציונים טובים.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: שרון (הקלטות)\nחוות דעת - הרצאות: בדיעבד הן לא חובה. אם אתם סבבה עם לקרוא סיכומים זה מספיק ואפילו זה ספק אם חובה. יש המון דיבורים בהקלטות לכן זה קצת בזבוז זמן אבל אישית נהניתי.\n\nשם המתרגל/ת: גל דנינו\nחוות דעת - תרגולים: חשובים ואף חובה. גל אחלה מתרגל, מסביר ברור.\n\nשעורי הבית: אין\n\nהמבחן: מבחן הוגן ואפילו די צפוי. אחרי שראיתי את ההקלטות של ההרצאות במשך הסמסטר עשיתי יום מרתון תרגולים ועוד יום וחצי של מבחנים וזה הספיק. בהתחלה מרגיש קשה אבל אחרי כמה מבחנים כבר מכירים פחות או יותר את כל הסוגי שאלות האפשריים.\n\nהשורה התחתונה: קורס קליל ובעיניי גם מעניין. אחלה דרך להעלות ממוצע במינימום השקעה. מומלץ ++++++\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: לא ראיתי\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים:\nסבבה\nשעורי הבית:\nאין\nהמבחן:\nבאתי יום אחרי מתמ, לא בפוקוס. ובהתאם, הנכשל הראשון שלי בתואר.\nהשורה התחתונה: ילדודס תעשו טובה אל תיכשלו בכלכלה. תלמדו טוב את הסיכום\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: ההקלטות של ההרצאות לא יעילות, מבולגנות ועם סטודנטים שחושבים שזה בסדר לעכב את כל הכיתה על כל דבר קטן. לאחר 2 שיעורים החלטתי לקנות קורס חיצוני שהרבה המליצו עליו בקבוצה. המרצה שם עילוי וחסך לי המון שעות שאין לי.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: לא יצא לי לבדוק אבל אמרו שהיא טובה.\n\nשעורי הבית: אין שיעורי בית או עומס בקורס.\n\nהמבחן: הרבה יותר תיאורטי ופחות חישובי ממה שחשבתי. אמרו שזה שינוי שנכנס שנה שעברה. זה לא מספיק רק לפתור שאלות ממבחנים. צריך ממש להבין את החומר (דרך תרגולים, הרצאות או קורס חיצוני) ורק אז לגשת לשאלות אחרת זה לירות באפלה.\n\nהשורה התחתונה: קורס שהוא הזדמנות מצוינת להעלות את הממוצע אך קצת פחות אטרקטיבי ביחס לשנים קודמות בגלל השינוי במבנה המבחן. זה לא walk in the park. עדיין ממליצה לקחת.\nקורס חיצוני יעיל פה מאוד מבחינת זמן והבנה. התרגולים אמורים להיות טובים. ההרצאות זה בזבוז זמן.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "ספוילר: חוות הדעת הזאת תישמע כמו פרסומת אבל היא כנה.\n\nשם המרצה: חובב פרץ בקורס קיץ וניר חן מ-studies בקורס אביב.\n\nלא להעז לקחת את קורס הקיץ עם חובב. מבחן שהוא 10 רמות מעל קורס האביב. למדתי את זה על בשרי עם נכשל.\nבקורס אביב הוצאתי 100.\n\nהמבחן: מתמטיקה של כיתה ה' אבל כן דורש הבנה תיאורטית בשביל להצליח. לפתור רק תרגילים ולנסות דרך זה לספוג את התיאוריה זאת אסטרטגיה גרועה. לכן צריך לצפות בהרצאות.\nבהקשר הזה ממליץ לצפות בניר חן. גם מרצה בחסד וגם קלע לחצי מהשאלות במבחן. פשוט לסכם את כל הכללים שהוא מדגיש בירוק, לפתור את התרגולים אצלו ואז סימולציות של כמה מבחנים וזה מספיק. לא צריך יותר מ-6 ימי למידה מרוכזים.\n\nהשורה התחתונה: קורס שמקפיץ את הממוצע אם לא לוקחים אותו בקיץ. לא צריך להשקיע לאורך הסמסטר. תודה לניר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות:\nלא הלכתי\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים:\nהלכתי רק לראשונים. לא כל כך הבנתי ייתכן כי לא הלכתי להרצאות\n\nשעורי הבית: אין\n\nהמבחן:\nלא קל כמו שכולם אומרים. וכן דורש השקעה\nללמוד את הסיכום ולהבין את הבסיס\nלפתור כמה שאלות במאגר (לא צרין יותר מ 30 )\nולהתמקד במבחנים. להבין איך פותרים כל שאלה כי זה חוזר על עצמו.\n\nהשורה התחתונה:\nדורש השקעה אבל כן ב 8 ימים מ 0 אפשר לקבל 100\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "למדתי למבחן מאפס ב9 ימים בעזרת הקורס של סטאדיס וחוות הדעת שלי מבוססת על זה\n\nהרצאות: סטאדיס\nהקורס של סטאדיס מסודר מאוד, ומכיל כמעט את כל החומר שלומדים בקורס בטכניון.\nהחומר שחסר בסטאדיס וצריך להשלים לבד:\nבנושא של תורת היצרן - חסר פונקציית ייצור ופונקציית הוצאות, חוק התפוקה השולית הפוחתת, MPL, VMPL.\nבנושא של המודל המשולב ISLM - בסטאדיס מלמדים אותו בצורה ממש טובה וברורה אבל קצת שונה מאשר בקורס שלנו ולא מסבירים באופן מפורש על הגרף שמכיל את עקומות IS ו- LM.\nבאופן כללי הקורס של סטאדיס ברמה גבוהה, בערך חצי מהסרטונים הם הסברים תאורתיים והחצי השני זה פתרון תרגילים שחלקם חשיבתיים ומאוד דומים לשאלות בבחינה עצמה וחלקם יותר טכניים. למי שקצר בזמן - אפשר דלג על חלק מהתרגילים הטכניים שסתם מחשבים בהם שוב ושוב את אותו הדבר, במבחן עצמו בקושי יש חישובים וזה פחות רלוונטי.\n\nשם המתרגל/ת: גל דנינו מוקלט\nחוות דעת - תרגולים:\nאחרי שצפיתי בסטאדיס עברתי גם על התרגולים המוקלטים של גל כדי להשלים את הנושאים החסרים וכדי לוודא שלא פספתי כלום ושכל הנושאים יושבים טוב. גל מתרגל טוב ולדעתי אם יש זמן כדאי להסתכל גם על התרגולים שלו.\n\nשעורי הבית: אין\n\nהמבחן:\n20 שאלות אמריקאיות כל אחת 5 נקודות.\nבכל מועד בערך 3-4 שאלות חדשות ויותר מאתגרות שכדי לפתור אותן צריך להבין את החומר ברמה קצת יותר עמוקה. חוץ מזה שאר השאלות ממוחזרות ממבחני עבר או לקוחות מהמאגר שמפורסם במודל.\n\nהשורה התחתונה:\nמבחינה חשיבתית ומתמטית זה קורס ברמת קושי של תיכון, החומר קליל ויחסית מעניין. אם לומדים ברצינות אפשר תוך שבוע וחצי להספיק ללמוד את הקורס מ-0, לתרגל 10 מבחני עבר ולהפציץ בבחינה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: שרון רגב טייטלר\nחוות דעת - הרצאות: מרצה סבבה ומסבירה טוב, אבל אני לא כל כך הצלחתי להתרכז בהרצאות במהלך הסמסטר, לא יודע למה המשכתי ללכת. תראו הקלטות (הן אמנם שעתיים וחצי אבל אם צופים על כפול 2 + מדלגים על הפסקות + מדלגים על חפירות אקטואליות כל הרצאה היא שעה וחצי גג) עם סיכום ליד - זה הרבה יותר אפקטיבי.\n\nשם המתרגל/ת: איילת קוגוס + גל דנינו מוקלט\nחוות דעת - תרגולים: איילת ממש נחמדה לכולם ותמיד באה עם חיוך, מסבירה טוב אבל קצת מהר לדעתי. גל ראיתי לקראת המבחן. מעביר את החומר מצוין, נותן אינטואיציה ממש טובה ולדעתי ממש עוזר בלהפנים את החומר - מומלץ.\n\nשעורי הבית: אין.\n\nהמבחן: לא הלכתי למועד א׳ כי לא הייתי מוכן בשיט + זה היה יום אחרי מבחן אחר. לקראת מועד ב׳ היה לי המון זמן ללמוד, למדתי בערך שבועיים וקצת (שבוע ראשון ראיתי הקלטות, שבוע שני תרגלתי). אבל אני מרחתי את זה ממש, לגמרי אפשר ללמוד למבחן בשבוע או אפילו פחות. קחו לכם יומיים-שלושה ימים לעבור על נושאים שאתם לא מבינים בהקלטות, יום-יומיים לפתור שאלות מהמאגר להבין איך משתמשים בנוסחאות ולהיסגר על המושגים (תפתרו רק מהשאלות עם הפתרון המלא), ועוד יומיים-שלושה לפתור 6+ מבחנים ואתם מסודרים.\n\nהשורה התחתונה: קורס שבמהלך הסמסטר הרגשתי ״מה לעזאזל אני עושה פה?״, ולקראת המבחן גיליתי שהוא דווקא סבבה. מומלץ.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "חוות דעת - הרצאות: לא צפיתי\n\nחוות דעת - תרגולים: לא צפיתי\n\nשעורי הבית: אין\n\nהמבחן: למדתי מאפס מאתר gool (יש קופון לזה מהטכניון) ואחרי זה פתירת שאלות ממאגרי השאלות במודל ובסוף פתרתי מבחני עבר\nאת כל זה עשיתי ב כ - 10 ימים.\nהמבחן היה כרגיל רובו שאלות שהרעיון שלהם חוזר על עצמו יש 2-3 שאלות חדשות ומאתגרות יותר.\n\nהשורה התחתונה:\nמומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: ניר חן מסטאדיס\nחוות דעת: לא היה לי זמן באמת להשקיע לאורך הסמסטר בגלל מילואים. קניתי את סטאדיס והקדשתי 6 ימים למבחן. 4.5 ימים צפייה בסטאדיס ועוד 1.5 סימולציות של מבחני עבר. הוצאתי 88 ואני בסדר עם זה.\n\nהמבחן: היה שונה ביחס לשנים קודמות. לא מיחזרו שאלות, הרוב היה תיאורטי/הבנתי ופחות חישובי.\n\nהשורה התחתונה: לא קורס קשה בכלל. אם השקעה לאורך הסמסטר אפשר לשאוף ל-100. לדעתי החומר עצמו די מעניין.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "חוות דעת - הרצאות: שרון מוקלט\nהרבה מאוד דיבורים לא רלוונטים, לדלג על קטעים כאלה.\nחוץ מזה, ההרצאות טובות ונותנות בסיס טוב מאוד של הבנת החומר\n\nשם המתרגל/ת: אין לא ראיתי\nחוות דעת - תרגולים: אין לא ראיתי\n\nשעורי הבית: אין\n\nהמבחן:\nשמעו חברים, אל תהיו שאננים מידי, צריך ללמוד טוב את החומר הזה כדי להצליח וזה לא מאוד פשוט לקבל 100 כמו שאומרים. בהתחלה אתם תתחילו ללמוד ותהיו קצת בהלם,\nאבל ברגע ששולטים בחומר, מתרגלים בכמויות, אפשר להוציא 100.\nהשורה התחתונה:\nלא חובה להיות נוכח בסמסטר אבל תנו לזה לפחות שבוע אם ככה בתקופת מבחנים של שינון, צפייה בהרצאות, תרגול מבחנים באיזור 8-9 אמור להספיק. וככה תקבלו 100 :)\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות:\nהרצאות לא טובות. שרון לא מאמינה בלכתוב את ההגדרות אז אין אותם בצורה מסודרת.\nאני בסוף קניתי מSTUDIES קורס וראיתי אותו במקום. הוא מאוד מומלץ ומעביר את החומר מעולה. הייתי מתחיל לראות אותו עוד במהלך הסמסטר בשביל לא להתקע עם זה לתקופת מבחנים.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים:\nהיא סה\"כ סבבה.\nשעורי הבית: אין\n\nהמבחן:\nיש בונוס 6 נקודות על נוכחות של מעל 80% בהרצאות ותרגולים.\nהשורה התחתונה:\nקורס מעלה ממוצע אבל לא קורס שאפשר להכחיש.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שרון\nשם המתרגל/ת: לא יודע\nשעורי הבית: אין\n\nהמבחן: צריך לעשות כמה מבחנים, בסופו של דבר מסתכם לאיזה שלוש משוואות לינאריות ולדעת לצייר את גרף ההיצע והביקש\n\nהשורה התחתונה: קורס קל שאפשר להשלים בחמישה ימים כולל למידה למבחן, חומר יחסית מעניין. קורס נחמד וקל.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות:\nעל הפנים, ממש גרועה, מלמדת כל כך משעמם.\nהשילוב של קומה 2 באולמן והחוסר רלוונטיות של שרון ממש נותן throwback לשנות ה80, אם אתם בעניין של נוסטלגיה תגיעו להרצאות אחרת חבל על הזמן.\n\nחוות דעת - תרגולים:\n\nבמהלך הסמסטר לא הלכתי, לפני המבחן ראיתי את התרגולים של גל דנינו על 1.5 היה דיי אחלה.\n\nשעורי הבית:\nרשות\nהמבחן:\nהוצאתי 90 ולמדתי את כל הקורס בשבוע, אין לי שמץ של מושג מה למדתי והידע שלי בכלכלה לפני הקורס ואחרי נשאר אותו דבר או אפילו ירד אחרי הקורס הזה.\nהמבחן ממוחזר משאלות מאגר + שאלות ממבחנים.\nהשורה התחתונה:\nמעלה ממוצע מוריד IQ.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "חוות דעת - הרצאות:\nממליץ יחסית להגיע, מקבלים בונוס של 6 נקודות אם מגיעים למספיק הרצאות ותרגולים ומוריד עומס משמעותית מתקופת מבחנים. מה שכן 70% מהזמן בהרצאות לא רלוונטי כל כך\n\nשעורי הבית: אין\n\nהמבחן: בניגוד למה שאומרים זה כבר מזמן לא כזה קורס מתנה, ואם לא מקשיבים לאורך הסמסטר זה נהיה לא קל בכלל. יש מועדים ממוחזרים ממש(שלנו היה 70% ממוחזר ולכן קיבלתי בו 95), ויש מועדים שהרבה פחות ולא קלים, מבחן שתרגלתי ביום האחרון ללמידה הוצאתי לא הרבה יותר מעובר . מועדי ב גם לדעתי קצת יותר קשים ממועדי א. תחרשו מבחנים כי זו הדרך הכי טובה להתכונן, ואם אתם לוקחים את הקורס כדי להעלות ממוצע זה עדיין קורס טוב לזה אבל כנראה כבר לא הבחירה הכי טובה כמו שהוא היה פעם.\n\nהשורה התחתונה: אם זה בחירה תחשבו קצת לפני, קורס לא קשה אבל לא הייתי רץ\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "איך ללמוד מאפס בשבוע:\nאם לומדים מהסטאדיס (אני עשיתי ככה ,בדיעבד אפשר לגמרי בלעדיו אם רואים את כל התרגולים לפי הסדר) - לראות בX3 , לדלג על כל התרגילים , לא לראות את החלק של המאקרו שהוא מועבר בצורה שונה מהקורס (תשלימו ע''י ההקלטות של התרגולים, מספיק מעל ומעבר).\nתדלגו על השאלות מהמאגר וישר תלכו למבחנים, אחרי 7 אתם כבר אמורים להיות מוכנים לגשת.\n\nהמבחן:\nהשאלות ממוחזרות ממועד ומועד ואין הפתעות.\n\nהשורה התחתונה:\nלגמרי אפשר להכחיש ולגשת רק למועד ב' בהנחה שיש לפחות 5 ימים פנויים ללמוד למבחן, סתם אנשים מלחיצים כאן שזה כבר לא קורס מתנה.\nממליץ .\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: נא לא ללכת\nחוות דעת - הרצאות: בספק אם הצוות לקח קורס מבוא להוראה.\nלא הבנתי מילה בפעמיים שהלכתי וניסיתי להקשיב ולא לישון\n\nשם המתרגל/ת: כנ\"ל\nחוות דעת - תרגולים: כנ\"ל\n\nשעורי הבית: אין\n\nהמבחן: קורס מתנה שמנוהל על ידי צוות שלא ממש יש לו מיומנות ללמד ולעשות מחומר הלא מעניין משהו מעניין\n\nהשורה התחתונה:\nמתכון לקבל 100: להכחיש בסמסטר ולהשקיע בקורסים הרלוונטים והחשובים בפקולטה שלכם, להקדיש שבוע של למידה למבחן , לקרוא את הסיכום (של ה 200+ דפים) (לי לקח 5) , ואז לפתור מבחנים (פתרתי 4), לא לפתור מהמאגר אם יש לכם מעט מדיי זמן!! כי השאלות שם יותר טכנייות מאשר תאורתייות (המבחן בשנים אחרונות יותר \"תיאורתים\") , לוודא שיודעים איך להשתמש בדף הנוסחאות וחשוב מכך: איך מזיזים העקומות בהתאם לנתונים בשאלה.\nבזמן פתירת מבחנים לוודא שאתם מפסילים שאר התשובות ולא רק להקיף תשובה נכונה , וזה במיוחד אם היה לכם רק 3 ימים כמוני לפתירת מבחני עבר\n\nהערה:\nה\"מומלץ מאוד\" מטה, רק בגלל שזה מעלה ממוצעים :)\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: שרון\nחוות דעת - הרצאות: הלכתי רק בגלל בונוס נוכחות. המרצה נחמדה והכל אבל הרבה פעמים נכנסת לסיפורים, במיוחד בסמסטר הזה היה סטודנט שלא הפסיק לחפור והרבה מהשיעור התבזבז. תחינה למי שלוקח את הקורס, בבקשה תזכרו שאתם לא בשיעור פרטי ותחסכו מכולנו.\n\nשם המתרגל/ת: איילת\nחוות דעת - תרגולים: רצה בספרינט, שעה של תרגול לא מספיקה בכלל וזה ממש הורגש לא הצלחתי לעקוב אחריה ויצאתי מיואשת מכל תרגול.\n\nשעורי הבית: אין\n\nהמבחן: במועד א' למדתי מסטאדיז ובפועל זאת הייתה טעות. זה אחלה קורס לקבל הבנה אבל(!) השאלות תרגול שם מאוד חישוביות וזה ממש לא הסגנון שאלות של הקורס. אם הכחשתם את הקורס במהלך הסמסטר כן שווה לרכוש אותו אבל אל תתעקבו על התרגול שם אלא תלכו ישר למאגר, גם סטאדיז מלמד את מאקרו שונה לגמרי אז אולי אפילו שווה לכם ללמוד את זה מתרגולים/הרצאות. מועד א' קיבלתי 61 כי כמו שאמרתי בזבזתי יותר מדי זמן על סטאדיז והספקתי לתרגל רק מבחן 1, במועד ב' שהיה משמעותית יותר קשה קיבלתי 100 אחרי שעשיתי איזה 6 מבחנים ועשיתי את כל השאלות שאנשים שלחו בקבוצה.\n\nהשורה התחתונה: אחלה קורס להעלאת ממוצע, תתרגלו מספיק מבחנים תהיו בסדר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nאביב 2025       א' 79  ב' 85  סופי 85  טייטלר- רגב שרון\nחורף 2024-2025  א' 75  ב' 79  סופי 81  טייטלר- רגב שרון\nאביב 2024       א' 81  ב' 81  סופי 84  טייטלר- רגב שרון\nחורף 2023-2024  א' 84  ב' 84  סופי 87  טייטלר- רגב שרון\nקיץ 2023        א' 72  סופי 80  פרץ חובב\nאביב 2023       א' 83  ב' 82  סופי 87  טייטלר- רגב שרון\nחורף 2022-2023  א' 77  ב' 77  סופי 80  טייטלר- רגב שרון\nקיץ 2022        א' 64  ב' 66  סופי 70  פרץ חובב\nאביב 2022       א' 80  ב' 78  סופי 82\nחורף 2021-2022  א' 80  ב' 79  סופי 82\nקיץ 2021        א' 79  ב' 78  סופי 80\nאביב 2021       א' 80  ב' 88  סופי 88\nחורף 2020-2021  א' 81  ב' 81  סופי 85  טייטלר- רגב שרון\nקיץ 2020        א' 81  ב' 78  סופי 81\nאביב 2020       א' 83  ב' 81  סופי 84  טייטלר- רגב שרון\nחורף 2019-2020  א' 81  ב' 74  סופי 80\nקיץ 2019        א' 83  ב' 82  סופי 86  קוגוס איילת\nאביב 2019       א' 81  ב' 80  סופי 83  טייטלר- רגב שרון\nחורף 2018-2019  א' 75  ב' 77  סופי 79  סמורודינסקי רן\nקיץ 2018        א' 88  ב' 73  סופי 82  קוגוס איילת\nאביב 2018       א' 75  ב' 86  סופי 84  רגב-טייטלר שרון\nחורף 2017-2018  א' 79  ב' 76  סופי 80  רגב-טייטלר שרון\nקיץ 2017        א' 82  ב' 89  סופי 87  קוגוס איילת\nאביב 2017       א' 75  ב' 72  סופי 77  סמורודינסקי רן\nחורף 2016-2017  א' 77  ב' 75  סופי 79  טייטלר- רגב שרון\nקיץ 2016        א' 79  ב' 84  סופי 83  קוגוס איילת\nאביב 2016       א' 79  ב' 70  סופי 77  רגב-טייטלר שרון\nחורף 2015-2016  א' 78  ב' 69  סופי 75  קוגוס איילת\nאביב 2015       א' 72  ב' 74  סופי 76  קוגוס איילת\nאביב 2014       א' 70  ב' 69  קוגוס איילת\nאביב 2013       א' 76  ב' 75  סמורודינסקי רן\nחורף 2012-2013  א' 71  ב' 71  סמורודינסקי רן\nאביב 2012       ב' 73  סמורודינסקי רן\nחורף 2011-2012  א' 71  ב' 65  סמורודינסקי רן\nסופי מועד א': 79\nסופי מועד ב': 85\nסופי: 85\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n274 267 7 97 20 100 85.726 90\nאיש סגל תפקיד\nטייטלר- רגב שרון מרצה - אחראי מקצוע\nקוגוס איילת מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}