{
  "course_id": "096600",
  "scraped_at": "2025-12-16T13:40:17.319558",
  "information": {
    "raw_text": "00960600 - התנהגות ארגונית\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nמודלים וכלים לניתוח התנהגות אישית במסגרות ארגוניות. תהליכים אירגוניים בשלוש רמות: רמת הארגון (הארגון כישות בסביבת ארגונים אחרים ואילוצים שונים), רמת הקבוצה (מחלקות, יחידות, וועדות) ורמת הפרט (העובדים בארגון) המשפיעים על איכות הניהול והייצור . הנושאים כוללים: מבואליסודות הגישה המדעית לניהול והתנהגות ארגונית, מבנים ארגוניים ותרבות ארגונית, יסודות לניהול משאבי אנוש, קבוצות וצוותים, כוח ומנהיגות, תפישה וקבלת החלטות והנעת עובדים.\n\nמקצועות קדם: 00950605\n\nמקצועות ללא זיכוי נוסף (מוכלים): 00980602\n\nמקצועות ללא זיכוי נוסף: 00900056\n\nאחראים: ד\"ר דנה הררי-חמם\n\nמועד א': 19-02-2026\nמועד ב': 19-03-2026",
    "title": "00960600 - התנהגות ארגונית"
  },
  "feedback": {
    "summary": {
      "text": "10 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "חוות דעת - הרצאות:\nהרצאות מעניינות, קלילות ומרצה מקסים. תמיד שם לסטודנטים ומשרה אווירה מצוינת.\nחוות דעת - תרגולים:\nחוזרים על החומר של ההרצאה עם יותר דוגמאות להמחשה. מתרגלות מעולות.\nשעורי הבית:\nיישומיים על החומר. לא קשים מידי ומעניינים.\nהמבחן:\nמייצג את החומר הנלמד, שאלות לא מתחכמות.\nהשורה התחתונה: קורס מעולה! ממומלץ עם המרצה אנדריי.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: אנדריי אלסטר\nחוות דעת - הרצאות: ההרצאות מעניינות אבל יש הרבה דוגמאות אז יש כאלה שיכולים לחשוב שזה בזבוז זמן קצת.\n\nשם המתרגל/ת: בת חן לינק\nחוות דעת - תרגולים: מקסימה ומעניינת, איכפתית. התרגולים מאוד קלילים והחומר מאוד פשוט.\n\nשעורי הבית: 4 תרגילי בית עם חלק משמעותי בציון. לוקחים זמן וצריך להשקיע כדי לקבל ציון טוב. הסוד הוא להקשיב ולכתוב את המשפטים שאנדריי אומר על השיעורי בית ולהתנסח בדיוק כמוהו.\n\nהמבחן: לא מאוד קשה ויש כמות חומר סבירה.\n\nהשורה התחתונה: קורס מעניין ועזר לי להין הרבה דברים בחיים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "חוות דעת - הרצאות:\nמרצה סימפטי ומעניין, לפעמים טיפה חוזר על עצמו בהרצאות (היה אפשר לקצר אותן כנראה) אבל הכל מתוך מטרה ליצור דיון מעמיק. העביר את החומר בצורה יפה, ברורה וטובה.\n\nחוות דעת - תרגולים:\nלא הלכתי לתרגולים, צפיתי ברצף לפני המבחן בהקלטות. לדעתי אפשר בכיף לעשות תרגול רק פעמיים בחודש, כי הם מאוד נמרחים ואפשר לעשות אותם יותר פרקטיים.\n\nשעורי הבית:\nהיו לאנשים מסויימים תלונות רבות על ההגשות, כי הן הגשות מילוליות וארוכות עם בדיקה קפדנית. באופן אישי אני קיבלתי ציונים טובים, צריך פשוט מאוד להשקיע בהם, לא לעגל פינות ולשים לב לכל פרט, וגם להקשיב טוב בהרצאות ולהערות שלו. חשוב להשקיע כי הש\"ב היו 50% מהציון.\nהמבחן:\nהיה מבחן הוגן מאוד, פשוט צריך לשנן הרבה חומר וזה הקושי העיקרי שנתקלתי בו בלמידה (כי אנחנו כמעט ולא משננים חומר בכזו כמות בתואר).\nהשורה התחתונה: קורס מעולה, עמוס אבל לא מידי, מומלץ.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "חוות דעת - הרצאות: 2 מאמרים לקריאה באנגלית במהלך הסמסטר, 3 שעות הרצאה לא עמוסה\n\nשם המתרגל/ת: בת חן\nחוות דעת - תרגולים: לא מחדשים יותר מידי אבל לא מזיק\n\nשעורי הבית: 5 מטלות להגשה במהלך הסמסטר, כמה שעות עבודה על כל מטלה (שאלות על החומר כ5 עמודים למטלה)\n\nהמבחן: לא נוראי, חצי אמריקאי חצי פתוח. האמריקאי מבלבל\n\nהשורה התחתונה: לא עמוס במיוחד, דיי דומה לשיווק ופסיכולוגיה\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: אנדריי\nחוות דעת - הרצאות: מעניינות, לא מעמיסות, ולא קשות\n\nשעורי הבית: יישום החומר בצורה מהנה (יישום על סצנות מהסדרה קופה ראשית)\n\nהמבחן: קליל, חצי פתוח חצי אמריקאי\n\nהשורה התחתונה: קורס מדהים ומעניין, ממש לא קשה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: דנה הררי\nחוות דעת - הרצאות: הרצאות קשות למעקב. באופן אישי היה לי מאוד קשה להקשיב לה, הרגשתי שהיא מלמדת בעיקר באוויר וקופצת מנקודה לנקודה. הבנתי את החומר רק בלמידה למבחן.\n\nשם המתרגל/ת: לטם\nחוות דעת - תרגולים: התרגולים לא מתניעים... עד תרגול 4 בערך עוד לומדים H0 שלמדנו בשלושה קורסים אחרים וזה פחות עוזר להתמודדות עם החומר. מה שכן התרגולים מוכוונים לעזרה בפרוייקט.\nהתרגולים לא חובה בכלל, רק מי שצריך/רוצה לפרוייקט.\n\nשעורי הבית: שיעורי בית מאוד מוזרים שעד עכשיו לא הבנתי (השתתפות בסקרי אישיות).\nמעבר לזה יש פרוייקט שהיה אצלנו 20%, כדאי להיעזר במתרגלות כדי להבין למה הם מכוונים כי אחרת קל מאוד לאבד נקודות.\n\nהמבחן: 40 שאלות אמריקאיות, סך הכל בסדר גמור, מקיף את החומר אבל לא בא להכשיל.\n\nהשורה התחתונה: החומר ממש מעניין, דרך הלימוד הייתה קצת יותר קשה להבנה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: דנה הררי\nחוות דעת - הרצאות: בניגוד לרוב הכיתה, אני נהנתי מהחומר וההרצאות היו לי נחמדות. דנה קצת חסרת ביטחון ולפעמים התבלבלה עם עצמה, אבל החומר מעניין והיא כן מעבירה אותו בצורה טובה.\n\nשם המתרגל/ת: לטם\nחוות דעת - תרגולים: התרגולים לא ממש חידשו דברים (זה הרבה חזרה על חומר שיודעים כבר מסטטיסטיקה), אבל כן עוזרים עם הפרויקט.\n\nשעורי הבית: אצלנו היו כמה מטלות:\n1) סקרים מוזרים על אישיות - 20% בחינם בעצם\n2) קריאת מאמר אקדמי (וכתיבת הערות) - 5%, לוקח זמן אבל סבבה\n3) פרויקט - 20%, קשה רק כי הבודקות לא מתואמות\n\nהמבחן: ממש סבבה, מתרכז בפרטים החשובים מההרצאות\n\nהשורה התחתונה: אחלה קורס בעיני, והממוצע הרבה יותר טוב מגורמי אנוש\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: דנה\nחוות דעת - הרצאות: מודה שלא הלכתי להרצאות והשלמתי אותן בבית (יש גם פודקאסטים שהיינו צריכים להקשיב להן במקום ובנוסף להרצאות). הייתי בשיעור הראשון ודנה נראית נחמדה מאוד.\n\nשם המתרגל/ת: עמית סקורניק וסתיו מוסל\nחוות דעת - תרגולים: לא נכחתי בתרגולים אז קשה לי להביע עליהן חוות דעת.\n\nשעורי הבית: עם הפרויקט, הבחנים, הסקרים, השאלונים והניסויים הקורס עמוס סך הכל. חלק מהשאלונים נורא ארוכים אבל הבחנים והניסויים הוגנים באורכם ובקושי שלהם.\nיש לציין כי הפרויקט לא נבדק בצורה הוגנת, כל בודקת בודקת בצורה שונה ומורידה ניקוד בצורה שונה על דברים שונים כך שקשה מאוד ללמוד מהטעויות ולתקנן.\n\nהשורה התחתונה: קורס (לצערי) לא מומלץ אך יש המון פוטנציאל, והוא סך הכל רלוונטי ומעניין!\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: דנה\nחוות דעת - הרצאות: הרצאות מצויינות! דנה מרצה מעולה ומעבירה את החומר בצורה מעניינת מאוד. שילבה סרטונים מצחיקים שהמחישו את החומר וגרמו להרצאות לעבור מהר ובטוב.\n\nשם המתרגל/ת: עמית\nחוות דעת - תרגולים: מתרגלת מצויינת. עקרונית אפשר לעבור על המצגות פשוט, לא הרגשתי שההגעה הפרונטלית איכשהו הייתה משמעותית יותר מדי.\n\nשעורי הבית: הקורס קצת עמוס בעיקרון. יש בחנים במודל שיוצאים פעם בשבועיים - קצרים ולא קשים ועוזרים להיות על החומר. מעבר לזה יש איזה כמה שאלונים שצריך לעשות. השאלון הראשון לא היה מאוד נורא אבל השניים האחרים היו קצת בלתי נסבלים... וכמובן, פרוייקט. הרגיש לי יותר מעניין ופרקטי מהפרויקט של מבוא לפסיכולוגיה. הייתה לי קבוצה טובה וסיימנו עם ציון מעולה, למרות שהרגיש לפעמים שסתם מחפשים איפה להוריד ניקוד.\n\nהמבחן: אחלה של מבחן. 40 שאלות אמריקאיות נשמע הרבה, אבל הרבה מאיתנו סיימו אותו בשעה או פחות. מבחן הוגן מאוד ולא קשה, במיוחד אם הגעתם להרצאות :)\n\nהשורה התחתונה: לרוב הבחירה היא בין התנהגות ארגונית והנדסת גורמי אנוש. בתור אחת שעשתה את שניהם, ממליצה בחום על התנהגות ארגונית למרות המבחן. התחברתי לחומר הנלמד ולפרויקט משמעותית יותר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 85  סופי 85  הררי-חמם דנה\nאביב 2024       א' 86  ב' 85  סופי 85  הררי-חמם דנה\nאביב 2023       א' 88  סופי 90  הררי-חמם דנה\nחורף 2021-2022  א' 78  ב' 94  סופי 85  אלסטר אנדריי\nחורף 2020-2021  א' 84  סופי 84\nאביב 2020       א' 73  ב' 73  סופי 77  פפרמן טליה\nחורף 2019-2020  א' 70  ב' 73  סופי 74  אלסטר אנדריי\nאביב 2019       א' 73  ב' 66  סופי 74  פפרמן טליה\nחורף 2018-2019  א' 81  ב' 77  סופי 83  פפרמן טליה\nאביב 2018       א' 76  סופי 76  פפרמן טליה\nחורף 2016-2017  א' 82  ב' 84  סופי 85  פפרמן טליה\nסופי מועד א': 85\nסופי: 85\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n31 30 1 97 67 94 85.933 87.5\nאיש סגל תפקיד\nהררי-חמם דנה מרצה - אחראי מקצוע\nוינשטוק זואי מתרגל - עם הרשאות מרצה אחראי\nסקורניק עמית מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}