{
  "course_id": "095296",
  "scraped_at": "2025-12-16T13:32:35.150049",
  "information": {
    "raw_text": "00950296 - שיטות אלגבריות בהנדסת נתונים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 4\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהשלמות באלגברה ליניארית )מרחבי מכפלה פנימית, נורמות, בסיסים אורתונורמלים, ערכים עצמיים ווקטורים עצמיים(, פירוקי מטריצות )משפט הפירוק הספקטרלי(, מערכות משוואות ליניאריות, ריבועים פחותים, שיטות איטרטיביות לפירוק מהיר של מטריצות, שיטות איטרטיביות לפתרון בעיות ריבועים פחות במימד גדול עם מידע דליל, משפטי פרטרובציה של פירוקי מטריצות, מבוא לטנזורים\n\nמקצועות קדם: (00940345 ו-02340117 ו-01040166 ו-01040032) או (01040022 ו-01040016 ו-02340221 ו-00940345) או (00940347 ו-01040022 ו-02340221 ו-01040016)\n\nמקצועות ללא זיכוי נוסף (מוכלים): 02380125\n\nמקצועות ללא זיכוי נוסף: 00950295 02340125\n\nמועד א': 27-02-2026\nמועד ב': 27-03-2026",
    "title": "00950296 - שיטות אלגבריות בהנדסת נתונים"
  },
  "feedback": {
    "summary": {
      "text": "9 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 4.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: אוי ואבוי.\nלנסות ולהשיג מוקלט בכל הכח כדי לברוח מהסיוט של לשבת בכיתה כשהוא מלמד.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: מתרגלת ממש נחמדה וחכמה, מסבירה טוב אבל צריך להתרכז ולהקשיב.\n\nשעורי הבית: ארוכים ממש אבל אם שוברים את הראש עליהם זה ממש עוזר.\n\nהשורה התחתונה: להתרחק מדן גרבר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "חוות דעת - הרצאות:דן\nההרצאות של דן מאוד טובות אבל הן גם הדרך היחידה האמיתית ללמוד את הקורס כי אין אלטרנטיבה. אפשר לקרוא את השקופיות (וגם עשיתי זאת זה לא נורא) אבל זה לא משתווה ללכת להרצאה שלו. בהרצאה הוא כמעט אך ורק מוכיח משפטים שלא תידרשו להוכיח יותר אז יותר תתמקדו במעברים ופחות בלהבין למה המשפט נכון כי זה לא חשוב.\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים:\nחיה מתרגלת טובה ולכן התרגולים שלה היו די מלאים. גם לתרגולים מומלץ מאוד להגיע.\nשעורי הבית:\nמגן, היה צריך להגיש 5 מתוך 6. רוב ש\"ב היו מרופרנסים אך היו גם כמה שלא שמעתי שרופרנסו. הש\"ב הם הדרך היחידה לתרגל בקורס כי קשה למצוא תרגילים טובים של זה במקום אחר ואין הרבה מבחנים. בנוסף במבחן יש שאלות ש\"ב במשקל של בערך 20 נקודות. הייתי ממליץ לעשות ש\"ב אבל לא למות עליהם ולרפרנס במידת הצורך.\nהמבחן:\nהמבחנים בשנים האחרונות הרבה יותר פתירים במסגרת הזמן ממה שהיה לפניהם. כן היה סעיף אחד לא פתיר בעליל אבל חוץ מזה כל השאר היה פתיר, תעברו טוב על הש\"ב כי מבאס ליפול בהם.\nהשורה התחתונה: קורס מעניין מאוד ואחד המעניינים ביותר שהיה לי עד עכשיו אבל גם קשה כי מועברים בקורס רק משפטים גדולים וקשה לעבור מהם לתרגול. קורס לבחור אם אתם חייבים אלגברה לינארית כדי להציל את חייכם אחרת לא כדאי.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מרצה מצוין, יחסי אנוש- פחות.\nהחומר מעניין, אבל קשה.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים: מצוינת! מסבירה באופן מאד מסודר.\n\nשעורי הבית: חשוב לעשות אותם. יש רפרנס לרוב.\n\nהמבחן: קשה, אפילו מידיי (וללא פקטור כללי במועד א).\nלמילואימניקים שעשו מספיק ימי מילואים ניתן פקטור כפלי מראש.\n\nהשורה התחתונה: קורס חובה, זה מה יש.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: לטעמי ההרצאות היו מעניינות ממש. פחות התחברתי לנגיעות לא נגיעות באלגוריתמים וסיבוכיות אבל אין מה לעשות. מה שכן, היחס מדן לא משהו בכלל.\n\nשם המתרגל/ת: חיה נחימובסקי\nחוות דעת - תרגולים: הגעתי לתרגול הראשון. היא עשתה שם כמה טעויות שנגררו להן קצת מבחינת האורך וזה תמיד מסיח דעת כשזה קורה. אז קלטתי שאני מעדיפה לעבור פשוט על ה-pdfים בעצמי והפסקתי להגיע. מה שכן, בתרגולים יש חומר נוסף להרצאות לפעמים וצריך לדעת גם אותו למבחן, אז חשוב לעבור עליהם.\n\nשעורי הבית: גיליון מאתגר פעם בשבועיים. שווה לפתור גם כי זה מגן וגם כי זה עוזר להטמיע את החומר. חוץ מזה יש שאלת שיעורי בית במבחן.\n\nהמבחן: נוראי. לא יכולתי להגיע למועד א' ולא נתנו לי מועד מיוחד אז היה לי רק את מועד ב', והוא היה קשוח יותר מא'. במועד א' היה פקטור של 16 נקודות(!!) אז אפשר רק לדמיין בינתיים מה יהיה בב' עד שיגיעו הציונים.\n\nהשורה התחתונה: חומר מעניין אבל L+סגל לא חזק במיוחד+ מבחן שעושה חשק להקיא\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: דן\nחוות דעת - הרצאות:\nחשוב היה לי לכתוב שבניגוד לשאר הדעות פה אני חושבת שדן מרצה מצויין, יודע להסביר את החומר (הלא פשוט בכלל), ולהרגשתי היחס שלו לסטודנטים היה מכבד. חשוב ללכת להרצאות ולא להתפתות לקרוא את המצגות.\n\nשם המתרגל/ת: עטרה\nחוות דעת - תרגולים:\nמאוד מסודרת ולטעמי גם ברורה, אבל קל לאבד אותה\n\nשעורי הבית:\nקשים קשים קשים, אבל אין מה לעשות באמת חשובים. אצלנו היו 2 שאלות מהתרגילי בית במבחן ובכנות הם הצילו להרבה אנשים את הציון..\n\nהמבחן:\nנורא. אמנם הוא היה פתיר אבל הבדיקה היתה קשוחה בטירוף, אם לא ענית 100% מה שציפו הורידו את כל הנקודות בסעיף. 16 נקודות פקטוררררר!!! ואין מה להוסיף.\n\nהשורה התחתונה: באסה לנו. סתם לא נורא, הקורס באמת מעניין\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: דן יודע את החומר מצוין, חבל שהסטודנטים לא.\n\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים: אחלה מתרגלת, אכפת לה מהסטודנטים, חבל שאין לה הקלטות.\n\nשעורי הבית: ארוכים וחשוכים כמו מנהרה בח'אן יונס.\n\nהמבחן: דן החליט שהוא כותב ספר לכבוד המועד ב', לא הספקתי לקרוא את כולו בזמן שהוקצב לבחינה.\nבכל מקרה, כל שאלה היא כמו מתקפת טילים איראנית, ב-3 חודשים אין לסטודנט זמן לפתח את מערכות ההגנה הנדרשות. יוצאים בידיעה שצריך פקטור כדי לעבור...\n\nהשורה התחתונה:\n1. דן אם אתה קורא את זה, אז לא נהניתי בכלל!\n2. הקורס מומלץ למזוכיסטים בלבד.\n3. לשים עובר בינארי כל עוד אתם יכולים.\n4. נקודה חיובית- היה פקטור נדיב 1.25 למילואימניקים.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: מתאמץ מאוד לעשות את החומר מורכב יותר ממה שצריך להיות.\n\nשם המתרגל/ת: עידן פיפנו\nחוות דעת - תרגולים: אחלה עידן, מעביר את החומר ברור ולעניין. מומלץ מאוד.\n\nשעורי הבית: לפעמים קצת כבדים אבל עוזרים להבין את החומר\n\nהמבחן: ממוצע 65 אחרי פקטור של 13 נקודות ושיעורי בית. תבינו מה שתבינו.\n\nהשורה התחתונה: לא נהניתי\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: דן גרבר\nחוות דעת - הרצאות: דן הוא מרצה טוב אי אפשר לקחת את זה ממנו הוא מעביר את החומר בצורה די ברורה וצריך לזכור זה אחד הקורסים היותר קשים בפקולטה לדעת רב האנשים. קל מאוד לאבד אותו לכן צריך לשתות קפה או משקה אנרגיה לפני השיעור כדי להיות מרוכז טוב טוב כמו כן חשוב מאוד מאוד מאוד לא יודע כמה מאוד לתת לחזור לפני כל ההרצאה על החומר מבנה ההרצאות הוא סוג של פרמידה שכל הרצאה נבנית על הקודמות אליה לכן אם לא הבנתם משהו כנראה שאת ההרצאה הבאה תרגישו בקריסת מערכות אז תחזרו טוב טוב על החומר תבינו מעברים כי בסוף זה כמה מעברים שהוא עושה שוב ושוב ודי בונה על זה שתפסתם את הטריקים ולא נתקע על זה בשלב מסוים.\nכבן אדם אני פחות התחברתי הוא הרגיש לי לפעמים לא הכי נחמד ביחס למרצים אחרים אבל זה מי שהוא והוא בא בסופו של יום להעביר את החומר וללכת לעיסוקו לא לשיגועי שכל אז תבואו בגישה הזאת ויהיה בסדר משם.\n\nשם המתרגל/ת: חיה\nחוות דעת - תרגולים: אחלה מתרגלת שבעולם סבלנית מעבירה כמו שצריך את התרגולים עונה בהפסקות על השאלות אם יש כמו כן לא מחסירה מאף אחד את האפשרות לשאול בכיתה. רק מילים טובות יש לי עליה.\n\nשעורי הבית: יש 6 תרגילי בית צריך לעשות 5 בזוגות, תרגילים לא הכי קלים בעולם יש להם רפרנס אבל ממליץ די לריב איתם כמה שאפשר בסוף זה מה שמפתח את ההבנה בחומר וזה דברים שתפגשו אם תרצו או לא במבחן בנוסף זה גורם לכם לחזור על ההרצאות והתרגולים כמו שצריך תנשכו שפתיים ותפתרו עד שבאמת לא הצלחתם.\n\nהמבחן: מבחנים של דן הם קשים, אין מה לעשות ככה הוא מלמד טוב וגם נותן מבחנים על רמה במועד א היה 13 פקטור במבחן שלדעתי ביחס לשנים קודמות זה אפילו פקטור נמוך אז תבינו שאם לכם קשה לכולם קשה ובסוף יש פקטורים שמאזנים את זה אבל אם לא הבנתם טוב את החומר במהלך הסמסטר יהיה קשה להדביק את הפער בתקופת המבחנים כי המבחן באמת קשה.\n\nהשורה התחתונה: קורס קשה שמי שבנתונים חייב לעשות אין ברירה תעברו אותו רבים עשו לפניכם וגם יעשו אחריכם תחזרו טוב על אלגברה לינארית לפני הקורס אם יש זמן זה יעזור.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 5.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 65  ב' 65  סופי 71  גרבר דן\nחורף 2023-2024  א' 69  ב' 65  סופי 71  גרבר דן\nמבחן מועד א': 61\nסופי מועד א': 65\nמבחן מועד ב': 61\nסופי מועד ב': 65\nסופי: 71\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n133 109 24 82 36 100 71.216 73\nאיש סגל תפקיד\nגרבר דן מרצה - אחראי מקצוע\nאבנרי ערן מתרגל\nפיפנו עידן מתרגל\nנחימובסקי חיה מתרגל\nשיתוף היסטוגרמות"
  }
}