{
  "course_id": "096250",
  "scraped_at": "2025-12-16T13:41:59.711736",
  "information": {
    "raw_text": "00960250 - מערכות מידע מבוזרות\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nריכוז וביזור ברמות הארגון ומערכות המידע. ארכיטקטורות של מערכות מידע מבוזרות. מסדי נתונים מבוזרים. היבטי תקשורת מודל שרת.לקוח ויישומיו. ניתוחי אירועים שבמרכזם מערכות מידע. טכניקות ואלגוריתמים.\n\nמקצועות קדם: (00940210 ו-00940224) או (00940210 ו-00940226) או (00940210 ו-02340247)\n\nמועד א': 09-02-2026\nמועד ב': 10-03-2026",
    "title": "00960250 - מערכות מידע מבוזרות"
  },
  "feedback": {
    "summary": {
      "text": "30 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: הרצאות לא קשות ומעניינות לרוב\n\nשם המתרגל/ת: נוגה\nחוות דעת - תרגולים: תרגולים קצרים ולא מועילים ככ להבנת החומר\n\nשעורי הבית: שב יבשים ארוכים ויש שאלות קשות. שב רטוב מציק ולא רלוונטי לחומר אבל לא ארוך.\n\nהשורה התחתונה: מרצה הוגן מאוד, לומדים דרכי חשיבה חדשות רעיונות מעניינים וכלים רלוונטים. מומלץ מבחינת החומר\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות:\nהרצאות סבבה, מסביר טוב את החומר.\nשם המתרגל/ת: נגה צור פרשה באמצע ואז שמעון ביטון\nשני מתרגלים מעולים שמסבירים טוב ושמחים לעזור\nחוות דעת - תרגולים: לא מאוד מועיל, השבועיים הראשונים זה חזרה על החומר של מבני והסתברות בכלל. יש גם חומר חדש מדי פעם אז לא לפספס.\nשעורי הבית:\n4 יבשים ותכנותי. ליבשים צריך כמה שעות עבור כל אחד כדי לעשות, יש שבוע הגשה בערך ועוד יומיים איחור.\nלרוב הסטודנטים הם אלו שבודקים את הש\"ב היבשים (כדי לקבל בונוס) וחלקם אכזריים/מורידים כמו מפגרים אז כדאי להיות זהירים. בכללי כדאי להשקיע בש\"ב כי זה מכין למבחן.\nהתכנותי דיי מציק וקצת קשה להתמודד עם כל ה threadים, לא כדאי לשמור לסוף.\nהמבחן:\nמבחן קורונה, היה מבחן קשה ושיטת ניקוד מגעילה (כמו בכל שנה). מבחן אמריקאי כשבחלק מהשאלות על קיום אלגוריתמים יש מינוס נקודות במידה ואומרים שקיים וטועים, מגיע גם למינוס 15 שאלה של 10 ולנו (שלא כמו בכל שנה) הוריד את האופציה לחזור אחורה.\nהשורה התחתונה:\nלא מעניין במיוחד\nמבחן מגעיל\nבדר\"כ יש פקטור של 7-8 נקודות\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: יובל\nחוות דעת - הרצאות: הרצאות מרדימות\n\nשם המתרגל/ת: יובל\nחוות דעת - תרגולים: מסכמים טוב את החומר וניתן להצליח במבחן גם אם רואים רק אותם\n\nשעורי הבית: חשובים להבנת החומר ולכן צריך לעשות אותם ברצינות, סטודנטים בודקים את השיעורי בית ולפעמים נופלים על בודק קטנוני ולא הוגן.\nיש גם פרויקט מציק ולפחות בסמסטר הזה היה הורדת ניקוד משמעותית על קריטריונים שלא צויינו מראש אז צריך להיזהר.\n\nהמבחן: מבחן אמריקאי טיפשי ולא הוגן שבו שאלות שבהן טעות מורידה פי אחד וחצי משווי השאלה. במבחן שלנו לדוגמא היה אפשר לצדוק ב8 מתוך 10 השאלות במבחן ולהיכשל. בנוסף בסמסטר קורונה הוא כלכך פחד מהעתקות שלא היה אפשר לצאת מחדר הזום עד סוף המבחן או לחזור אחורה אחרי שעברנו סעיף לכן היינו צריכים לפתור את המבחן סעיף סעיף.\n\nהשורה התחתונה: קורס המשך למבני נתונים ואלגוריתמים בתכלס ולא מאוד מעניין\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: הרצאות מעניינות, קלילות\n\nשם המתרגל/ת: נוגה הרלב ושמעון ביטון\nחוות דעת - תרגולים: תרגולים מועילים ונחמדים\n\nשעורי הבית: לא קשה מאוד ויש רפרנס כמעט להכל. יש 4 תרגילים יבשים קצרים ותרגיל בית תכנותי קשה מאוד אבל הוא עם משקל נמוך בציון.\n\nהמבחן: מבחן קשה מאוד, כדאי לפתור את כל מבחני העבר.\n\nהשורה התחתונה: קורס נחמד ולא עמוס אבל מבחן קשה מאוד.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נגה\\ הקלטות של יובל\nחוות דעת - הרצאות: נגה- טון מונוטוני ומרדים, מעבר לזה שהחומר גם ככה לא מעניין במיוחד. אבל לוקח לה שעתיים להעביר חומר שיובל מעביר בשלוש.\nיובל- מרצה שיותר תופס את תשומת הלב, אבל בכל זאת לא מעניין במיוחד.\n\nשם המתרגל/ת: אור ברמן- סביר\\סביל תלוי בהשקפת העולם שלכם\nחוות דעת - תרגולים: עוזרים קצת לשיעורי הבית\n\nשעורי הבית:\nיבשים-מרופרנסים (4 שאלות מתוך חמש הן משנים קודמות, ושאלה חמישית מאחד ממבחני עבר בדר\"כ)\nרטוב- 5 אחוז תקף על פרוייקט שלוקח בערך חודש וקצת, חצי מהמחזור פשוט לא עשה אותו.\nהמבחן:\nאמריקאי עם ניקוד שלילי על טעויות בדיוק כמו שיובל אוהב (ראה ערך מבני נתונים בסמסטר חורף 20-21). (עדיין לא עשיתי אותו אז לא יודע להגיד על ההוגנות)\nהשורה התחתונה:\nקורס משעמם על חומר שיכל להיות מעניין הרבה יותר.\nהחומר לא רלוונטי בשום צורה לאף תואר (לא למערכות מידע ולא לנתונים) לא לקחת אם לא חובה!\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נגה\nחוות דעת - הרצאות:\nמרצה נהדרת, יודעת להתמקד בעיקר של החומר ומסבירה אותו טוב ומדוייק (והכי חשוב מתומצת).\nראיתי גם הרצאות של יובל וגם הגעתי להרצאות של נגה עד שהבנתי שהרצאות של נגה עדיפות בהרבה. בעיקר כי היא יודעת להעביר את התכלס של החומר מהר.\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים:\nמתרגל אחלה ממש, חזק מאוד בחומר ועונה לשאלות בצורה מאוד טובה. הוא מדבר קצת מהר אבל אם מצליחים לשמור על ריכוז לאורך כל התרגול מפיקים הרבה מאוד.\n\nשעורי הבית:\nמרופרנסים ולא פשוטים, פתירים אם יש את הזמן לשבת עליהם אבל עם סמסטר עמוס סיכוי סביר שבסופו של דבר נגיע לרפרנסים.\n\nהמבחן:\nעוד לא היה, אבל מפתירת מבחנים משנים קודמות נראה שסה\"כ הוגן ולא פשוט.\n\nהשורה התחתונה:\nקורס אחלה, גם לאנשים שחושבים שהקורס לא הכי קשור לחיים שלהם עדיין אפשר למצוא משהו מעניין.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: יובל עמק (הקלטות)\nחוות דעת - הרצאות: אין יותר מדי מה לפרט, מרצה בצורה ברורה ועמוקה, לפעמים קצת מתעכב על נקודות קטנות ולא בהכרח רלוונטיות אבל סך הכל אחלה מרצה\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים: מראה הבנה של החומר, מעביר אותו בצורה טובה. מדבר קצת מהר אז אי אפשר להריץ את ההקלטות שלו על יותר מ- 1.25x\n\nשעורי הבית: מתחלקים לשני חלקים:\nגליונות יבשים - תכלס מה שצריך לעשות בשביל לעבור את הקורס בהצלחה. 4 גליונות, כל אחד עם 5 שאלות. מתחיל קל ומסתבך ככל שהסמסטר מתקדם. אחת מהשאלות מופיעה במבחן אז חשוב להיסגר על כל השאלות שמופיעות בשיעורי בית. הערה חשובה בנוגע לגליונות היבשים: בקורס אין בודקים תרגילים, מי שבודק את השיעורים הם הסטודנטים עצמם. יש רפרנסים כמעט לכל התרגילים, אבל חשוב לשים לב שגם אם רשום על רפרנס ציון 100 זה לא אומר שהוא בהכרח נכון, אולי הסטודנט שבדק אותו לא הבין כלום מהחיים שלו.\nפרויקט רטוב - המטרה היא לממש את הדברים שלומדים בשבועות 4-5 של הקורס (מודל 5 השכבות). בפועל זה לא רלוונטי בשום צורה למה שצריך לדעת למבחן, וגם מדובר בפרויקט לא טריוויאלי בכלל ואפילו די עמוס. שווה רק 5% מהציון הסופי (תקף).\n\nהמבחן: שיטת הניקוד של יובל עמק. המבחן כולו אמריקאי ובחלק מהשאלות טעות גוררת ניקוד שלילי. חוץ מזה המבחן יחסית הוגן אבל לא כל כך פשוט.\n\nהשורה התחתונה: בפועל לא ברור איך הקורס הזה קשור למסלול של נתונים, מלמדים דברים ש(אולי) חשוב לדעת לידע כללי אבל זה לא באמת שימושי לטעמי.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "חוות דעת - הרצאות: יובל (הקלטות)\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים: נסיך אמיתי. אם ביקשת עזרה קטנה הוא נתן לך עזרה גדולה ומכל הלב. נתן אקסטרה והיה לו אכפת שבאמת נבין.\n\nשעורי הבית: הרוב מרופרנס, תרגיל תכנותי מנותק מהמציאות מבחינת אחוז מהציון ביחס לכמות ההשקעה, הרוב לא עשו ובצדק.\n\nהמבחן: היה הוגן מבחינת תוכן, שיטת הניקוד כאופיני לקורס מהג'אנר - אתה יכול לקבל ציון שלילי למבחן. סה\"כ ממוצע וחציון גבוהים יחסית.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "חוות דעת - הרצאות: יובל (הקלטות)\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים: מתגל מאוד נחמד, חד, ומבין טוב מאוד את החומר. רק הוא מדבר ממש מהר שזה דיקשה לפעמים.\n\nשעורי הבית: 4 גיליונות יבשיםץ לרוב עם רפרנסץ שווה להשקיע כי זה הרמה של המבחןץ יש גם תכנותי מגעיל תקף של 5% שלא עשיתי כי זה סתם להשקיע שעות.\n\nהמבחן: מבחן הוגן אבל שיטת הניקוד מפגרת. בלי הרבה ידע אפשר להוציא 70+ רק אם עונים לרוב השאלות ״לא נכון״.\n\nהשורה התחתונה: קורס מאוד משעמם. ביקר כי התוכן שלו מיושן ממש ומסמך על אותם סלידים יותר מ-10 שנים.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: הקלטות של יובל - הוא יודע מה הוא עושה.\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: אחלה מתרגל, אכפתי ומבין עניין. מדבר מאוד מהר אבל באופן מפתיע מתרגלים.\n\nשעורי הבית: בינוניים-קשים. תלוי כמה רפרנסים יש.\n\nהמבחן: כרגיל מבחן של יובל עם ניקוד שלילי.מעצבן ומציק, אבל היה יחסית הוגן.\n\nהשורה התחתונה: קורס סביר\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נוגה הרלב\nחוות דעת - הרצאות:\nמעולות\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים:\nטובים מאוד, פותרים תרגילים. אור מדבר בקצב 1.5 אבל כשמתרגלים אז זה טוב\nשעורי הבית:\nהיבשים אחלה, מלמדים וטובים למבחן (חלקם ממבחנים). הרטוב לא סביר למי שלא דובר ג'אווה שפת אם ועשה משהו עם ספריות של תקשורת, אין הכוונה בכלל. היה 5 אחוז אז הרבה ויתרו עליו.\nהמבחן:\nסביר אבל הניקוד השלילי מבאס ממש. \"זה מאוד פשוט, תענו רק אם אתם יודעים\". נ.ה.\nהשורה התחתונה: קורס שמרגיש כמו פתירת חידות, די נחמד\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: יובל עמק (הקלטות)\nחוות דעת - הרצאות: מרצה מצוין שחי ונושם את הקורס הזה. יש לו הקלטות בפנופטו גם מ-2020 וגם מ-2021. שתיהן טובות, 2021 היא הגרסה המתומצתת וב-2020 יש הרבה שאלות של סטודנטים.\n\nשם המתרגל/ת: יובל גיל ואור ברמן (הקלטות)\nחוות דעת - תרגולים: שניהם מתרגלים נחמדים. חשובים מאוד להבנת החומר ובחלקם גם נלמד חומר חדש.\n\nשעורי הבית: יבשים - רוב התרגילים ברמת קושי סבירה ועם רפרנס, וחלק מאתגרים מאוד וחסרי רפרנס. רטוב - לכאורה נראה כמו תרגיל תמים שמבקש לממש אלגוריתם פשוט אבל בפועל מדובר בזוועת עולם. הסמסטר העלו אותו ל-10% תקף אז לא ניתן היה להתחמק.\n\nהמבחן: הוגן, צריך לעבור על מבחני עבר ולשנן כל מיני טריקים ושטיקים, כי הרוב חוזר על עצמו בניסוחים שונים. לא לפחד מהניקוד השלילי, הוא לא מהווה בעיה למי שלא מנסה לגנוב נקודות.\n\nהשורה התחתונה: השם של הקורס קצת מטעה, לא ממש מתעסקים פה עם מערכות מידע. זוכרים את מודל השכבות מארגון המחשב? אז בשבועות 1-7 חופרים על כל שכבה. בשבועות 8-13 עוברים במעבר חד להתעסק עם אלגוריתמים מבוזרים. סה\"כ קורס חביב ביותר פרט לתרגיל הרטוב יימח שמו.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: יובל עמק(מוקלט)\nחוות דעת - הרצאות:\nהרצאות מעולות,רואים שהנושא מעניין את המרצה וזה מורגש גם בהקלטות וגם בלייב (הסיבה היחידה שלא הלכתי ללייב היא אילוצי מערכת,לגמרי שווה לבוא), הרבה פחות כבד מההרצאות במבני\nשם המתרגל/ת: נגה הרלב\nחוות דעת - תרגולים:\nמתרגלת מעולה, ממוקדת בחומר בתרגול ומסבירה הכל בצורה מפורטת ממש\nשעורי הבית:\nחלק יבש- 4 גליונות,חמש שאלות לכל גיליון. השאלות עצמן מאוד רלוונטיות,ברמה ששאלה שלמה בשיעורי בית הופיעה במבחן,ככה שמומלץ מאוד לנסות ולפתור בעצמכם. הסגל נתן אפשרות לסטודנטים אחרים בקורס לבדוק בכל פעם תרגילי בית, בתמורה לבונוס של 3 נק' לציון הסופי. על הנייר רעיון נחמד, אבל בפועל היו גם מקרים שסטודנטים הורידו באופן לא סביר בציון,וחבל.\nחלק רטוב- הקטע המבאס של הקורס. תרגיל בית תכנותי בג'אווה במשקל 10% מהציון, מזכיר מאוד את התרגיל הרטוב במבני. מומלץ מאוד לחזור על החומר של הנדסת תוכנה מראש, כיוון שהרבה דברים מסתמכים על העובדה שאתם אשפי OOP\nהמבחן:\nלא סוד שיובל עמק מת על הקטע של ניקוד שלילי,אבל יחד עם זאת, זה אולי אחד המבחנים הכי הוגנים שהיו לי בטכניון עד כה.\nמעבר לעובדה ששאלה שלמה נלקחה ישירות מהשיעורי בית,ואף פורסם לה פתרון מלא, גם השאלות בהן היה אפשר לאבד ניקוד גבוה לשאלה היו מאוד הוגנות,ורוב מי שניסה לפתור ברצינות הצליח להתחמק מהמוקשים האלה. יש בהחלט פוטנציאל לציון גבוה בקורס למי שמשקיע בלמידה למבחן\nהשורה התחתונה:\nקורס סבבה ממש,ולמעט התרגיל התכנותי, גם לא עמוס במיוחד. הקורס בפועל הוא מעין המשך לחלק הראשון של \"ארגון המחשב ומערכות הפעלה\" ומבני נתונים,אבל לא מרגיש כבד כמוהם\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מרצה מעולה, מסביר את החומר בצורה הכי עמוקה וברורה שיש. ההרצאות רלוונטיות כי יש דברים שגם לא עברו בתרגולים, יש הקלטות מעולות שלו.\n\nשם המתרגל/ת: נוגה הרלב\nחוות דעת - תרגולים: היה מצוין, כל נושא הוסבר לעומק והתרגילים הוסברו והודגמו.\n\nשעורי הבית: בדיקה עצמית של סטודנטים - קבוצות של סטודנטים בודקות תרגילים מתרגילי הבית. התרגילים היבשים מאוד קשים להבנה ולפתרון.\nיש תרגיל רטוב (אצלנו היה 10% תקף) שהוא כאב ראש שלם.\n\nהמבחן: יש שאלות אם ניקוד שלילי וצריך לדעת להתמודד איתן, סך הכל לגמרי אפשרי.\n\nהשורה התחתונה: קורס שנראה מפחיד אבל בגישה הנכונה הוא בסדר גמור.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מרצה מעולה כשצופים בהקלטות שלו ואפשר להריץ אותו יותר מהר ולדלג על חלקים שבהם הוא מדבר על סיפורי חיים לא רלוונטיים שלו. מסביר את החומר בצורה טובה ונותן דוגמאות שעוזרות להבין את האלגוריתמים.\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים: מתרגל מעולה, משתדל לשתף אנשים בתרגול ומתעכב כשמישהו לא מבין נקודה חשובה. באמת נתן את הלב.\n\nשעורי הבית: היבשים סבבה לגמרי, משהו באזור הארבעה גליונות (ללא קוד) עם בדיקת עמיתים ככה שלרוב הציונים היו גבוהים. חשוב לא לזלזל בהם כי חלק מהשאלות לקוחות ממבחני עבר אז זו אחלה הכנה לרמת המבחן, וגם במבחנים יש שאלות מהגליונות.\nהתרגיל הרטוב (פרויקט) מעיק. הוא ארוך ולוקח זמן, וכמובן שצריכים בשבילו חומר שלא נלמד בקורס הזה, מה שאומר שצריכים ללמוד עוד חומר רק בשביל להצליח את הפרויקט. הפרויקט עצמו כל הזמן השתנה והרבה נפלו בבדיקה האוטומטית על כל מיני דברים שהוסיפו לתרגיל במהלך העבודה עליו בלי לעדכן את מסמך ההגשה הרשמי.\nחייב לתת לברמן קרדיט רציני על זה שהוא נתן אופציה לתקן את תרגיל הפרויקט (אומנם קנס של 30% אבל זה עדיף על לקבל 0 כמו שנהוג בפרויקטים בקורסים של יובל עמק).\n\nהמבחן: הוגן לחלוטין, ובאופן כללי למעט שנה אחת שראיתי בה מבחן מופרע כל המבחנים ממש סבבה ואם מתרגלים מספיק ועוברים על החומר כמו שצריך אפשר להצליח בגדול.\nהמבחן עם כל חומר הקורס (כמו בקורס הראשון של יובל עמק).\n\nהשורה התחתונה: למעט הפרויקט הקורס מעניין, וסגל הקורס היה מתחשב.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: נגה הרלב\nחוות דעת - הרצאות:\nאין דברים כמו נגה, לא משנה מה יגידו, יודעת להעביר את החומר, יודעת להיות מצחיקה ורצינית כשצריך. כיף שיש מישהי כמוה בפקולטה שבאמת נותנת 100% מעצמה גם בחומר הכי משעמם שיש.\n\nשעורי הבית:\nכבדים\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: נוגה הרלב\nחוות דעת - הרצאות: תותחית ממליץ לקחת בסמסטר שהיא מלמדת במקום יובל עמק.\n\nשם המתרגל/ת: תומר\nחוות דעת - תרגולים: נחמד מאוד ואכפת לו שנבין. קצת מבולגן אבל דואג ליישר קו תמיד.\n\nשעורי הבית: 4 גליונות מעצבנים ורטוב ב multithreaded, לא כיף.\n\nהמבחן: לא כיף\n\nהשורה התחתונה: meh\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: נגה הרלב\nחוות דעת - הרצאות: מרצה מצוינת! מסבירה את החומר בצורה מאוד ברורה ומבינים הכל אחרי שהיא מסבירה. היא מפשטת את הדברים ככה שגם מצגת עמוסה במלא מתמטיקה ומלל נראית יחסית בסדר. ממליץ בחום לראות אותה על פני המוקלט.\n\nשם המתרגל/ת: מוקלט\nחוות דעת - תרגולים: ההקלטות של התרגולים סבבה. המתרגל הוא יובל גיל והוא מסביר את החומר טוב בהקלטה. ממליץ לכם לצבור כמה הקלטות ואז לראות במכה כשיוצא התרגיל בית ככה שתבואו חדים על החומר. לא דחוף לראות כל שבוע.\n\nשעורי הבית: 4 גיליונות יבשים ופרויקט רטוב. הגיליונות קשורים מאוד לחומר שנלמד בהרצאה ומלמדים. כדאי לפתור את הגיליונות כמה שיותר לבד כי בסוף יש שאלת שיעורי בית במבחן וגם ככה מבינים את החומר טוב יותר. ממליץ בחום להקליד מאשר לכתוב באייפד כי זה בעיקר מלל וכמעט שאין נוסחאות.\nהפרויקט הוא 10% מהציון והוא מציק מאוד. מתעסקים ב threads וכל מיני דברים שלא יצא לנו לעבוד איתם. ספציפית הסמסטר הביאו לנו משהו לא יותר מדי מורכב (בניגוד לסמסטר חורף) אבל יכולים להפתיע.\n\nהמבחן: הוגן על גבול הקשה. המבחן אמריקאי כולו ככה שבשאלת שיעורי הבית מספיק לזכור מה הסימונים וזהו יש 30 נקודות בכיס. שאלת האלגוריתמים (קיים / לא קיים אלגוריתם ש...) הייתה באותה רמה אם לא קלה יותר ממבחני העבר ושאלה אחת לא פשוטה בכלל עם אלגוריתם חדש ומלא למצוא סיבוכיות זמן/הודעות.\nמי שבא מאוד חד כן הצליח להוציא באיזור ה90.\n\nהשורה התחתונה: קורס לא עמוס במהלך הסמסטר. הלמידה למבחן חלקה יש מלא מבחנים לפתור. אם יש לכם זמן תפתרו כמה שיותר.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מציונות, כמו כל ההרצאות של יובל עמק. הוא מעביר את החומר בצורה מאוד ברורה, לפעמים קצת נתקע על דברים שלדעתי הם דיי איזוטריים אבל בכללי הרצאות טובות.\n\nשם המתרגל/ת: כפיר\nחוות דעת - תרגולים: תרגולים בסדר. ברובם לא הייתי וראיתי הקלטות, אבל הם עוזרים להבין את החומר בצורה טובה.\n\nשעורי הבית: 3 גליונות, כל אחד בערך 7 שאלות ולנו עוד היה מקוצר בגלל המלחמה. הגליונות דיי ארוכים, אז כדאי למצוא שותף טוב לעשות איתם. כמו שנים קודמות, יובל עשה תכנית כזאת שאת הגליונות הסטודנטים בודקים - קבוצה של סטודנטים מתנדבת לבדוק שאלה אחת בכל גליון, ומקבלת בונוס נקודות על זה. בנוסף היה לנו פרויקט תכנותי שבדרך כלל הוא ציון תקף, אבל בגלל המלחמה עשו אותו ציון מגן. לדעתי כמעט אף אחד לא עשה.\n\nהמבחן:אמריקאי. כמו מבני נתונים ואלגוריתמים (גם של יובל), החומר הפתוח זה ההרצאות והתרגולים מודפסים.המבחן באותה מתכונת של מבחנים קודמים, וישנן כמה שאלות שאם התשובה לא נכונה ואתה אומר שהיא כן יורדים לך איזה 11 נקודות. אם מתכוננים מספיק על מבחני עבר, ומבינים את החומר בסדר לדעתי אפשר לקבל אחלה ציון.\n\nהשורה התחתונה:קורס קצת רנדומלי בתואר של נתונים ומידע. לא הרגשתי שלמדתי משהו שקשור כל כך לתואר, אלא דברים כזה לידע כללי. לדעתי הקורס דיי יבש, ומזל שהסגל אחלה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: יובל עמק מרצה מצוין, ההרצאות מאד ברורות. בגלל המלחמה - הקפיד להקליט ולהעלות למודל.\n\nשם המתרגל/ת: יונתן קוחלי\nחוות דעת - תרגולים: אחלה, לרוב מסיימים לפני הזמן. יונתן העביר את החומר מצוין.\n\nשעורי הבית: סבבה. 3 גיליונות, נראים ארוכים במבט ראשון אבל בפועל זה לא לוקח יותר מאחרהצ אחד אם החומר יושב טוב. הבדיקה מתבצעת ע\"י סטודנטים, ציונים בהתאם.\n\nהמבחן: הוגן מאד\n\nהשורה התחתונה: אחלה קורס\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מרצה מצוין, מעביר את החומר בצורה ברורה ויסודית.\n\nשם המתרגל/ת: יונתן קוחלי\nחוות דעת - תרגולים: מתרגל לא טוב, מעביר את החומר בצורה לא ברורה, ממליץ ללכת לכפיר.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: החצי הראשון של הקורס ממש משעמם, החצי השני טיפה יותר מעניין אם אהבתם מבני. יובל הקליט אז על x2 זה אחלה.\n\nשם המתרגל/ת: יונתן קוחלי\nחוות דעת - תרגולים: סה\"כ סבבה, לא כאלה ארוכים ובעיקר פותרים שאלות סטייל דברים בבחינה\n\nשעורי הבית: שלושה גיליונות יבשים, לא הכל מרופרנס. אפשר להירשם לבדוק שיעורי בית בתמורה לבונוס לסופי שזה ממש כדאי. בנוסף הסמסטר היה פרויקט תכנותי שהיה רשות למרות שבדרך כלל זה חובה. לדעתי הרוב לא עשו כי זה היה 20% מגן סה\"כ.\n\nהמבחן: מועד א' היה יחסית שונה משנים קודמות אבל מועד ב' בסגנון של שנים קודמות. סה\"כ לא מבחן כזה ביג דיל ואם לומדים טוב במהלך הסמסטר ומפנימים את החומר אפשר לצאת עם ציון גבוה.\n\nהשורה התחתונה: יחסית משעמם אבל עושים כי חובה.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מרצה טוב, מסביר באופן ברור ורואים שהוא אוהב ללמד את המקצוע שלו, למרות שלפעמים היה טיפה איטי לטעמי.\n\nשם המתרגל/ת: יונתן קוחלי\nחוות דעת - תרגולים: מתרגל מדהים, הוא בא מוכן לתרגולים ונשאר לענות על שאלות ורואים שממש אכפת לו מהסטודנטים, מסביר ברור ומעביר את כל התרגול באופן שוטף וברור.\nאם תראו ביקורות פחות טובות עליו זה כנראה מכמה סטדנטים שהמבחן עשה להם רע, ועליו אדבר בהמשך.\n\nשעורי הבית: לא כבדים אם מחלקים אותם שווה בשווה עם השותף, תשוו תשובות לפני שאתם מגישים ותקבלו ציונים ממש טובים בהם.\n\nהמבחן: קשה. בעיקרון המבחן יציג בפניכם שאלות שידרשו מכם להבין איך להיעזר בחומר הנלמד בשביל לענות עליהם, מאוד חשוב שתבואו למבחן בידיעה מוחלטת של מה אפשרי ומה לא אפשרי (סיבוכיות זמן לצביעה ולMIS) ובכך זה ייתן לכם בסיס יחסית מוצק לשאלות הקיים\\לא-קיים.\nיש במבחן ניקוד שלילי, לכן עצה שלי: לנסות לכתוב הוכחה/דוגמה נגדית לתשובה שלכם, לי זה עזר המון לעלות על ניואנסים שמפילים את ההוכחה או אפילו להבין שהודגמה הנגדית שלי לא אפשרית ושלמעשה אין כזאת.\n\nהשורה התחתונה: לנו לא היה פרויקט ולכן הקורס לא היה עמוס כלל במהלך הסמסטר. בשיעורי בית אפשרי מאוד לקבל ציון טוב. מבחן קשה, ומתגמל בעיקר אנשים עם תפיסה טובה של גרפים ואינטואיציה בריאה (ולאלו שאין, תוכיחו או תפריחו)\nהקורס חובה לשני מסלולים בתואר שלנו, לכן המלצה לא רלוונטית כאן.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: מאד מעריך שהוא פרסם הקלטות\n\nשם המתרגל/ת: לא הלכתי\nשעורי הבית: סבירים, הרוב מרופרנס/ראיונות דומים\n\nהמבחן: לא פשוט, אבל אותו פורמט כל פעם, אז אפשר להכין את עצמך בצורה טובה ולהצליח\n\nהשורה התחתונה: קורס חובה, מה לעשות. אישית לא התחברתי לחומר\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: יובל עמק מרצה באמת מתחשב, הגיוני, והקורס שלו במקרה הזה מאוד מעניין, יובל יודע להעביר את החומר, לפעמים יורד לרזולוציות מאוד קטנות אבל בסה\"כ נהדר.\nנהנתי בהרצאות שלו, קל להבין על מה הוא ישאל בבחינה.\n\nשם המתרגל/ת: יונתן קוחלי\nחוות דעת - תרגולים: ניתן לומר לחלוטין - אפשר ללמוד את הקורס כולו בעזרת ההקלטות של יונתן.\nיונתן היה מאוד קליל בתרגולים, הוא השרה אווירה באמת טובה, ידע לצחוק ושצריך וידע להיות רציני שצריך גם.\nהקסם ביונתן זה שהוא לא צריך שתסיים את השאלה שלך בשביל להבין איפה הפער שלך בהבנה, והדוגמאות שהוא נותן לרוב מאוד מדויקות.\nבשעת הקבלה הוא היה בערך שעתיים, ענה על כל שאלה, היה אדיב ובמהלך המבחן הסביר לי אישית את השאלה כשהבין שיש פער בהבנה של מה שואלים.\nמתרגל תותח לגמרי, אבל חשוב לומר שגם המתרגל השני ליאם מתרגל מקסים.\n\nשעורי הבית:\nלרוב מרופרנסים, אבל בדיעבד אני חושב שאולי הייתי צריך במהלך הסמסטר לעשות אותן ואז לא הייתי צריך לקבל עומס בסוף הסמסטר לקראת הלמידה במבחן.\n\nהמבחן:\nקשה מאוד לשלוט בעצמך במבחן שכזה מבחינת זה שחייב לבדוק את עצמך,\nכשמתואר אלגוריתם וסיבוכיות, קל להתבלבל וכאן הניקוד השלילי הוא פקטור.\nהעבודה הקשה ביותר שעשיתי בלמידה היא לא ישר לקפוץ על תשובה ברמת האינטואיציה אלא לחקור מה שואלים והאם זה אפשרי, המבחן לדעתי הוגן, מתחילים מ30 נקודות ויש שאלת תרגיל בית מאוד הוגנת.\nבמועד שלנו היה שאלה באמת מורכבת מבחינת צביעת גרפים, אבל אני חושב שהיא הייתה אפשרית למי שהבין את החומר בקורס.\n\nהשורה התחתונה: אחלה קורס, מעניין, הייתי שמח שהם היו זונחים את הנושא החדש של MUTEX שמרגיש קצת כמו הנדסת תוכנה ALLOVERAGAIN\nאני חושב שגם כל הנושא של ניהול תהליכים או גישה לתהליכים פחות רלוונטי, נהנתי מהנושא הלוגי של תורת הגרפים והקשר לבעיות NP או בעיות MIS.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: יובל כמו תמיד מרצה טוב, ההרצאות נגמרות לפני סוף הסמסטר\n\nחוות דעת - תרגולים:\nלא הלכתי וגם קצת מיותרים, תמיד הועברו די מהר ואפשר היה לקרוא אותם יותר מהר, החומר בניגוד למבני היה בנוי בעיקר על ההרצאות\n\nשעורי הבית:\nהשנה לא היה פרויקט, ורק תרגילי בית יבשים היחידים, די סבבה, היה נחמד אם היו רושמים בשיעורי בית מדויק יותר כי הרגיש שקצת זרקו עליהם. השיעורי בית נבדקו על ידי הסטודנטים אבל הועלו פתרונות על ידי צוות הקורס\n\nהמבחן:\nמה יש להגיד על המבחן הזה שלא נאמר\nיש 30% שיעורי בית שזה קל לצדוק, אבל הניקוד השלישי בשאלות נכון לא נכון פשוט מפחיד, קל לקבל 60 קשה לקבל 100\n\nהשורה התחתונה: קצת חבל שבניגוד למבני שם ציפו מאיתנו להשתמש באלגוריתמים ולעשות בניות עליהם, כאן יותר מצפים להבין את המהות שלהם ומצפים להרבה יותר יצירתיות ומה אפשר לעשות בסגנון מה שיוצר מבחן אמריקאי בניגוד למבחן הפתוח במבני\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות:\nיובל מרצה ממש נחמד, אכפתי ופדנטי. ההרצאות בסדר, לדעתי היו נושאים מעניינים יותר (כמו כל הפרק של MIS) ומעניינים פחות.\n\nשם המתרגל/ת: ליאם ברינקר\nחוות דעת - תרגולים:\nבדר\"כ התרגול נגמר תוך גג חצי שעה אבל לדעתי לא בצדק. ליאם לא עשה יותר מדי מאמץ לתזכר את הנושאים מההרצאות שעליהם מועבר את התרגול (ולטעמי זה חשוב), הסביר דברים כאילו הם מובנים מאליהם ועבר עליהם מהר מדי, וזה גם הרגיש כאילו חלק מהזמן הוא דיבר בעיקר לעצמו. הוא כן נתן מקום לשאול שאלות, אבל די קצת ובגלל שהוא עבר כל כך מהר על התרגול לא הספקתי לעכל את מה שצריך כדי להבין מה לשאול בכלל. בסופו של דבר הפסקתי ללכת לתרגולים שלו כי הרגשתי שאני מגיעה סתם ולא מבינה משם כלום.\n\nשעורי הבית:\n4 גליונות בעבודה יחידנית. הם היו די ארוכים בהתחשב בזה שהם לא בזוגות כמו בסמסטרים הקודמים, והם גם די מאתגרים (במיוחד כשאין רפרנס). הסטודנטים בודקים את הגליונות, והמשקל שלהם ביחד מהציון הסופי הוא בין 10 ל-20 אחוזים כאשר הוא גבוה יותר ככל שיותר סטודנטים מתנדבים לבדוק את השאלות (אם יש מספיק בודקים לכל הגליונות אז המשקל הוא 20 אחוז). מה שכן, הגליונות מאוד עוזרים להבין את החומר וגם יש שאלת שיעורי בית במבחן.\n\nהמבחן:\nהמבחנים של יובל הם די עקביים יחסית ובדר\"כ הוגנים, אבל הפעם השאלה של תכנון האלגוריתמים אצלנו הייתה על הפנים. לעומת שנים קודמות, היא כללה הרבה בעיות יחסית (לצורך העניין, בשנים שעברו היו מתקדמים רק בבעיה אחת או שתיים ולנו הוגדרו איזה 5 בעיות) והייתה ברמה הרבה יותר גבוהה מהרגיל. בסעיף הראשון שלה היה גם ניסוח לא ברור כל כך.\n\nחוץ מזה, במבחן יש ניקוד שלילי על כל סעיף שהוא בינארי (נכון/לא נכון). בשאלה של תכנון האלגוריתמים במועד א' שלנו, אם נותנים תשובה שהיא false positive (כלומר אתם עונים שקיים אלג' כשלא קיים בפועל), מקבלים קנס של מינוס 12 נקודות. לכן, אסטרטגיה אפשרית היא לסמן על הכל \"לא קיים\" ולצאת בלי יותר מדי קנס, שזה לדעתי מאוד מביס את המטרה של מבחן.\n\nאציין גם שהיה לנו פקטור, אבל רק למי שקיבל 50 ומעלה במבחן, והוא היה לינארי בציון עד ל-90 בערך, כך שמי שקיבל 90 במבחן קיבל פקטור של 6 נקודות, אבל מי שקיבל ציון נמוך קיבל פחות או כלום (אפשר לראות את ה-peak באזור ה-90 בהיסטוגרמה גם). בחירה מעניינת לפקטור.\n\nהשורה התחתונה:\nקורס מעניין בחלקו עם סגל בסדר, עם תרגילי בית מעניינים אבל כבדים ומבחן קצת קקה.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות: יובל מרצה טוב כמו תמיד, החומר די מוזר לא באמת ברור לי עד עכשיו מה המטרה\n\nשם המתרגל/ת: יונתן קוחלי\nחוות דעת - תרגולים: התרגולים די מיותרים, הם חצי שעה כמעט תמיד ולא באמת קורה שם משהו, שמעתי שיונתן מתרגל טוב אבל זה לא שווה לעלות עד לפקולטה\n\nשעורי הבית: היו 4 תרגילים ביחידים 20%, מבאס שזה ביחידים אבל זה לא כזה נורא, ומקסימום אפשר לחרטט, חבל שהשיעורי בית לא באמת דומים למבחן והרגיש שהסגל קצת זלזל בהם\n\nהמבחן: מה יש להגיד על המבחן בקורס הזה שלא אמרו, הוא בודק יצירתיות יותר מכלום ובניגוד למבני שם מצפים להשתמש באלגוריתמים כאן מצפים יותר להבין את המהות שלהם, וכמעט תמיד הרבה מהחומר מתפספס במבחנים\n\nהשורה התחתונה: קורס מוזר, לא באמת ברור מה המטרה אבל מסורת זו מסורת\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יובל עמק\nחוות דעת - הרצאות:\nאין על יובל, המרצה הכי טוב בפקולטה. זה קורס קשה ועמוס בחומר אבל ההרצאות שלו סופר ברורות וקל להשלים מהן גם אחרי.\nשם המתרגל/ת: לא הלכתי\nשעורי הבית: מציקים, רפרנסתי לרוב.\n\nהמבחן: דירוג שלילי לתשובות לא נכונות:( אפשרי, אבל טריקי\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 78  ב' 68  סופי 79  עמק יובל\nחורף 2023-2024  א' 80  ב' 78  סופי 84  עמק יובל\nאביב 2023       א' 83  סופי 88  הרלב נגה\nחורף 2022-2023  א' 82  ב' 71  סופי 82  עמק יובל\nחורף 2021-2022  א' 83  ב' 75  סופי 82\nאביב 2021       א' 77  סופי 79  עמק יובל\nחורף 2020-2021  א' 76  ב' 76  סופי 81  עמק יובל\nאביב 2020       א' 66  סופי 69  עמק יובל\nאביב 2019       א' 77  ב' 70  סופי 79  עמק יובל\nאביב 2016       א' 76  ב' 71  סופי 79  עמק יובל\nמבחן מועד א': 71\nסופי מועד א': 78\nמבחן מועד ב': 60\nסופי מועד ב': 68\nסופי: 79\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n213 193 20 91 29 100 79.995 83\nאיש סגל תפקיד\nעמק יובל מרצה - אחראי מקצוע\nברינקר ליאם מתרגל\nקוחלי יונתן מתרגל\nשיתוף היסטוגרמות"
  }
}