{
  "course_id": "094142",
  "scraped_at": "2025-12-16T13:16:25.751428",
  "information": {
    "raw_text": "00940142 - תפעול מער' ייצור ושרות\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nסווג מערכות ייצור, מודלים גרפיים ומתמטיים לייצוג מערכות. עקרונות השיבוץ במשטריPOHS WOLF ו- POHS BOJ. מערכות ייצור המוני ומערכות הרכבה. הדינמיקה של מערכות הייצור: מלאי קריטי וקצב צוואר בקבוק, יחסי הגומלין בין מלאי, קצב תפוקה ומשך שהייה בתהליך. משטר HSUP לעומת PRM - LLUP ו- .II PRM ,NABNAK ,PIWNOC ,RBD\n\nמקצועות קדם: 00940139 ו-00940312 ו-00940314\n\nמועד א': 02-02-2026\nמועד ב': 05-03-2026",
    "title": "00940142 - תפעול מער' ייצור ושרות"
  },
  "feedback": {
    "summary": {
      "text": "6 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 2.5,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: בוריס\nחוות דעת - הרצאות:\nהרצאות ממש משעממות\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מתרגלת מעולה ומקצועית\n\nשעורי הבית: ניתן לרפרנס ומקבלים 100 על ההגשה, חוץ מ2 גיליונות שהם לבדיקה מלאה והם חדשים כל סמסטר\n\nהמבחן:\nקשה ולא הוגן. בוריס לא מפרסם מבחנים ישנים ובטח לא את הפתרונות. ממוצע די נמוך לקורס לא קשה בכלל.\nהשורה התחתונה: אם לא חובה אין סיבה לקחת.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: בוריס\nחוות דעת - הרצאות: נחמדות, בוריס קצת מונוטוני וקשה לשמור על ריכוז למשך כל ה3 שעות אבל סך הכל זה סביר.\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מתרגלת בסדר, לא מעבירה הרבה מעבר למה שעושים בהרצאה, פשוט פותרת תרגיל ארוך בנושא ההרצאה.\n\nשעורי הבית: 10 גליונות, רק 2 לבדיקה מלאה, כל השאר בינארי על הגשה. רובם לא קשים במיוחד. לרוב יש רפרנסים.\n\nהמבחן: מזעזע!\nלא תואם לרמה שנלמדה בכלל. שיעורי הבית והתרגולים לא משקפים את רמת הבחינה. ארוך מאוד ואין באמת סיכוי שנסיים אותו ב3 שעות.\n\nהשורה התחתונה: לצערי לא מומלץ. במהלך הסמסטר הקורס בסדר גמור לא מעיק מידי ויחסית מעניין. אבל המבחן פשוט רע!\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: בוריס\nחוות דעת - הרצאות:\nמצאנו הקלטות. הרצאות סבבה. אפשר לראות בכייף על 1.5 ולעצור אם יש משהו חשוב .\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מצאנו הקלטות. ראיתי מוקלט\nמתמצת את החומר\n\n\nשעורי הבית: רפרנסים ונהנים. יש גליונות לבדיקה שהם ממבחני עבר וחלק לא לבדיקה\n\nהמבחן: היה קשה מאוד אבל נבדק ברחמנות\n\nהשורה התחתונה: סבבי לא לפחד יהיה בסדר\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: בוריס\nחוות דעת - הרצאות: בוריס איש נחמד מאוד אבל לצערי היה לי קשה להישאר ערה מול ההקלטות שלו. פשוט מונוטוני מאוד ולא ברור למה לומדים את מה שלומדים. אבל! זה עניין של טעם אישי\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: אירנה די מחזיקה את הקורס על כתפיה, התרגולים מאוד תמציתיים אבל אירנה עצמה אכפתית ומוכנה לעזור.\n\nשעורי הבית: לא עמוסים בכלל, שתי הגשות חובה בלי רפרנס (בדיקה רחמנית) וכל השאר גם עם רפרנס וגם ציון בינארי על ההגשה.\n\nהמבחן: קשה עד מוות. אין מבחני עבר ללמוד מהם. לא ברור איך אבל הוצאתי בו ציון טוב, מה שמראה לדעתי שהדבר המרכזי החשוב הוא להסתמך על דף הנוסחאות של אדוה ויונטה ולנסות לחרטט בביטחון.\n\nהשורה התחתונה: לא לקחת אם לא חייבים, קורס די משמים. אבל הצוות אכפתי.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: בוריס\nחוות דעת - הרצאות: פחות מונוטוני בפרונטלי מאשר בהקלטות, אז כדאי לבוא פרונטלי. מרצה מצויין ורואים שהוא אוהב את החומר שאותו הוא מלמד.\n\nשם המתרגל/ת: אירנה\nחוות דעת - תרגולים: מתרגלת מעולה ואכפתית.\n\nשעורי הבית: גיליונות שבועיים לא קשים במיוחד. עזרו להבנת החומר ורק שניים מתוכם לבדיקה מלאה. אם ממש רוצים יש רפרנס.\n\nהמבחן: מבחן מאכזב לצערי. אין מבחני עבר ללמוד מהם כל כך, כך שלא מאוד ידענו למה לצפות, אבל גם מה שכן נחשפנו אליו לא הכין אותנו למבחן. לאתגר את הסטונדטים זה משהו אחד אבל להכניס לכל נושא בבת אחת את כל המקרים המיוחדים שיכולים להיות זה רמה אחרת לגמרי. בטח לא ברמת שיעורי הבית וכל מה שעשינו לאורך כל הסמסטר. נקווה לפקטור.\n\nהשורה התחתונה: הסגל מקסים ובאמת נהניתי מהחומר הנלמד אבל המבחן הרס את כל הקורס בעיניי וחבל ממש :(\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 70  ב' 63  סופי 70  שניץ בוריס\nחורף 2023-2024  א' 70  ב' 64  סופי 71  שניץ בוריס\nחורף 2022-2023  א' 70  ב' 70  סופי 73  שניץ בוריס\nחורף 2021-2022  א' 69  ב' 66  סופי 71\nאביב 2021       א' 69  ב' 65  סופי 69\nחורף 2020-2021  א' 65  ב' 65  סופי 67  שניץ בוריס\nאביב 2020       א' 69  ב' 72  סופי 73  שניץ בוריס\nחורף 2019-2020  א' 67  סופי 67  שניץ בוריס\nאביב 2019       א' 69  ב' 69  סופי 72  שניץ בוריס\nחורף 2018-2019  א' 78  ב' 70  סופי 78  בן אריה דוד\nחורף 2017-2018  א' 75  סופי 76  ידידציון לירון\nאביב 2017       א' 74  ב' 65  סופי 76  ידידציון לירון\nסופי מועד א': 70\nסופי מועד ב': 63\nסופי: 70\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n39 35 4 90 48 88 70.778 72.5\nאיש סגל תפקיד\nשניץ בוריס מרצה - אחראי מקצוע\nגורפינקל אירינה מתרגל\nשיתוף היסטוגרמות"
  }
}