{
  "course_id": "094704",
  "scraped_at": "2025-12-16T13:12:39.832613",
  "information": {
    "raw_text": "00940704 - סדנת תכנות בשפת סי\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 1.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nתכנות בשפת סי לאלו שלמדו לתכנת בפייתון. משתנים וטיפוסים. מבני בקרה. פונקציות. מערכים. מצביעים. ניהול זיכרון דינאמי. קלט פלט. מבנים.קריאות למערכת ההפעלה.\n\n\nמקצועות צמודים: 02340221\n\nמקצועות ללא זיכוי נוסף (מכילים): 02340112 02340114 02340117\n\nמועד א': 03-02-2026\nמועד ב': 05-03-2026\n\nהערות: מקצוע צמוד: 234221",
    "title": "00940704 - סדנת תכנות בשפת סי"
  },
  "feedback": {
    "summary": {
      "text": "22 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם אשר כהן\nחוות דעת - הרצאות: מרצה לא ממש ברור וההרצאות די מבולגנות\n\nשם המתרגל/ת: ראניא\nשעורי הבית: 3 תרגילים תכנותיים בשפת סי. לא קשים במיוחד אבל הבדיקה זוועתית (ניסוחים משתנים ברגע האחרון, לא מספקים טסטים לבדיקה)\n\nהמבחן: במודל, חצי אמריקאי וחצי כתיבת קוד\n\nהשורה התחתונה: לא עמוס במיוחד אבל ציון שיעורי בית תקף וקוטלים בבדיקה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם אשר כהן\nמרצה מאוד נחמד ואכפת לו מסטודנטים.\nחוות דעת - הרצאות: קשה לעקוב, הבעיה העיקרית הייתה שהמצגות מבולגנות ולא מכילות את החומר אלא רק שמות הנושאים בקצרה. מומלץ מאוד לכתוב סיכומים והערות.\n\nשם המתרגל/ת: ראניה חורי\nמסבירה מעולה.\nחוות דעת - תרגולים:\nשעה אחת כל תרגול, קצרים אבל מלאים בחומר (מומלץ לנסות לפתור את התרגילים לבד אחרי התרגול כי עוברים עליהם ממש זריז).\n\nשעורי הבית: 3 שיעורי בית.\nקשים, אבל מאוד חשובים להבנה.\nמומלץ להשקיע בהם מאוד ולבדוק את כל מקרי הקצה (30% מגן).\n\nהמבחן: קשה.\nהמבחן היה קשה, הסיבה היא שלא ידענו על מה להתרכז, מומלץ לעבור על כל הבאגים שהוצגו בהרצאות ולוודא שהבנתם אותם.\n\nהשורה התחתונה: בטוח שבסמסטרים הבאים הקורס יהיה יותר מסודר. העומס בקורס היה לדעת איך להתמודד עם שיעורי בית כי ממש היו מסובכים וצרכו הרבה זמן (בעיקר הש.ב האחרון).\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: ההרצאות ממש לא ברורות ולא מעוררות עניין. קשה לעקוב.\n\nשם המתרגל/ת: ראניא\nחוות דעת - תרגולים: בינוני מינוס.\n\nשעורי הבית: אין שום פורופציה בין היקף שיעורי הבית לבין העובדה שמדובר בקורס של 1.5 נק\"ז, לוקח שעות ומורידים בבדיקה על שטויות.\n\nהמבחן: חלק אמריקאי וחלק כתיבת קוד. בחלק האמריקאי הרבה מאוד שאלות מכשילות.\n\nהשורה התחתונה: מי שלא חייב לעשות את הקורס - ממליץ להימנע.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם אשר כהו\nחוות דעת - הרצאות: על הפנים. איטי וקשה, לא היה ברור כלל. מצגות לא מסודרות, חומר לא מסודר ולא מובן.\nיצאנו עם כמעט אפס ידע ומבלי להבין מה קרה בקורס.\n\nשם המתרגל/ת: רניא\nחוות דעת - תרגולים: חמודה מאוד, משתדלת להסביר ולבוא לקראת הסטודנטים.\n\nשעורי הבית: קשים!!!!!!!!!!!! קורס של 1.5 נק\"ז וכל תרגיל בית לקח שעות על גבי שעות ובכלל לא תאם את הרמה.\n\nהמבחן: קשה מאוד ברמה ששאלות בוטלו כי פשוט אף סטודנט לא ענה עליהן נכון.\n\nהשורה התחתונה: קורס שרק התחיל ויש עוד הרבה מה לשפר בו\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם אשר כהן\nחוות דעת - הרצאות: מבולגן ולא ברור\n\nשם המתרגל/ת: ראניא\nחוות דעת - תרגולים: לא וואו\n\nשעורי הבית: 3 הגשות, הראשונה קלילה והשתיים האחרות לא פשוטות. בדיקה זוועתית\n\nהמבחן: שילוב של שאלות אמריקאיות ותכנותיות, שאלות ברמה גבוהה שלא משקפות את הרמה שנלמדה במהלך הסמסטר\n\nהשורה התחתונה: הקורס עצמו לא באמת עמוס כי הוא מתחיל רק באמצע הסמסטר והוא לא דורש הרבה זמן של למידה למבחן, אבל כמות ההשקעה הדרושה לשיעורי הבית לא מצדיקות שהקורס יהיה שווה רק נקודה וחצי שזה *אפילו פחות ממל\"ג*.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: הרצאות מונוטוניות ומשעממות, מאוד תאורטיות ואין כמעט שום דבר פרקטי. חייב להקשיב כי בסוף רוב המבחן הוא תאורטי\nהתרגולים היו מיותרים- קריאה של המתרגלת מהמצגת..\n\nשעורי הבית: יש 3 תרגילי בית (פרקטיים של כתיבת קוד). השניים הראשונים היו סבירים. השלישי היה קשה מאוד ולקח המון זמן\n\nהשורה התחתונה: מי שאין לו רקע בתכנות אז השיעורים מאוד קשים עד בלתי פתירים\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: למדתי מהקלטות שלו משנה שעברה. נועם מרצה מצויין אבל הקורס עצמו הוא קפיצה ממש משמעותית ברמה לעומת קורס מבוא למדמח. הקורס מתחיל באמצע הסמסטר ורואים שהם ניסו לדחוס כמה שיותר חומר בזמן מאוד קצר אז זה מאוד הקשה.\n\nשעורי הבית: 3 מטלות להגשה בזוגות. דורשות הבנה רצינית של החומר.\n\nהשורה התחתונה: אם יש לכם רקע בתכנות, אולי יהיה לכם קצת יותר קל מלאחרים אבל מומלץ להיעזר בכמה שיותר מקורות כדי להבין את החומר כי קשה להבין אותו מההרצאות בזמן כל כך קצר.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נועם כהן\nחוות דעת - הרצאות:\nמונוטוני ודי משעמם, אבל נאמרים דברים חשובים מאוד. שווה להקשיב כדי להצליח במבחן.\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים:\nתרגול של שעה, די מיותר במהותו. אפשר לקרוא את המצגות לבד.\nשעורי הבית:\nקשים, בדיקה לא הוגנת. הורדת נקודות על דברים שלא נאמרים בשאלה עצמה.\nהמבחן:\nהוגן.\nהשורה התחתונה: קורס עם שעורי בית מעצבנים, אבל סך הכל די נחמד\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נעם\nחוות דעת - הרצאות: לנעם יש לב זהב אבל אין צורך להגיע, עדיף לפני המבחן לתפור את ההקלטות\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: כנל לא תרמה לכלום, לקרוא מהמצגת גם ילד ביסודי יודע\n\nשעורי הבית: היו 3 תרגילים, ה2 הראשונים סבבה (צריך ללמוד את השפה לבד) תרגיל 3 לא היה ניתן לפתירה ללא ניסיון רציני קודם\n\nהמבחן: לא משקף יותר מידי מה שנלמד תתפללו שתהיה בדיקה מקלה\n\nהשורה התחתונה: קורס מיותר לחלוטין לא יצאתי עם שום ידע, אולי רק איך עושים לולאות בסי\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נעם כהן\nחוות דעת - הרצאות: רואים שאכפת וחשוב לו אבל לא מצליח להבין מה קשה לסטודנטים ועל מה להתעכב. ממליץ לשאול הרבה שאלות תוך כדי. לומדים הרבה מהגוגל כי קשה לתפוס בהרצאות את החומר והמבחן מחפש הבנה עמוקה\n\nשם המתרגל/ת: גילת טוקר\nחוות דעת - תרגולים: הכרחיים- תרגול של שעה שלומדים בו חומר שלם. לפעמים קשור להרצאות, לפעמים קשור לשיעורי בית. מפיל הרבה נקודות והכי חשוב אשכרה פרקטי.\nהמתרגלת מקסימה, מאוד תכלסית. אצלנו העלו הקלטות משנה שעברה היו משמעותית פחות מוצלחות.. אולי שווה לבקש(אם יש) את ההקלטות של גילת.\n\nשעורי הבית: קשים. אני בא בלי רקע והתקשתי מאוד. מה שכן, עכשיו אני מבין שלמדתי מלא מהשיעורי בית האלה ואשכרה יכול לתכנת ב c. אז עם כל הקושי, ממליץ להשקיע\n\nהמבחן: טריקי. חצי פתוח וחצי סגור. צריך הבנה עמוקה של החומר\n\nהשורה התחתונה: קורס חשוב, סגל שרואים שאכפת לו. ממליץ להשקיע במהלך הסמסטר כדי לראות תוצאות במבחן\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: מאוד ממליצה לסכם כי המצגות לא כתובות בצורה שאפשר לעבור עליהן לבד אחרכך. היה לי מאוד חסר סיכומים לקראת המבחן. הוא חצי סמסטר, מתחילים משבוע 6 בערך. הוא לא מסביר את השפה באופן של מתחילים לגמרי, מצפה שאנשים ידעו חלק כי לולאות וif statements זה משהו שקיים גם בפייתון למשל\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: חמודה ומסבירה טוב. נותנת המחשות טובות.\n\nשעורי הבית: בזוגות ותפנו להם זמן, הם לא קלים. בעיקר למי שלא יודע סי בהתחלה להשתמש הרבה באינטרנט כי לא מסבירים לפני ממש לעומק את הכתיבה כמו שעושים בקורס של פייתון.\n\nהמבחן: בסדר אבל לא קל. הוא העלה מבחנים לדוגמא לפני המבחן והיו שאלות שהוא לקח משם אז מומלץ לפתור אותם. לתרגל קוד למרות שהמבחן בכתב יד, להבין הזזות וביטים.\n\nהשורה התחתונה: קורס לא קל בכלל, לא להתייאש ולמרות שרוצים מאוד לפעמים. GEEKS FOR GEEKS עוזר תמיד\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: מבלבלות, לא מובנות, לא מסודרות. זוועה\n\nשם המתרגל/ת: נאור\nחוות דעת - תרגולים:\nנראה ששולט בחומר, אין הרבה מה לומר\n\nשעורי הבית:\nלקחו כמה שעות...\nהמבחן:\nזוועה, נועם אוהב לרשום מגילות ולא יודע להגיע לפואנטה...\nהשורה התחתונה:\nקורס קשה למי שאין לו ניסיון. ניתן לעבור עם ציון טוב כי יש מגן גבוה(30 אחוז), לפחות ככה היה הסמסטר, לא יודע מה יהיה בעתיד. אם ניתן ללמוד לפני קצת C כדי לקבל ניסיון, אז מומלץ. רואים שלמי שאין ניסיון היה הרבה יותר קשה.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "חוות דעת - הרצאות:\nמרצה לא יודע להסביר לא מובן כלום מההרצאות שלו\n\nחוות דעת - תרגולים: לא קשורים להרצאות\n\n\nהמבחן: לא תלוי בכלל בתרגולים\n\nהשורה התחתונה: בזבוז זמן של קורס\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: נעם\nחוות דעת - הרצאות: ההרצאות מאוד מעניינות ורואים שנעם היה בתעשייה הרבה זמן ויש לו ידע וניסיון רחבים מאוד אבל ההרצאות לא נוגעות כמעט בחלק המעשי של התכנות.\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: מכירה את החומר ברמה גבוהה ומלמדת את הצד המעשי יותר של השפה.\n\nשעורי הבית: ברמה נמוכה בהרבה ממה שציפיתי\n\nהמבחן: הוגן מאוד ביחס לזה שזה חצי קורס\n\nהשורה התחתונה: מנסים לדחוף חומר של קורס שלם לחצי סמסטר והרמה די בהתאם לכן ניתן להוציא ציון טוב.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "חוות דעת - הרצאות: די מיותרות. פשוט תקראו את המצגות בבית.\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: רוב התרגולים מיותרים אולי חוץ משני האחרונים. שוב הכל במצגות.\n\nשעורי הבית: סבבה לגמרי. לא קשים בכלל. יש מספיק זמן להגיש.\n\nהמבחן: לא בהכרח קשה, אבל יש ממש קצת שאלות כך שכל אמריקאית היא 15 נק'. בעיקר המבחן בודק הבנה של איך השפה בנויה מאשר איך לרשום קוד.\n\nהשורה התחתונה: קורס סבבה לגמרי.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: הרגשתי שהלכתי לאיבוד הרבה פעמים - לפעמים קשה לעקוב ולהבין את נועם. רואים שהוא מבין לעומק את החומר, הלוואי והיה מצליח להעביר לנו את הידע שלו :O\nבמבחן היו דיי הרבה שאלות על נושאים מההרצאות, ממליץ לנסות ולעקוב.\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: ממש טובים. דווקא בתרגולים הרגשתי שאני כן מצליח לעקוב. היא לא עוברת בדיוק על החומר של ההרצאות אבל על אותם נושאים. אם מבקשים ממנה היא מחדדת נקודות מההרצאה - לי זה עזר.\n\nשעורי הבית: ארוכים. המתרגלת אמרה שהם יהיו דיי קלילים... בפועל זה היה דורשני. תקדישו לזה זמן.\n\nהמבחן: קשהההה :(\nהרגשתי שאני בא מוכן לבחינה וחצי מהשאלות בסוף הימרתי. היה פאקטור דיי משמעותי\nנקווה שמועד ב' ילך טוב יותר.\n\nהשורה התחתונה: קורס קשה, רק חצי סמסטר, סגל מתחשב.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: מר כהן נועם אשר.\nחוות דעת - הרצאות: אדם מדהים, מעט מפוזר. ההרצאות לא באמת קשורות לתרגולים, אך מאפשרים להבין באמת איך השפה עובדת וכיצד המחשב עובד.\n\nשם המתרגל/ת: גילת.\nחוות דעת - תרגולים: מתרגלת מושלמת! חבל שזו השנה האחרונה שלה.\n\nשעורי הבית: מאפשרים להבין את החומר, קשים מאוד אך בזכותם הידע גדל.\n\nהמבחן: קשה, אך הגיוני.\n\nהשורה התחתונה: הקורס מעניין והכרחי. לא עמוס, אך כולל למידה והסברה עצמית. בנוסף, ממש קל לעומת שאר המקצועות באותו הסמסטר.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות:\nבן אדם עם לב זהב וכל כך הרבה אהבה למקצוע. במצגות יש רק כותרות וצריך לשים לב לכל השגיאות הקטנות שהוא מדבר עליהן בהרצאות.\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים:\nסבבה\n\nשעורי הבית: 2 עבודות לא קלות למי שאין רקע\n\nהמבחן: כל המבחן טריקים ודברים קטנים מההרצאה אז לשים לב!! הקורס יחסית חדש אז אין מספיק מבחני עבר ומאוד קשה להיות מוכנים למבחן אבל בסוף עוברים אותו.\n\nהשורה התחתונה: לא נורא בכלל\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: על הפנים\nבנאדם לא מחובר למציאות.\nההרצאות לא פרקטיות בשום צורה לביצוע השיעורי בית או למידה למבחנים. נועם מאוד מפוזר ואין שום רצף לוגי בהסברים שלו, המצגות מאוד דלות, אין דוגמאות לקונספטים שהוא מדבר עליהם ואם יש דוגמאות הן ממש לא מובנות והוא גם לא יודע להסביר מה רואים בדוגמה.\nסה\"כ:0/10 (לקרוא לו מרצה זו הגזמה)\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: בסדר\nפשוט מקריאה מהמצגת. אצלה לפחות מצגת קצת יותר מפורטת ומובנת. על הפנים מבחינת משוב על השיעורי בית.\nסה\"כ: 6/10\n\nשעורי הבית: חשובים מאוד! תעשו\nהם בלי שום קשר לרמה ולחומר שנלמד בתרגולים ובהרצאות בפרט. אבל הם מעלים משמעותית את ההבנה והרמה ולכן מאוד חשוב לעשות ולהשקיע.\n\nהמבחן: תלוי.\nאם למדתם לבד מהאינטרנט וחיברתם את הנקודות מההרצאות והתרגולים והגעתם לשעות קבלה כדי לקשור הכל אתם בטוב. אם הסתמכתם רק על ההרצאות והתרגולים אתם בבעיה רעה!\n\nהשורה התחתונה: קורס מעפן\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: נועם כהן\nחוות דעת - הרצאות: לב זהב, אכפת לו מהסטודנטים אבל אי אפשר להבין מההרצאות שלו כלום, במיוחד אם הגעתם לקורס בלי רקע בתכנות.\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: סביר\n\nשעורי הבית: קשים מאוד ומנותקים מהקורס, אבל תשקיעו בהם כי זה מגן ממש חשוב\n\nהמבחן: לא מובן, אבל אפשרי מאוד לעבור\n\nהשורה התחתונה: קורס לא משהו\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: באתי בהתחלה לאיזה 3 הרצאות ואז הפסקתי. נועם ממש נחמד וממש איכפת לו אבל לא אהבתי אותו כמרצה. הוא איטי ולא מובן, המצגות באנגלית ויש בהן רק נקודות שעוברים עליהן ככה שאי אפשר ללמוד מהן כל כך לבד.\nראיתי סרטונים באנגלית במקום.\n\nשם המתרגל/ת: גילת\nחוות דעת - תרגולים: סבבה. מסבירה טוב ועונה על שאלות.\n\nשעורי הבית: היו לנו רק 2 אז לא עמוס אבל כן קשוחים במיוחד לכאלה בלי ידע קודם בתכנות. אבל ממש חשוב להבנה של החומר ולמגן אז תשקיעו!\n\nהמבחן: יש במבחן יותר שאלות על הבנה של איך הרצת הקוד עובדת ועל שגיאות הרצה וכאלה יותר מאשר על קוד. אז תלמדו את זה כמו שצריך. תסתכלו במבחני עבר (שאין הרבה כאלה) ותבינו. אפשר לחפש באינטרנט עוד תרגול בסגנון. חשוב להבין רשימה מקושרת ופויינטרים.\nהשורה התחתונה: חומר בסיסי וחשוב, לא קשה, אפשר לעבור עם ציון טוב.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 68  ב' 67  סופי 75  כהן נועם אשר\nחורף 2023-2024  א' 74  ב' 68  סופי 77  כהן נועם אשר\nחורף 2022-2023  א' 72  ב' 75  סופי 78  כהן נועם אשר\nחורף 2021-2022  א' 73  ב' 61  סופי 78  כהן נועם אשר\nחורף 2020-2021  א' 72  ב' 64  סופי 73\nמבחן מועד א': 60\nסופי מועד א': 68\nמבחן מועד ב': 67\nסופי מועד ב': 67\nסופי: 75\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n69 58 11 84 27 100 75.101 78\nאיש סגל תפקיד\nכהן נועם אשר מרצה - אחראי מקצוע\nטוקר גילת מתרגל\nשיתוף היסטוגרמות"
  }
}