{
  "course_id": "096807",
  "scraped_at": "2025-12-16T13:38:11.395100",
  "information": {
    "raw_text": "00960807 - יזמות חברתית\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nשיטות וכלים לפיתוח וליישום של אסטרטגיות ומודלים עסקיים המובילים ל- NIW-NIW, תוך התחשבות ב: בעלי המניות, .ENIL MOTTOB ELPIRT תוצאות למידה: עם סיום הקורס הסטודנט 1. יכיר מודלים עסקיים חדשים המכוונים לרווחתם של בעליהענין השונים של הארגון. 2. יכיר ויבין את המורכבות ביישום מודלים אלה. 3. יכיר מיזמים חברתיים שיפותחו במהלך הקורס. 4. יכיר מושגי מפתחוכלים (כגון: EVITAREPOOC WEN EHT ,ROTCES HTRUOF EHT ,ENIL MOTTOB EERHT EHT NIAHC TIFORP ECIVRES EHT ,SAVNAC NAEL ,YGOLODOHTEM PUTRATS NAEL EHT .GNIKRAMHCNEB DNA",
    "title": "00960807 - יזמות חברתית"
  },
  "feedback": {
    "summary": {
      "text": "4 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: משה\nחוות דעת - הרצאות: קורס נחמד, יש נוכחות חובה בהרצאות (4 שעות כי זה הרצאה+ תרגול ברצף אבל בפועל זה רק הרצאה), עושים מיזם לאורך הפרויקט ובסוף מציגים, המיזם קצת מעמיס. משה המרצה ממש מקסים ויש אווירה טובה.\n\nשם המתרגל/ת: יעל\nהמבחן: אין\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: Moshe\nחוות דעת - הרצאות: The lectures are interesting for the first minutes but really turned to be boring after one hour , the quizz on kahoot are very oriented to the point of view of Moshe despite the fact that several times students prove him wrong\nMoshe is a nice person but actually dont bring any value to Entrepreneurship and his help during the project was very small not saying none ....\nשם המתרגל/ת: Yael\nחוות דעת - תרגולים: Don't have any tutorials , just here to check if somebody is missing\n\nשעורי הבית: None\n\nהמבחן: 2-3, we have a project during the year with a group of 3-5 people ,they are grading several little submissions without giving any justifications to the the grade and not accepting appeal\n\nהשורה התחתונה: Course not very interesting, getting a 80+ easily but after that very depend on Moshe and Yael appreciation , there is other courses without exams more interesting with more experienced teacher\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: משה\nחוות דעת - הרצאות: המרצה בן אדם מאוד סימפטי אבל זה לא מספיק כדי לקחת קורס של 4 שעות כל שבוע. מלמדים די מעט, חוזר הרבה על עצמו והמרצה נותן רק נקודת מבט אחד שהיא שלו. כל נקודת מבט אחרת לא מתקבלת וזה חבל כי יזמות אינה תפיסה יחידה. תכלס, עדיף לקנות ספרים על הנושא תלמדו יותר, בפחות זמן, בצורה יותר מגוונת.\n\nשם המתרגל/ת: יעל\nחוות דעת - תרגולים: אין תרגול בקורס. היא ביקר כאן כדי לראות מי נוכח ומי לא וכדי לתת ציונים על פרזנטציות למרות שהיא לא תמיד נכחה בהם.\n\nשעורי הבית: יש פרוייקט חברתי שעובדים עליו כל הסמסטר בקבוצות.זה מעניין אבל התגמול לא מתאים להשקעה.\nשתי אופציות: או שהלכתם אחרי כל השטויות שהם אמרו או שתנסו להיות קצת יותר יצירתיץ במקרה הראשון תקבלו ציון שרירותי, במקרה השני תקבלו ציון פח לא מוצדק והסגל יצדיק את זה עם הרבה שטויות. בתכלס אין באמת \"סולם מדידה\" זה נטו התרשמות כללית של האנשים ולא של העבודה שלהם. מה שיוצא שהם \"לא אוהבים את הפרצוף שלכם\" אכלתם אותה...\n\nהשורה התחתונה: פשוט תעשו טובה לעצמכם על תקראו את הקורס הזהץ זה בזבוז זמן. יש קורסים אחרים על יזמות בטכניון בפח יותר טובים. הנושא מאוד מעניין אבל הצורה שזה מועבר היא גרוע. לפי דעתי, זה לא התוכן עצמו אלה אופן ההוראה שאינו מתאים. אתם תשקיעו מלא בפרויקט שאתם מעכרים כי הוא באמת משפר את חיי האנשים האחרים ולא תקבלו בתמורה כלום מהסגלץ לעומת זאת, יש שעשו פרויקט ממה בינוני ויקבלו ציון יותר טוב סתם כי הם מצאו חן בעיני הסגל\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2022-2023  א' 87  סופי 88  דוידוב משה\nחורף 2021-2022  א' 87  סופי 87  דוידוב משה\nחורף 2020-2021  א' 88  סופי 88  דוידוב משה\nסופי מועד א': 87\nסופי: 88\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n25 25 0 100 84 93 88 87\nאיש סגל תפקיד\nדוידוב משה מרצה - אחראי מקצוע\nזיו דוד מורן סגל מנהלי - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}