{
  "course_id": "096475",
  "scraped_at": "2025-12-16T13:42:56.983007",
  "information": {
    "raw_text": "00960475 - תכנון ניסויים וניתוחם\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 2.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nבמקצוע זה יוצגו ניסויים מתוכננים נוספים לאלה שידונו במקצוע הקדם, סטטיסטיקה תעשייתית (096414). הנושאים יכללו: הסדרה N3 וניסויים חלקיים בסדרה זו, טיפול בגורמים אקראיים בנוסף לגורמים קבועים, מדידות חוזרות ( SERUSAEM DETAEPER ), ניתוח שונות רב משתני ( ( AVONAM וניתוחעם משתני לוואי.\n\nמקצועות קדם: 00940424 או 00940423 או 00940481 או 00460010",
    "title": "00960475 - תכנון ניסויים וניתוחם"
  },
  "feedback": {
    "summary": {
      "text": "6 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "כותבת למען מי שרוצה לקחת את הקורס באביב הקרוב\nשם המרצה: גקי\nחוות דעת - הרצאות: נראה שאיכפת לה מהסטודנטים, אבל השיעורים איתה כלכך משעממים, היא מבולגנת וחופרת יותר מידי והחומר עצמו משעמם, מזל שהיא מעלה הקלטות. אנחנו עכשיו בשבוע 10 של הסמסטר ועדיין לא החזירה לנו אף מענה על שום דבר שהיגשנו.\n\nשם המתרגל/ת: גקי\nשעורי הבית: יש 3 פרויקטים, הפרויקט הראשון היה נחמד ולא גדול מידי. הפרויקט השני עדיין לא התחלנו בו (היא אישרה את הפרויקטים בשבוע שעבר- ואנחנו נמצאים בשבוע 10) והגשת הפרויקט השלישי היא לתקופת המבחנים. נתנה בנוסף 2 שיעורי בית באמצע הסמסטר אחד קליל והשני דורש קצת עבודה)\n\nהמבחן: אין\n\nהשורה התחתונה: הקורס מתבסס על ניתוח תוצאות הניסויים באמצעות תוכנה שנקראת jmp. הקורס לא עמוס במהלך הסמסטר אבל הוא בכלל לא מעניין (בשבילי לפחות) לקחתי אותו כבחירה פקולטית ומקווה שלא אתאכזב מהציוינם (היא הבטיחה לנו ציוינם גבוהים בקורס הזה) :) אעדכן בהמשך\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: ג'קי\nחוות דעת - הרצאות: לזכותה יאמר שפרסמה הקלטות, אבל נראה שזה לא משהו שהיא נוהגת לעשות. ההרצאות מאוד מבולגנות, קשה מאוד לעקוב מה שייך למה ומה רלוונטי.\n\nשעורי הבית: זה התחיל מזה שהיא נתנה תרגיל בית חמוד תמים ונחמד להתחלה ומשם הכל הדרדר - נתנה עוד פרויקט במהלך הסמסטר (סבבה סטנדרטי) ואז לפתע גם פירסמה איזו משימה שהיא בעיקרון הייתה לעשות בדיוק מה שהיא עושה בהרצאה ב-JMP אבל בבית, מבולגן לא ברור וגוזל זמן רציני. בסוף גם גילינו שיש עוד פרויקט לתקופת מבחנים\n\nהמבחן: אין\n\nהשורה התחתונה: אני לא ממש למדתי משהו מהקורס הזה ובאתי עם ציפיות גבוהות. התסכול של לנסות להבין מה צריך לעשות ומה היא אומרת ומה חשוב לא שווה את הציון האולי גבוה\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: גקי\nחוות דעת - הרצאות: מועברות טוב\n\nשעורי הבית: הוגנים ורלוונטיים\n\nעבודה מסכמת: הוגנת והרלוונטית לנושא הקורס\n\nהשורה התחתונה: קורס מוצלח נסיונאים\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "חוות דעת - הרצאות:\nלמרצה לממדת באופן שיטתי ומכבד. מאוד חשוב לה להעביר את החומר באופן ברור.\nחוות דעת - תרגולים:\nתרגולים משולבים עם הרצאות\nשעורי הבית:\nתואמיים את החומר הנלמד בקורס\nהמבחן:\nאין מבחן\nהשורה התחתונה: מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: ג'קי אשר\nחוות דעת - הרצאות:\nההרצאות די מבולגנות. החלקים המעניינים הם דווקא כשג'קי מתחילה לגלוש לנושאים אחרים ומאבדת את חוט המחשבה המקורי שלה. זה לא שלא למדנו משהו במהלך הסמסטר, אבל לא תמיד היה קו מקשר בין הדברים.\n\nשם המתרגל/ת: ג'קי אשר\nחוות דעת - תרגולים:\nתכל'ס אין באמת תרגולים, זה המשך ישיר של ההרצאה. לפעמים היא נותנת עבודות כיתה (\"סדנא\") כדי שזה ייחשב כתרגול.\n\nשעורי הבית:\nמעט מאוד, בצורה די ספוראדית. עד עכשיו (אנחנו כבר בשבוע שלישי של הסמסטר *אחרי*) היא עוד לא נתנה עליהם ציון\n\nהמבחן:\nאין\n\nהשורה התחתונה:\nקורס קצת מוזר.\nמבחינת צבירת נקודות זכות במעט מאמץ - אחלה קורס.\nמבחינת ציון - אין לי מושג. אנחנו כבר אחרי תחילת הסמסטר הבא ועוד אין ציונים (להבנתי זה משהו קבוע אצלה).\nמבחינת למידה - לפעמים חשוב ומעניין, אבל לא מצדיק קורס שלם.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nאביב 2025       א' 94  אשר ג'קי\nחורף 2024-2025  א' 93  סופי 93  אשר ג'קי\nחורף 2023-2024  ב' 93  סופי 93  אשר ג'קי\nסופי מועד א': 94\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n11 11 0 100 92 99 94.455 94\nאיש סגל תפקיד\nאשר ג'קי מרצה - אחראי מקצוע\nשיתוף היסטוגרמות"
  }
}