{
  "course_id": "096275",
  "scraped_at": "2025-12-16T13:43:31.167594",
  "information": {
    "raw_text": "00960275 - הגורם האנושי באיסוף נתונים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקנית עקרונות ושיקולים באיסוף מידע מבני אדם בדגש על שיקולים מנקודת מבט של הנשאל, כולל יכולות ומוגבלויות קוגנטיביות המשפיעות על עיצוב המשימות ומוטיבציה למתן תגובות וסוגיות אתיות. תכנון בדיקות איכות לנתונים. הקורס מרכז תכנים רלוונטים מתוך מבוא לפסיכולוגיה, הנדסת גורמי אנוש, שיווק וניתוח נתוני עתק. תוצאות למידה: בסיום הקורס הסטודנט: 1. יכיר שיטות לאיסוף נתוני עתק מאנשים 2. יבין את מגבלות הקוגניציה האנושית באספקת נתונים 3. ידע כיצד בוחרים קהל יעד למניעה הטיה באיסוף נתונים. 4. יכיר סוגיות אתיות באיסוף נתונים.\n\nמקצועות קדם: 00960411 או (00940201 ו-00940423) או (00940423 ו-00940700) או (00940700 ו-00940424)\n\nמקצועות ללא זיכוי נוסף (מוכלים): 00940140 00950618\n\nמקצועות ללא זיכוי נוסף: 00960620",
    "title": "00960275 - הגורם האנושי באיסוף נתונים"
  },
  "feedback": {
    "summary": {
      "text": "26 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 1.5,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: די משעממות\n\nשם המתרגל/ת: תרצה ורום\nחוות דעת - תרגולים: כנל\n\nשעורי הבית: כנל\n\nהמבחן: מציק\n\nהשורה התחתונה: משעמם ומציק\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: תרצה\nהשורה התחתונה: לא ממליץ בתור בחירה, אלא אם הנושא של הנדסת גורמי אנוש מעניינת אתכם\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: משעממות, מצריכות השתתפות בצורה לא נעימה,\n\nשם המתרגל/ת: תרצה\nחוות דעת - תרגולים: שימושיים לתרגילי הבית אך לא הכי מעניינים\n\nשעורי הבית: בזבוז של זמן, מציקים, לא נוחים.\n\nהשורה התחתונה: קורס חובה שצריך לרדת מהסילבוס. הייתי אומר שהוא לא מומלץ אבל אין ברירה לקחת אותו אז מה זה משנה.\nשיעורי בית מציקים ולא רלוונטיים, חומר משעמם ובכללי קורס לא קשור ונדחף שלוקח יותר זמן ממה שמגיע לו.\nחייב לבצע גם 2 ניסויים עבור נקודת קרדיט, מוגזם.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות: הרצאות בזום, רקפת הכריחה להדליק מצלמות (לדעתי יתרון, הקורס שסטודנטים ממש השתתפו). היא מסבירה דיי טוב הקאצ' הוא שהחומר לא ממש מעניין אז לפעמים נרדמים (במיוחד אם ההרצאה בשעה מאוחרת).\nמדי פעם יש הרצאות אורח (לפעמים מעניינות). לא להתייחס לזה כאל חומר לא רלוונטי כי זה כן.\nבנוסף יש 2 מאמרי חובה שחייב לקרוא לפני המבחן.\nשם המתרגל/ת: תרצה לותרמן ובר עיני\nחוות דעת - תרגולים:\nתרצה נהדרת, משקיעה ונותנת יחס לסטודנטים. היא מאוד משקיעה ואפשר לשלוח לה שאלות במייל לגבי הש\"ב. (בר פחות נחמדה.)\nתרגולים סבירים ומובנים בסה\"כ כשתרצה מעבירה, יש שם חומר למבחן אז לא לדלג.\nשעורי הבית:\nארוכים, קשים, מעצבנים וחופרים. צריך לדעת לחפור וממש להתייחס/לצטט מושגים מההרצאה.\nהמבחן:\nקשה וקצר בזמן. האמריקאי ממש קשה ומבלבל (מבלבל גם את המרצה, אגב). מגיעים לממוצע 71 בערך.\nהשורה התחתונה:\nקורס מציק שעדיין לא יודע אם הוא באמת חשוב לתואר. לומדים לעשות web scraping שזה נחמד אבל זהו, זה דיי קורס במדעי ההתנהגות.\nיש גם מטלות בונוס, מאוד ממליץ לעשות בשביל לקבל ציון טוב\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רקפת\nמעודדת יותר מידי דיון פתוח מה שמקשה על הבנה של מה חלק מהחומר ומה לא.\nההרצאות מאוד מפוזרות\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: הרצאות משמימות לפעמים המרצה גם דורשת לראות הרצאה מוקלטת לפני ההרצאה, ויוצא ששעות ההרצאה פי שתיים ממה שהם אמורות להיות באותו השבוע. בנוסף המרצה מעודדת השתתפות אבל באופן מוגזם. לדוגמא בהרצאה הראשונה בזבזה 20 דק לדבר עם כל אחד מהשומעים החופשיים ולשאול מה שלומם והאם הם קראו איזה משהוא שהיא שלחה להם.\n\nשם המתרגל/ת: בר\nחוות דעת - תרגולים: מתרגלת גרועה והיא כל הזמן אומרת כן\n\nשעורי הבית: שיעורי בית מציקים וחסרי פואנטה הבדיקה גם קטנונית\n\nהמבחן: הרבה שאלות ומעט זמן\n\nהשורה התחתונה: אם הקורס לא חובה להתרחק כמו מאש\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: חמודות, לפעמים קשה להתרכז אבל אם מקשיבים בפועל ההרצאות נחמדות\n\nשם המתרגל/ת: תרצה ובר\nחוות דעת - תרגולים: חמודים, התרגולים של בר קצת לא מובנים\n\nשעורי הבית: חמודים\nסתם לא פשוטים, לוקחים הרבה זמן ובסוף מקבלים ציונים מעפנים (אם בכלל מקבלים)\n\nהמבחן: קשה, שאלות מטעות, המרצה מכוונת לממוצע מסויים ומרגישים את זה, גם אם לומדים קשה ויודעים את כל החומר אפשר בקלות להיתקע עם ציון מבאס\n\nהשורה התחתונה:\nהבעיה העיקרית בקורס היא שלא מקבלים את כל הציונים לפני המועד ב', כלומר - אין ציונים לעבודה 3 ולא נקבל אותם לפני מועד ב', וצריך להחליט בלי ידיעה על הציון האם לגשת למועד ב' או לא.\nבקורס רגיל זה לא היה נורא, אבל בקורס כזה שמכסחים בציונים, חשוב לדעת את הציון מראש כי כנראה 100 זה לא.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות: מרצה הזויה. הרצאות משעממות מאוד ולא רלוונטיות לכלום. בזבוז זמן מוחלט להגיע להרצאות ולקורס. מתוך שעתיים, שעה זה חזרה על חומר קודם. מרצה לא נחמדה בכלל ושחצנית עם גישה צדקנית.\n\nשם המתרגלת: תרצה לוטרמן\nחוות דעת - תרגולים: תרצה פשוט נהדרת, נחמדה נורא ומבינה עניין, מדברת בגובה העיניים. התרגולים היו סבירים ותרצה תמיד הייתה פנויה לעזר.\n\nשם המתרגלת: בר עיני\nחוות דעת - תרגולים: מתרגלת על הפנים. לא נחמדה בכלל ולא יודעת את החומר. תרגולים מאוד משעממים. לא מסוגלת להגיד משפט בלי לומר את המילה כן, מוציאה את הסטודנטים מריכוז.\n\nשעורי הבית: הדבר היחיד שסביר בקורס הזה. שיעורי בית לא קשים ולא ארוכים.\n\nהמבחן: מבחן לא הוגן כי המרצה לא הוגנת\n\nהשורה התחתונה: קורס נוראי לא קשור לדאטא סיינס בכלל. לא להתקרב אם לא חובה. בקיצור, קורס כלבות\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: המרצה הכי מונוטונית ומשעממת שהייתה לי בחיים. מצליחה לקחת נושאים מעניינים ולהפוך אותם לשעמום טוטאלי. מומלץ לראות את ההקלטות על מהירות כפולה כדי לא להירדם באמצע.\n\nשם המתרגל: בר/תרצה\nחוות דעת - תרגולים: טכנופוביה\n\nשעורי הבית: לחפור מלא ולהכניס כמה שיותר מילים גבוהות מההרצאות, ציון גבוה מובטח אפילו אם מחרטטים את כל העבודה\n\nהמבחן: פורמט אמריקאי, נראה שהסגל מאוד קנאי למבחנים שלו אז לא ניתן למצוא מבחני עבר בקורס\n\nהשורה התחתונה: נושאים מעניינים ופוטנציאל אדיר, אבל הביצוע לקוי. מרגיש כמו קורס שלא קשור לשום דבר וחבל שכך\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: לא הגעתי לאף הרצאה, עושה בינג' לפני מועד א. הרצאות יחסית סבירות, אחלה של שבירת שגרה מכל המתמטיקה והאלגוריתמים בתואר\n\nשם המתרגל/ת: תרצה/בר\nחוות דעת - תרגולים: נחמדים ממש, רוב החומר לא רלוונטי למבחן אבל מאוד רלוונטי לפרוייקטים\n\nשעורי הבית: 3 פרוייקטים שונים בזוגות שמתבססים על יצירת שאלונים וכל מיני דברים שתראו כבר בעצמכם.\n\nהמבחן: אמריקאי חומר פתוח שאלות מבלבלות מאוד\n\nהשורה התחתונה: קורס חרטא, עם קצת השקעה מאמין שאפשק להוציא אחלה ציון (המועד א עוד לא היה)\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות:\nמשמעממות ומרדימות. החומר משעמם ולא קשור לכלום והמרצה דורשת השתתפות בצורה מוגזמת מה שגורם להרצאות להיות מבולגנות\nשם המתרגל/ת: תרצה לוטרמן ובר עיני\nחוות דעת - תרגולים:\nסבירים. לא מעניינים אבל עוזרים לעבודות המייגעות\nשעורי הבית:\n3 עבודות בזוגות. מייגעות וסיזיפיות ולא לומדים בהן כלום והציונים יכולים להיות לא גבוהים. פשוט תחרטטו מלא ב20 עמודים לפחות ותקוו לטוב\nהמבחן:\nהזוי. מרגיש כמו טופס לוטו ולא קשור לכלום\nהשורה התחתונה:\nקורס זבל נוראי. לא מעניין ולא קשור לדאטא סיינס. אם לא חובה אל תתקרבו, אם חובה תקוו למזל בלוטו\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות: מרדימה\n\nשם המתרגל/ת: תרצה/בר\nחוות דעת - תרגולים: רלוונטי אבל לא מעניין במיוחד\n\nשעורי הבית: 3 עבודות במהלך הסמסטר, לא עמוס בעיקר חופר\n\nהמבחן: 60% מהציון הסופי, חלק אמריקאי עם 20 שאלות ועוד חלק פתוח ששווה 20 נקודות. שאלות אמריקאיות אפשר להשיג משנים קודמות או קורסים מקבילים אבל לא ניתן היה להשיג דוגמאות לשאלות פתוחות, אז בהצלחה למחרטטים\n\nהשורה התחתונה: רק אם ממש מעניין אתכם פסיכולוגיה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות:\nמרצה נחמדה עם רצון ללמד, אם מגיעים להרצאות ומשתתפים אפשר להעביר את ההרצאה בסבבה, להשלים את החומר אח\"כ משעמם מאוד.\nהקורס עצמו מרגיש שבנוי לא טוב ובאופן כללי החומר לא מעניין כלכך.\n\nשם המתרגל/ת: תרצה וגם בר\nחוות דעת - תרגולים:\nרלוונטים מאוד לתרגילי בית אבל רק לתרגילי בית. תרגולים לא מעניינים בכלל, אפשר להצליח סמסטר שלם מבלי להגיע פעם אחת.\n\nשעורי הבית:\nסיוט, לא ברור מה מתבקש והמשימות מרגישות לא מלמדות בכלל.\n\nהמבחן:\n80 נק' שאלות אמריקאיות ו20 נק' שאלות פתוחות שמזכירות את השיעורי בית.\nהשאלות האמריקאיות קשות מאוד פשוט כי החומר לא ברור בשום צורה. יש יותר מידי מקום לפרשנות וכל תשובה יכולה להיות נכונה עם מלבישים עליה הסבר שנשמע חצי נכון. (המרצה אפילו שמה מקום להסברים, ואם ההסבר שלך נשמע נכון אפשר לקבל ניקוד על שאלה אפילו אם סימנת תשובה לא נכונה).\n\nהשורה התחתונה:\nקורס דיי משעמם ולא הרגיש שתרם לי הרבה, הרגיש שהוא לא אמור לקחת ככ הרבה זמן אבל השיעורי בית קצת משאבת זמן.\nלמבחן לא צריך להשקיע יותר מידי מראש.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות: הרצאות דיי משעמות, ללא ספק הקורס הכי לא רלוונטים שלמדתי בתואר (כל מי שיגיד לכם אחרת משקר). אולי כן מדברים על דברים שחשוב להכיר שמתעסקים עם נתונים, אבל הם ברורים מאליו ועליהם לא תשאלו במבחן (מכיוון שהמרצאה כנראה רוצה שהמבחן יהיה עם ציון נמוך).\nמרגיש שהמרצאה צדקנית ועם יותר מידי אגו עצמי, לדוגמה היא מזמינה מרצים אורחים ומתפרצת לכל משפט שני שלהם.\n\nחוות דעת - תרגולים: המתרגלות יותר חביבות,\n\nשעורי הבית: נקודות האור היחידה בקורס, מרגיש שהפרוייקטים יותר רלוונטים למי שרוצה לעסוק בתחומים של product manger\n\nהמבחן: \"כשאין חומר רלוונטי וקשה בקורס, יכתבו מבחן טיפשי שלא באמת בוחן על כלום\" - היות והחומר לא ריגורוזי, לפעמים המרצה אפילו חוזרת בה . מרגיש חסר אוניים ללמידה לבמחן כי גם אחרי למידה עיקבית ועמוקה של החומר, עדיין להשאלות האמרקאיות הן סוג של לוטו. חבל שזה כך, נראה שהמרצה חושבת שיעריכו את הקורס יותר אם הציון של המבחן יהיה נמוך\n\nהשורה התחתונה: ללא ספק קורס מאוד מיותר, מוזר שעדיין הוא לא הפך לבחירה (ולא מובן איך הוא בדיוק 3.5 נק\"ז עם מערכת שעות שבועית של 3). למי שיש אפשרות להתרחק כמו מאש, למי שאין אפשרות משתתף בצערכם\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: חרא ומשעמם\n\nשם המתרגל/ת: תרצה ובר\nחוות דעת - תרגולים: משעמם אך לעיתים עוזר לעבודת\n\nשעורי הבית: עבודות מזעזעות ונוראיות ולא ברורות. סבל טהור אלא אם כן אתם אובססביים לסקרים ואז תהנו מאוד\n\nהמבחן: לוטוץ המרצה מגרילה ציונים באקראי. פשוט בושה\n\nהשורה התחתונה: קורס מביש ומחפיר. בושה לטכניון שהגרלת משחק בציונים שכזו נחשבת לקורס ועוד קורס חובה בדאטא סיינס\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת\nחוות דעת - הרצאות: מאוד מרוח, מתפלספים על חומר לא באמת מעניין שאפשר ללמוד בפועל בחצי מהזמן בתור מלג. לא מדעי ולא מבוסס בחלקו.\n\nשם המתרגל/ת: תרצה/בר\nחוות דעת - תרגולים: רלוונטי לתרגילי בית\n\nשעורי הבית: 3 פרויקטים שהם מן עבודות מחקר, לוקחים המון זמן. לרוב הוראות העבודה לא מנוסחות בצורה ברורה ויש הרבה מקומות שאפשר ליפול בציון ובבדיקה אם לא דאגתם לתרגם את ההוראות המבלבלות במדויק מול המתרגלות. מקבלים תקציב לפרסום שאלונים וקניית נסיינים. רק גרם לי להבין יותר את דן אריאלי וזיוף הנתונים. בקיצור, התקציב המבוזבז יכל להגיע למקומות יותר מועילים בפקולטה ומחוץ לה.\n\nהמבחן: לוטו אמריקאי (80%), יש בד\"כ יותר מתשובה אחת נכונה, אבל בסוף יש הרגשה שהתשובה ה\"נכונה\" נקבעת לאחר המבחן בהתאם לרצון המרצה (אחרת מדוע לקח 14 ימים לפרסום ציונים למבחן אמריקאי ברובו?). אין ממש טעם ללמוד או להתכונן כי המבחן לא הוגן בכל מקרה. המבחן מרגיש כמו ניסוי מוזר של רקפת במטה-קוגניצייה על הסטודנטים.\n\nהשורה התחתונה: \"הגורם האנושי בהנדסת ממוצע\". באמת לא ברור למה הקורס הזה במתכונתו והנהלתו הנוכחית הוא קורס חובה במסלול נתונים. בושה לפקולטה להנדסה בטכניון שמכירה בקורס לא מדעי ושמנוהל בצורה מפוקפקת כל כך כקורס חובה. נשאר לקוות שיום אחד יקשיבו שם למעלה ויעשו שינויים משמעותיים.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רקפת אקרמן\nחוות דעת - הרצאות:\nבעיקר דיונים, פחות הרצאה\nשם המתרגל/ת: בר עיני/תרצה לוטרמן\nחוות דעת - תרגולים:\nנעו בין שיעמום מאוד למי שאי פעם עשה קורס סטטיסטיקה לבין בלתי נסבל, באופן כללי מיותר\nשעורי הבית:\n3 עבודות מוגזמות עם בדיקה קפדנית והזויה. ציונים לא גבוהים במיוחד. דרישה להשתתף בניסויים - כדאי לעשות את כל האופציות לבונוס כי זה יהיה הכרחי אחרי המבחן.\nהמבחן:\nאמריקאי בלי תשובות נכונות באמת.\nהשורה התחתונה: כמלג זה היה קורס מצוין, חבל שהוא דורש יותר מדי שעות ומטלות\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: ליאת לבונטין\nחוות דעת - הרצאות: הרצאות מאוד מעניינות ושוברות שגרה. מדברים על פסיכולוגיה ועל דפוסי התנהגות של אנשים במילוי סקרים וכו ממש מעניין. אבל - בשלב מסוים הסמסטר נהיה עמוס אז בכיף ויתרתי על ההרצאות. בהרצאות האחרונות אין דברים קריטיים לעבודות או לתרגילי הבית.\n\nשם המתרגל/ת: קים נויה ובר עיני\nחוות דעת - תרגולים: מאיפה להתחיל...\nהרגיש כאילו כפו על שתיהן לתרגל בקורס והן עושות לנו טובה. התרגולים מאוד חשובים כי מדברים שם על דברים שקשורים לתרגילי הבית אבל בפועל הן מדברות בצורה מאוד כללית ולא ברורה מספיק ואז אוכלים אותה בתרגיל בית על הסבר לא מספק או משהו לא נכון שלפעמים אפילו לא נלמד אלא \"צופה מכם להבין שככה לא צריך לעשות\"\n\nשעורי הבית: יש 3 סוגים: משימות, תרגילים ועבודות. המשימות מאוד קצרות ומקבלים 100 אם הגשתם ולא כתבתם ממש שטויות.\nתרגילי הבית ברמה יותר גבוהה וכן דורשים התעמקות. הציון הוא בין 0 ל 10. העבודות עמוסות מאוד ודורשות חקר וקריאת מאמרים ושם הציון בין 0 ל 100. הסגל מכבס בבדיקה וזה שוב נובע מחוסר תיאום הציפיות. הן מצפות שנדע לעשות מבחנים סטטיסטיים ככה בשלוף ולא מסבירות לעומק מתי ואיך משתמשים ועוד מלא דברים כאלה. תיזהרו וסופר תשקיעו.\n\nהמבחן: אין מבחן\n\nהשורה התחתונה: אם הסגל היה עושה 2 תרגולים שבהם הוא היה נותן לנו את כל הכלים המתמטיים שנצטרך וגם מסביר איך להציג דברים מבחינה ויזואלית לעומק ולא ברפרוף כמו שהם עשו, הייתי יכול לומר שהקורס הוא מעולה ונדרש בתואר שהוא מתמטי/תכנותי. אבל הסגל לא משקיע ומצידם לכסח לכסח לכסח.\nקורס מאוד עמוס אבל תשקיעו את הנשמה בו כי בסוף אפשר להוציא 90+.\nחבל שבקורס כזה \"קל\" תדפקו עם ציון פושר ומבאס.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: ליאת\nחוות דעת - הרצאות: מיותרות, הפסקתי לבוא באמצע הסמסטר, החלטה מצוינת\n\nשם המתרגל/ת: קים/בר\nחוות דעת - תרגולים: קים אחלה, בר קצת פחות\n\nשעורי הבית: עמוסים, יש משהו שבועי בין אם זה משימת הגשה עם ציון בינארי שלוקח רבע שעה בין אם זה פרויקט שלוקח ימים על ימים. בדיקה קפדנית מאד אבל אפשר להוציא ציון טוב אם משקיעים ממש\n\nהמבחן: אין\n\nהשורה התחתונה: לדעתי הקורס חשוב במהותה, אבל חבל שסגל קורס התייחסו לקורס הרבה יותר חשיבות ממה שצריך להיות. וכל סגל הקורס ממש מתנשאים על הסטודנטים והאווירה לא כיפית.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: ליאת לבונטין\nחוות דעת - הרצאות: הלכתי רק לחצי מהן, לא באמת רלוונטיות למשהו למרות שהן נחמדות. בתחילת סמסטר כשפחות עמוס זה סבבה אבל אחר כך הופך לבזבוז זמן\n\nשם המתרגל/ת: אבישי ואתיל\nחוות דעת - תרגולים: שניהם תרגלו את כל הקבוצות. אבישי כן השתדל לעזור בשעות קבלה שלו כשהיו תרגילים ופרויקטים אבל שחט אנשים בבדיקה, אתיל הייתה פחות אינפורמטיבית אבל בדקה יותר סבבה.\n\nשעורי הבית: 7 מטלות בינאריות שכל אחת שווה 2%. קליל במהלך הסמסטר, רק חשוב לשים לב שעוקבים אחרי ההנחיות. הם נוטים לתת הרבה הערות שחשוב ליישם בפרויקטים.\n\nהפרויקטים: שני פרויקטים, כל אחד על חצי אחר של הקורס. די גדולים ודורשים להיות מאוד פדנטיים וגם אז קוטלים בבדיקה (כי חייבים לשמור על ממוצע לא גבוה מדי). צריך ללכת הרבה לשעות קבלה ולהתייעץ על כל פיפס קטן אחרת משלמים על זה בציון.\n\nהשורה התחתונה: ממש חופר ולא מאוד מעניין, בעיקר מעיק בסמסטר 5 שהוא גם ככה מאוד עמוס.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: Liat Levontin\nחוות דעת - הרצאות: BULLSHIT\n\nהשורה התחתונה: אין שום דבר מדעי. הכל Bullshit. לא לומדים כלום. בזבוז זמן. בושה שזה קורס חובה.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: ליאת\nחוות דעת - הרצאות:\nאמלה אמלה אמלה איזה קורס בדיחה. חבל ככה לתת קורס כביכול שלהוציא בו ציון טוב אמור להיות משימה פשוטה ומחפשים איפה להוריד. ליאת מראה בקיאות מסוימת אבל נכנסת לקטנות שממש סותרות דברים בסיסיים שלמדנו בקורסים סטטיסטיים אחרים. היא גם כמובן לא משתפת את המצגות במלואן וקשה מאוד ללמוד אחר כך מהן כי יש לך בערך שליש מצגת בלי קונטקסט או דוגמאות. ההרצאות עצמן לפעמים מעניינות וברמת נוגעות בנושאים חשובים אבל וואו איזה תחושה מרה נותרת עם התייחסות הסגל אלינו\nחוות דעת - תרגולים: הלכתי 3 פעמים וויתרתי. מועברים בצורה סופר משעממת ומבזבזים לנו את הסמן במקום להראות דוגמאות קונקרטיות לקראת שיעורי בית ופרויקטים ואז מורידים לנו בשיעורי בית דברים שלא עברו עליהם בכלל בתרגול.מהמם.\n\nשעורי הבית:\nלמרות שהעומס לא גדול, ההוראות לא ברורות ממה מצפים מאיתנו באמת וקשה מאוד לקלוע למחשבה ההתחלתית שהייתה להם בראש. במיוחד כאשר אין באמת חומר ברור ללמוד ממנו.\nהמבחן:\nאין\nהשורה התחתונה:\nפח קורס ובאסה ממש לקבל ציון פושר על סמך החלטה רנדומלית של כמה רע היה היום של המתרגל שבחן ךך את הפרויקט. הורידו לי נקודות על שטויות כמו מילה לא במקום כמו \"השפעה\". אם אתם רוצים ציון גבוה תחפרו להם בשעות קבלה ותקוו שמי שבודק את הפרויקט לא יהיה ממורמר על החיים שלו.\nבוווווווווזזזזזזזזז\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: ליאת לבונטין\nחוות דעת - הרצאות:\nההרצאות היו די משעממות ומרוחות. מעבר לכך, ליאת מחפשת תשובות נורא ספציפיות לכל דבר, אז גם השאלות הרטוריות שלה, גם ה\"סקרים\" שהיא עושה תוך כדי ההרצאה וגם בכללי הגישה שלה לקורס היא \"תעשו כמו שאני אומרת\", שזה נורא לא מלמד בסופו של דבר. החומר עצמו כן שימושי, כי בסופו של דבר זה חיוני לדעת מבנה של עבודת מחקר או ניסוי, ומושגים שהכרחיים לאלו. אבל חבל שזה מועבר בצורה כזאת מעצבנת. חוץ מזה זה הרגיש כאילו כל החומר היה יכול להיות מועבר בחצי מהסמסטר או פחות.\n\nשם המתרגל/ת: קים, אתיל ואבישי\nחוות דעת - תרגולים:\nקודם כל, התרגולים הועברו במתכונת כזו שכל שבוע מתרגל אחר מעביר את התרגולים באותו שבוע, כך שכולם חוו את כל המתרגלים. קים היא די נחמדה סך הכל, אתיל די מקצועית ונחמדה גם כן, אבל לאבישי חסרות כריזמה ואמפתיה בסיסית. בתרגולים גם כן הציבו דברים שהיה צריך לעקוב אחריהם במדויק אח\"כ בשביל המטלות בקורס, וגם הם די הרגישו כמו שעמום. יתרה מכך בתרגולים לפעמים נאמרו דברים שסתרו את ההרצאות.\n\nשעורי הבית:\nהקורס מורכב מכמה מטלות:\n9% שהם 3 ש\"ב בינאריים, שהם די פשוטים.\n20% שהם ת\"ב, כשמתוכם השניים הראשונים משקלם 5% כל אחד והשלישי 10%. אלה כבר מעט יותר ארוכים משיעורי הבית אבל הם עדיין קצת בסיסיים ושימושיים לפעמים לפרויקטים אח\"כ.\n66% שהם הפרויקטים, שמהם היו 2 (וכל אחד שקל 33%). הפרויקטים מעצבנים ומייגעים, במיוחד השני שבו צריך להתעסק עם ה-Ads Center המעצבן של Meta. בגדול הם חפירה בירוקרטית בעיקר, כי צריך לכתוב מלא שיט בדיוק איך שהסגל רוצה. בבסיסם הם כן מעניינים, אבל ההתעסקות ובזבוז האנרגיה על להבין איך לנסח כל משפט כדי שמתרגל שקם על רגל שמאל בבוקר כלשהו לא יוריד 10 נקודות עליו סתם כי בא לו זה לא מלמד.\n5% שהם על הצגת אחד הפרויקטים, שהיא די סבבה.\nיש גם עד 2 נקודות בונוס אם מגישים משובים על הצגות משני הפרויקטים.\n\nאם הייתי יכולה הייתי עושה בדיקת השערות על ההתפלגויות של הציונים של כל אחד מהמתרגלים, כי אם עושים את העבודה כמו שצריך, וקים בודקת, אז הכל טוב. אם אתיל בודקת זה עוד בסדר. אבל אם אבישי בודק, הוא ימציא איזה 8 סיבות לתת לכם 80 ומטה (למרות שעשיתם בדיוק מה שביקשו). אם אבישי בודק לכם את הפרויקט, תנחומיי.\nכנקודה לשיפור, בכללי לקורס הזה, כדאי לסגל ליישר קו ביניהם ולהיסגר על מחוון *אחיד* בקורס שכל ההתהוות שלו היא גם ככה לעקוב אחר הוראות.\nדרך אגב, אין ערעורים בקורס הזה (לכאורה) חוץ מעל הפרויקטים.\n\nהשורה התחתונה:\nלקחו קורס עם כלים חיוניים והפכו אותו ל-rng ממרמר שהוא חובה :(\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: ליאת לבונטין\nחוות דעת - הרצאות:\nלא יודע אם מישהו הלך למרות שהחומר של ההרצאות כן חשוב והמתרגלים בכוונה לא עונים על שאלות על החומר הזה כי הם רוצים שילכו להרצאות\n\nשם המתרגל/ת: קים אתיל ואבישי\nחוות דעת - תרגולים:\nאין בחירה של מתרגלים וכל שבוע מתרגל אחר ככה שכל מתרגל מתרגל מה שהוא יודע (אתיל יודעת סטטיסטיקה ופייסבוק, קים יודעת לצטט והנחיות, אבישי יודע סקרייפינג ולהוריד ציון), חשוב להגיע לתרגולים כי חלק מההנחיות למשימות מועברות בעל פה\n\nשעורי הבית:\nהיו 3, כל אחד 3% עם ציון עובר לא עובר, מה שהמתרגלים לקחו כשהזדמנות לא לתת משוב ואז להוריד נקודות בתרגילים\n\nתרגילי בית:\nהיו 3, 5 5 10 אחוזים למרות שלא ברור למה האחרון היה 10 הוא היה הכי קל, התרגילים בעצם הם הכנה לפרויקטים ושם כן מקבלים הערות אבל איתם באה הורדת ציון יפה\n\nפרויקטים:\nהיו שני פרויקטים בהתאם לשני חלקי הקורס, פרויקט 1 היה לקחת נתונים מהאינטרנט ולנתח, יותר קל לעשות אבל דורש הרבה יותר חרטטת ובהתאמה ציונים יותר נמוכים, פרויקט 2 היה להריץ מודעה בפייסבוק שזה לא באשמת צוות הקורס אתר מגעיל וגוזל אבל ברגע שהרצתם די סיימתם התרגיל די פשוט, כל אחד מהפרויקטים 33, בנוסף היה צריך להציג אחד מהם (ההצגה של הראשון היתה שבוע לפני ההגשה), ההצגה די קלילה וקל לקבל את מלוא הניקוד, הייתי ממליץ להציג את הראשון שכן קל יותר לטעות שם ותוכלו ללמוד מההערות (אולי)\n\nהשורה התחתונה: לא קורה כלום בקורס, וצריך להוריד ממוצע איכשהו אז כדאי ללכת לשיעורים ולשאול על כל דבר שאתם לא מבינים (תכינו זמן לשעות קבלה ותבקשו להגיע מראש ) אחרת תשלמו בציון, אבל החומר די קל סה״כ, קורס מסביל כחובה אבל דווקא לא בחירה כזו רעה אם אתם רוצים קורס קל ללא מבחן\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: ליאת\nחוות דעת - הרצאות: ההרצאות לדעתי היו מעניינות ואינטראקטיביות אבל עם זאת לא מספקות את הרמה הנדרשת (על פי סגל הקורס) לביצוע המטלות.\n\nשעורי הבית:\nתרגילי בית - לא נוראים, לא לוקחים כזה הרבה זמן.\nפרויקטים - נוראיים, תתכוננו לעובדה שצוות הקורס חושב שאתם מאסטרנטים שמכירים עבודה מחקרית והם הולכים להוריד על פסיק לא במקום, הם דורשים רמה שלא מסופקת על ידי ההרצאות והתרגולים. אם אתם רוצים ציון טוב בפרויקט אל תחפשו לעשות פרויקט ברמה גבוהה ומושקע, כל השקעה נוספת שהיא מעבר למה שנדרש ממכם יתעלמו ממנה או אפילו יותר גרוע יחשבו שהעבודה מועתקת.\n\nחוויה אישית: אנחנו עברנו על עשרות מחקרים כדי להבין את השלד המחקרי והשפה המחקרית - וכתבנו עבודה ברמה גבוהה מאוד (כן עדיין יש בה טעויות) שנבנתה על פי עקרונות כתיבה מחקרית (מבוא; שיטה; תוצאות; מסקנות; ביניהם: רקע תאורטי,אוכלוסיית מחקר, כלי מחקר, הליך מחקר, מגבלות מחקר וכו'). כשנתבקשנו לכתוב את הבעיות במחקר ואת ההמלצות שלנו כתבנו תחת \"מגבלות המחקר\" כפי שעושים בכל עבודה מחקרית וזה זיכה אותנו במינוס שמונה נקודות, התעלמות מוחלטת מהתוכן שנכתב ורמיזה בהעתקה \"לא נדרש לכתוב מגבלות המחקר, אולי ראיתם הוראות של שנה קודמת\". בנוסף, כשהשותפה שלי הלכה לדבר עם המתרגלת על ההערה הזו, היא אמרה לה \"אה אתם הזוג הידוע לשמצה\", ולאחר מכן טענה שהעתקנו את העבודה. כמובן שהיא לא יכלה להוכיח זאת כי העבודה נכתבה מאפס, ולכן זה נשאר רק \"בעל פה\". שורה תחתונה לא מעודדים ראש גדול בקורס הזה, והשקעה מרובה לא שווה את המאמץ.\n\nהמבחן: חבל שאין\n\nהשורה התחתונה:\nקורס עם בסיס סביר אבל בשיטה הנוכחית די מיותר. המרצה לקחה חלק מהקורס \"שיטות מחקר\" והוסיפה לו עבודה עם דאטה והופ נולד קורס \"גורמי אנוש בדאטה\", אבל המשפט \"תפסת מרובה לא תפסת\" מסכם יפה את הקורס הזה - הוא לא מעביר את עקרונות שיטות המחקר באופן מספיק טוב ומקיף ועם זאת יש ציפייה ממכם שתדעו אותן ברמה הגבוהה ביותר. וגם לא מלמד באופן מספיק טוב איך למצוא ולהתמודד עם דאטה.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 86  סופי 86  לבונטין ליאת\nחורף 2023-2024  א' 87  סופי 87  לבונטין ליאת\nחורף 2022-2023  א' 85  סופי 85  לבונטין ליאת\nחורף 2021-2022  א' 70  ב' 82  סופי 81  אקרמן רקפת\nחורף 2020-2021  א' 84  סופי 82  אקרמן רקפת\nאביב 2020       א' 83  סופי 82\nחורף 2018-2019  א' 82  סופי 81  אקרמן רקפת\nסופי מועד א': 86\nסופי: 86\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n109 107 2 98 50 100 86.623 91\nאיש סגל תפקיד\nלבונטין ליאת מרצה - אחראי מקצוע\nמנסור אתיל מתרגל\nפניאס קים נויה מתרגל\nשפירא עילם מתרגל\nשיתוף היסטוגרמות"
  }
}