{
  "course_id": "097910",
  "scraped_at": "2025-12-16T13:54:45.114862",
  "information": {
    "raw_text": "00970910 - נ.נ. באינטגרציית אדם-מערכת\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nשיטות והיבטים תיאורטיים של שילוב גורמים אנושיים בתהליך הפיתוח של מערכות. נושאים: מבוא לאינטגרציה בין אדם למערכת! המודל המשולב של אינטגרציית אדם-מערכת! אינטגרציה בין אדם למערכת בתהליך עיצוב המערכת! היבטים קוגניטיביים וארגונומיים בתכנון מערכת! ניתוח תפקיד! יישומים )ממשקי מגע! ממשקים פיזיים(.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. לזהות את השיקולים העומדים מאחורי שילובהגורמים האנושיים בתהליך של מערכות.\n2. ליישם תיאוריות ומתודולוגיות בתחום הנדסת גורמי אנוש: עיצוב ממוקד משתמש! ניתוח תפקיד! מיפוי ההיבטים הקוגניטיביים והארגונומיים של המשתמשים.\n3. לשלב הנדסת גורמי אנוש בתהליכי הנדסת המערכת.\n4. לזהות את מרכיבי הגורמים האנושיים המר כזיים בהצלחת המערכות.\n5. לבצע תהליך ניתוח תפקיד.\n6. לנתח היבטים קוגניטיביים וארגונומיים של משתמשי המערכת._\n7. לשלב את ניתוח תפקיד ואת ההיבטים הקוגניטיביים והארגונומיים במהלך תכנון המערכת.",
    "title": "00970910 - נ.נ. באינטגרציית אדם-מערכת"
  },
  "feedback": {
    "summary": {
      "text": "3 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: ד״ר נירית גביש\nחוות דעת - הרצאות: המרצה לא מלמדת, צופים בסרטונים בבית, לרוב הם לא מאוד מעניינים. עוברים על שאלות לגבי התוכן במפגשי זום.\n\nחוות דעת - תרגולים: אין תרגולים.\n\nשעורי הבית: אם עוקבים אחרי ההוראות בדקדקנות מקבלים ציונים טובים.\n\nהמבחן: אין מבחן, רק עבודות.\n\nהשורה התחתונה: קורס בזום לא מעניין במיוחד שמקבלים בו ציונים טובים, ומקבלים טעימה מעולם חווית המשתמש.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: נירית\nחוות דעת - הרצאות: בזום אבל לא בכל שבוע יש הרצאה. בחלק מהשבועות רואים סרטונים פרטיים ביוטיוב. יש איזה 10-30 דקות בהרצאות בזום שבהן צריך \"לעבוד בקבוצות\" לפעמים עם חברים לפרויקט ולפעמים עם אנשים רנדומליים וברוב הזום נירית תדבר על השיעורי בית והפרויקטים שיש. אפשר לא להיות בחלק מהזומים.\nשעורי הבית: כל מיני, בחנים במודל שלא משנה אם הצלחתם בהם, לכתוב סיכומים לפי סרטונים שבהם קצת צריך להשקיע ושני פרויקטים - אחד בקבוצה של 3 ואחד לבד שבהם צריך לפרט ולכתוב במשך 12 עמודים בהתאם לדרישות של נירית.\nהשורה התחתונה: זה עוד אחד מקורסי הכמו מל\"ג של הפקולטה. לא בטוח מה לומדים בקורס, צריך להשקיע בו במידה סבירה ואם מקדישים מספיק תשומת לב למה שנירית רוצה מקבלים ציון גבוה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 93  סופי 93  גביש נירית\nחורף 2023-2024  א' 91  סופי 94  גביש נירית\nסופי מועד א': 93\nסופי: 93\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n123 123 0 100 58 100 93.537 94\nאיש סגל תפקיד\nגביש נירית מרצה - אחראי מקצוע\nשיתוף היסטוגרמות"
  }
}