{
  "course_id": "094219",
  "scraped_at": "2025-12-16T13:01:56.553703",
  "information": {
    "raw_text": "00940219 - הנדסת תוכנה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nשיטות תכנות במערכות תוכנה גדולות, מבוא לתכנון ותכנות מונחה עצמים ולימוד שפת תכנות מונחית עצמים. בקורס נלמד שפת .AVAJ\n\nמקצועות קדם: 02340221 או 02340117 או 02340111\n\nמקצועות ללא זיכוי נוסף: 00440101 00940201 00940220 00960609 02340121 02340122 02340124\n\nמועד א': 05-02-2026\nמועד ב': 06-03-2026",
    "title": "00940219 - הנדסת תוכנה"
  },
  "feedback": {
    "summary": {
      "text": "48 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 4.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שעורי הבית: total: 4\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "חוות דעת - הרצאות:\nלא אהבתי אישית\nחוות דעת - תרגולים:\nבינוני\nהמבחן:\nקשה\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: קצב איטי, הרבה פעמים לא הכי ברור וקשה לעקוב. מומלץ לסכם טוב.\n\nשם המתרגל/ת: אילון\nחוות דעת - תרגולים: לא התחברתי, אבל סה\"כ הוא סבבה ודי מובן.\n\nשעורי הבית: סבירים מאוד, הרבה פעמים יש תיקונים בימים הראשונים מפרסום התרגיל כדאי לקחת את זה בחשבון.\n\nהמבחן: מבולגן ומוזר, אבל אפשרי לקבל ציון סבבה.\n\nהשורה התחתונה: הקורס עבר למתכונת חדשה באביב 20, יכול להיות שישתפר עם הניסיון של נועם.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם כהן-אשר\nחוות דעת - הרצאות: אהבתי מאוד, מרבה לשתף את הסטודנטים ולתת משימות קטנות שמקבלים עליהן נקודות בונוס. המצגות קצת מבולגנות, כדאי לסכם במהלך ההרצאה כי הרבה דברים שנאמרים בע\"פ חשובים ומופיעים גם במבחן. לפעמים קצת מסתבך כשעונה על שאלות, מכוונה טובה של רצון להדגים, אבל עדיף פשוט ללכת לגוגל (הוא עושה את זה בעצמו גם בהרצאות).\n\nשם המתרגל/ת: ראניא\nחוות דעת - תרגולים: עדיף שלא להגיע או לראות רק הקלטות. מנומנמת ולא מסבירה טוב, גוגל הוא החבר הכי טוב במקרה הזה.\n\nשעורי הבית: 4 תרגילים, לא קשים במיוחד מלבד אחד שהיה ארוך ומציק. הבעיה היא שלרוב מתעוררות שאלות שאין עליהן תשובה בתרגילים, עצה שלי תשלחו מיילים כמה שיותר מוקדם כדי שיספיקו לשנות את התרגיל בהתאם (הם אכן משנים אותם).\n\nהמבחן: לא קשה וממוחזר מאוד (ספציפית בסמסטר הזה, לא ברור כמה ימחזר בסמסטרים הבאים). ללמוד טוב את העקרונות של OOP, האינטרנט מוצף בתרגולים והסברים מעולים.\n\nהשורה התחתונה: קורס מעניין, פרקטי וחשוב מאוד להמשך החיים בתעשייה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם אשר כהן\nחוות דעת - הרצאות:\nנועם בן אדם מאוד טוב, ועם המון ידע מקצועי רחב אבל יכולות הדרכה ברמה נמוכה מאוד\n\nחוות דעת - תרגולים:\nלירון מלך.\n\n\nהמבחן:\nלא קל, דורש רמת מוכנות גבוהה מאוד וריכוז\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם כוהן\nחוות דעת - הרצאות: בכללי נועם נראלי בן אדם טוב, רואים שאכפת לו מהסטודנטים ושיש לו הרבה ידע בעולם התכנות. הבעיה היחידה זה שהוא לא מצליח להעיבר את ההרצאות בצורה מעניינת בכלל.\n\nשם המתרגל/ת: דביר טויטו\nחוות דעת - תרגולים: דביר הוא המתרגל האחראי, הוא יודע את החומר בצורה טובה מאוד אבל לא יודע איך להעביר אותו באופן שיעניין את הסטודנטים. אין לו כריזמה והוא עשה בוחן אמצע מאוד לא הוגן. לא מומלץ ללכת אליו.\n\nשעורי הבית: יש סביבות 4 תרגילי בית, ה2 האחרונים דורשים קצת עבודה אבל השיעורי בית ברמה סבירה.\n\nהמבחן: המבחן שלנו היה מורכב מחצי אמריקאיות וחצי שאלות פתוחות. האמריקאיות היו מבלבלות מאוד ובדקו הבנה. מומלץ לנסות להבין בצורה טובה את הטיפוסים השונים, מה מותר ומה אסור לעשות ובכללי את כל הדברים הקטנים שעלולים לשנות לך את הקוד, לגרום לשגיאות הידור וכו.\n\nהשורה התחתונה: הקורס לא מלמד אותך לתכנת והלמידה למבחן זה בעיקר קריאה וצבירת הבנה.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: נועם כהן\nחוות דעת - הרצאות:\nלעיתים מדבר קצת לאט או קצת מונוטוני, אבל מקפיד לשלב אנקדוטות וחצי-בדיחות שקשורות לחומר. מחווייתי האישית, נועם הבן אדם הכי גבר בכל הטכניון. הוא עוזר מאוד, הוא מתחשב בסטודנטים אם מבקשים יפה, הוא רציני והוא משקיע בתרגילי בית, בקורס ובסטודנטים. ממש רואים שהוא בא כי אכפת לו. בחור כן (או כנה?) ונראה שהוא משתדל לעשות את הקורס והעבודות הכי טובים שאפשר (מלמדים ומועילים בסופו של דבר).\nבבקשה תתייחסו אליו בכבוד כי הוא אוצר של הטכניון וחבל שיתקלקל.\n\nשעורי הבית:\nקצת ארוכים ומתישים אבל מרגישים חשובים להמשך, מלמד איך להרים פרויקט מלא בקוד שמורכב מחלקים שונים.\n\nהמבחן:\nיכול להיות קשוח ולא כזה פייר, חצי מהשאלות בוחנות האם את/ה קומפיילר. צריך למצוא שגיאות סינטקס ולפענח אם הן זמן ריצה או קומפילציה. החצי השני שאלות על נקודות שונות בחומר, OOP, UML, AMDAL, DEADLOCK וכו'\n\nהשורה התחתונה: אחלה נועם שבעולם, רציני.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם כהן\nחוות דעת - הרצאות: הרצאות מאוד ארוכות. נועם בא מהתעשייה ומסביר יפה איך הדברים שאנחנו לומדים עליהם בפועל מייושמים במציאות. מדבר בצורה די מונוטונית ומסביר את הדברים בצורה יחסית איטית. מה שכן, זאת השנה השנייה סך הכל שהוא מלמד ורואים שמאוד חשוב לו שנבין והוא משקיע המון.\n\nשם המתרגל/ת: לירון פז\nחוות דעת - תרגולים: המתרגל הכי טוב שיצא לי ללמוד ממנו. מסביר ברמה מעולה, ונותן דוגמאות שמאוד מפשטות את החומר. למרות שהמצגות מאוד עמוסות, הוא לא מקריא מילה במילה מה שרשום ויכול להסביר גם בעל פה את הדברים. תמיד ייזרוק בדיחה או 2 כדי להקל על האווירה שלא ירגיש עמוס מדי.\n\nשעורי הבית: ביזיוניים. נתנו לנו תרגיל בית 0 בתחילת הסמסטר, נעלמו לחודשיים, ואז בחודש וחצי האחרונים הפציצו אותנו בעוד 3 תרגילי בית. ההסברים של תרגילים הבית מסתמכים על ״היגיון בריא״, כלומר המון נקודות לא ברורות. כל שאלה שיש לכם תשאלו בפורום, אל תנסו להבין את הלוגיקה של המתרגל שכתב את זה.\n\nהמבחן: המבחן היה בעיניי מאוד מאוד הוגן. הוא היה עמוס אבל אם ידעת את החומר, היה אפשר להוציא 80 ומעלה. חשוב מאוד לעבור על התרגולים ואפילו אחד המתרגלים אמר שמספיק ללמוד רק מהם. חשבנו שצריך לשנן את המושגים התיאורטיים של ההרצאות, אבל בסוף לא היה צריך. למידה טובה בעיניי זה לנסות בתוכנה שלכם את כל הניואנסים הקטנים שאתם לא בטוחים לגביהם ולנסות לראות האם הקוד יעבוד או לא, ובנוסף כמובן לפתור שוב את התרגולים ואת תרגילי החזרה שיפרסמו.\n\nהשורה התחתונה: קורס לא מאוד עמוס אבל כן עם הרבה חומר. מי שתכנות בג׳אווה לא חדש לו, יכול להוציא מעל 80 בקורס ורוב המושגים עד אמצע הסמסטר הוא יכיר מיידית. לאחר מכן המושגים נהיים מאוד תיאורטיים וצריך לעקוב אחרי החומר בצורה טובה. מי שלא יצא לו לתכנת לפני ייתקשה קצת בהתחלה אבל המצגות מאוד ברורות ומלמדות. יש גם המון חומר באינטרנט.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: נועם בן אדם טוב. ההרצאות משעממות ומבולגנות אבל נועם עושה הרבה כדי להשתפר.\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: מלך, מסביר בצורה ברורה ונותן דוגמאות טובות שעוזרות לעכל את החומר, לפעמים רץ מהר מדי.\n\nשעורי הבית: הזייה. בחודשיים הראשונים של הסמסטר לא היו בכלל (חוץ מתרגיל בית 0 שהיה בדיחה) בחודש האחרון לסמסטר פורסמו 3 תרגילים שלאחרון היה פחות משבוע. מאמין שבסמסטרים הבאים זה לא יהיה ככה.\n\nהמבחן: חלק אמריקאי וחלק שאלות פתוחות. החלק הפתוח הוגן, האמריקאיות מכשילות וקטנוניות.\n\nהשורה התחתונה: קורס נחמד, לא קל אבל גם לא יותר מדי עמוס.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: במהלך הסמסטר עקב מצב משפחתי נועם נסע לחו\"ל וכתוצאה מכך רוב הסמסטר לא היו הרצאות פרונטליות אלא רק בזום,דבר שלדעתי פגע מאוד באיכות ההרצאות (אורך כל הרצאה הוא 3 שעות רצופות, ובלתי אפשרי להתרכז במשך כל הזמן)\nאני חושב שנועם בא עם המון כוונות טובות,אבל בסוף הרבה מזה התפספס וחבל\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: מתרגל מעולה! מעביר את התרגולים בגובה העיניים ובצורה מקצועית. מאמין שמספיק לראות את התרגולים שלו ולעבור על סיכום ההרצאות כדי להצליח בקורס\n\nשעורי הבית: 3 מטלות להגשה שלא מסובכות מדי,אך כל המטלות הועלו בסמיכות קרובה זו לזו ולכן נגרם לחץ מיותר בסוף הסמסטר. היה עדיף לו היה אפשר לפרוס את המטלות על פני כל הסמסטר ולא רק על החצי השני שלו(מטלה ראשונה הוגשה שבוע לפני בוחן אמצע)\n\nהמבחן:\nמודה שמבנה המבחן מאוד מוזר בעיניי.כקורס שעיקרו הוא הכרת תכנות מונחה עצמים הייתם מצפים שהקורס יבחן את היישום הפרקטי של החומר הנלמד,אך בפועל הרוב המוחלט של המבחן התעסק בשינון מושגים ובדיקות פלט.למעשה ניתן לחלוטין להוציא מעל 90 מבלי לכתוב שורת קוד אחת במבחן.\nמעבר לכך,כיוון שהקורס במתכונת הנוכחית יחסית חדש,לא היו מבחני עבר ללמוד מהם,מה שהקשה על ההכנה לבחינה\nהשורה התחתונה:\nקורס מעניין בסך הכל ולא קשה במיוחד,אבל עקב סיבות כאלה ואחרות(חלקן פתירות וחלקן לא) הלמידה נפגעה מעט,וחבל\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: הייתי שם ברקע תוך כדי מטלות של קורסים אחרים. איטיים אבל הוא אומר דברים חשובים לפעמים. לדעתי לא חושב ללכת אבל מומלץ לקבל סיכום טוב/לעבור על המצגות ביסודיות\n\nשם המתרגל/ת: לירון\nחוות דעת - תרגולים: לירון מסביר טוב וברור, ובאמת מכין אותך לתרגילי בית ולמבחן. סטייל מבוא למדמ\"ח. שווה לעקוב\n\nשעורי הבית: היו 3 שפרסמו אותם בחןדש האחרון של הסמסטר ולכן היה לחץ זמן מטורף. בסה\"כ לא קשים מדיי, גם דומה לתרגילים של מבוא למדמ\"ח\n\nהמבחן: מאתגר אבל אפשרי להוציא ציון סביר למי שהשקיע\n\nהשורה התחתונה: קורס נחמד סה\"כ, לא לימדתי תכנות בפרקטיקה אבל כן ברעיוןף שדווקא היה נחמד\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: נועם\nחוות דעת - הרצאות: קשה לעקוב, אבל אומר המון דברים חשובים כך שכדאי לסכם אחריו.\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: מתרגל מצויין, מבין את החומר ברמה גבוהה, מעביר אותו בצורה מסודרת מאוד (המצגות שהוא בנה קלות להבנה) והוא מסביר אותם בצורה מעולה.\n\nשעורי הבית: בסמסטר שלנו היה בלגן בשיעורי בית כך שכמעט לא קיבלנו שיעורי בית עד לחודש האחרון והעמיסו אותנו (ואולי פספסנו אחד בגלל זה גם - לא בטוח).\n\nהמבחן: הוגן.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד מרצה מעולה, עזר והקשיב לכל טענה, עשה שעות קבלה והעלה פתרונות. הלוואי מרצה כזה בכל קורס (סייג בחלק המבחן).\nחשוב לא לוותר על ההרצאות, לא כל החומר מכוסה בתרגולים.\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: גם כמו אחמד השקיע, עזר והקשיב. סגל מעולה.\n\nשעורי הבית: 5 סה\"כ. עוזרים מאוד בהטמעת החומר, רלוונטים ובדיוק בעומס הנכון.\n\nהמבחן: לצערי מאוד לא פייר, ולא כי דביר ואחמד רעים.\nהרמה במבחנים בשנים הקודמות היתה שונה לחלוטין מהרמה במועד הזה, וגם מבחינת סוג המבחן -המבחנים הקודמים אמריקאים עם מעט מעט שאלות כתיבת קוד(וגם הכתיבה קצרה), ובמבחן הזה 7 שאלות כתיבת קוד כבדות וארוכות, רקורסיות ומבני נתונים, תרשימי UML כבדים, אף אחד לא סיים את המבחן.\nלצערנו גם זה לא שהיו דוגמאות לפתור מהן, רק 2-3 שאלות מבחינה דומה שאחמד העביר בכלל בc++, ככה שלא היו פתרונות רלוונטים. היה ממש קשה להתכונן כי פשוט לא ידענו למה להתכונן, והופתענו מאוד במבחן.. אחמד ודביר היו מעולים ולדעתי אם היינו עושים מבחן כמו בשנים הקודמות היינו מסיימים עם ציונים גבוהים מאוד (כי הקורס הועבר ברמה גבוהה מלכתחילה).\nחשוב לומר שהציון במבחן הוא לאחר הפקטור המשמעותי הבא:\n2+ציון המבחן+ (ציון המבחן-100)*0.33\nוזה 80% מבחן ו20% תרגילי בית.\n\nהשורה התחתונה: זה שסמסטר חורף יהיה עם מועדי א', ב', ג', יעזור לסמסטר הבא להתנהל בצורה טובה לקראת המבחן. לצערי הביקורת היחידה היא על רמת המבחן שלא בהתאם למשהו שבכלל היה לנו איך להתכונן אליו.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: המרצה הכי טוב שהיה לי by far\nהצורה שבה הוא מעביר את החומר כל כך טובה על גבול הפואטית , העובדה שהוא מבין את החומר בצורה מעולה תורמת לעניין, מה שכן לפעמים הוא מלמד קצת יותר מידי לעומק ודברים שלאו דווקא יהיו \"למבחן\" אלא יותר לחיים\nשזה מדהים , אבל לא בסמסטר עמוס שאתה רוצה ללמוד תכלס\nבנוסף ניכר כי אכפת לו מהסטודנטים ויחסי האנוש שלו מעולים משב רוח רענן לעומת מרצים שמוצאים בדרך כלל בקורסים גדולים\n* ביקורת זו נכתבה לפני המבחן , לפי מה ששמעתי וראיתי הוא מרכיב מבחנים ברמה גבוהה משמעותית מהמרצים שהעבירו את הקורס לפניו\nובכל זאת , עדיין ממליץ בחום\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: פשוט מתרגל מעולה הלוואי שכל המתרגלים שלי היו כמוהו מעבר לעבודה שהוא מעביר את החומר בצורה עניינית הוא שם בשביל הסטודנטים ורואים שבאמת אכפת לו , כמו שרשמתי למעלה משב רוח רענן לעומת המתרגלים שאני נתקל בהם בדרך כלל\n\nשעורי הבית: 5 גיליונות רטובים בערך שבועיים לכל אחד הגיליונות ברמה מאוד גבוהה ולי אישית גזלו המון המון זמן מהסמסטר ובאו על חשבון קורסים אחרים\n\nהשורה התחתונה: קורס שמלמד אותך לתכנת נכון\nלמי שאוהב את התחום זה קורס מושלם לדעתי וכנראה לא יהיה לו קשוח שהוא היה לי (לקחתי כקורס בחירה , לומד תעו\"נ )\nמי שפחות מתחבר או שאין לו רקע חזק בשפת תכנות כלשהי הולך לעבוד מאוד מאוד מאוד קשה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: לא נכחתי, ברם ראיתי מוקלטות\nאני סמסטר 8 חוזר על הקורס לשפר.\nלעניין, אחמד מרצה בין הטובים שהיו לי בתואר, אני אומר זאת על אף שראיתי מוקלטות, ובנוסף לזה שאני לא מתחבר לכל השבלוניות של OOP, אולם אחמד הצליח להעביר לי את הקורס בסבבה.\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: אחלה גבר מכיר אותו כבר מהקורס הקודם שעשיתי בהנדסת תוכנה.\n\nשעורי הבית: אפשר להעביר משנים קודמות\n\nהמבחן: רמה גבוהה מאוד, אבל זה לא מפתיע כי הרמה של המרצה מאוד גבוהה בתחום, הוא חי את התחום, גם כמות ההשקעה שלו בקורס ובסטודנטים, היא ברמה הכי טובה שראיתי בתואר שלי.\n\nשורה התחתונה: רק לומר תודה, ומקווה שהוא ילמד עוד סטודנטים בטכניון.\nברכה והצלחה לכולם.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד ג'בארה\nחוות דעת - הרצאות: מבחינת יכולות כמרצה, לא חושב שיש הרבה מרצים שעולים עליו גם באיכות ההרצאה, גם בהשקעה וגם באכפתיות לסטודנטים (תחריגו את המבחן). מעבר לעובדה שאחמד פשוט נושם וחי קוד ותוכנה וזה ניכר בשליטה האבסולוטית שלו בחומר, הוא גם רוצה כמה שיותר לשתף את האהבה שלו לזה עם הסטודנטים, והיכולת שלו להעביר חומר מדהימה. מעבר לזה הוא השקיע ברמות, ערך המון שעות קבלה מעבר ומיוזמתו ותגבר קבוע לקראת המבחן. באמת שאין מילים, אחד המרצים הטובים שראיתי.\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים: במילה אחת, מלך. מבין את החומר ברמה גבוהה, ומעביר אותו ברמה גבוהה. לא משעמם אצלו בתרגולים, והוא יודע להכניס עניין לחומר וגם לשתף את הכיתה. גם אצלו ממש ניכר היחס לסטודנטים והאכפתיות כלפי הקורס.\n\nשעורי הבית: היו ארבעה תרגילים תכנותיים מאוד כבדים אבל חשובים כי הם יישום של כל העקרונות שנלמדו בקורס. מומלץ מאוד לא לדחות לסוף, כי הם לוקחים המון זמן.\n\nהמבחן: לצערי זה החלק היחיד בקורס שבו הסגל (ובעיקר אחמד כנראה) נפלו. מאז שאחמד מרצה אחראי המבנה של המבחן שונה וכולל המון כתיבת קוד, מה שאומר שהוא הרבה יותר ארוך. המבחן ממש לא היה מתאים לשלוש שעות ואפילו הביאו 20 דקות הארכת זמן שגם לא הספיקו. הרמה של השאלות הייתה מאוד גבוהה וכל שאלה דרשה התעמקות בניואנסים חשובים בחומר שלפעמים אחמד הזכיר פשוט במשפט בהרצאה. התחושה הרווחת היא שהמבחן היה פשוט ארוך מדי, כבד מדי וקשה מדי. אני מקווה שסגל הקורס ילמד את הלקח לשנים הבאות (כי הם לא באו להכשיל וכשדיברנו איתם אחרי המבחן כן היה ניכר שהם הופתעו וקצת דאגו מהמצב). באופן כללי ממליץ מאוד להיות על הקורס כל הסמסטר ולהקדיש למבחן הזה לפחות שבוע כי הוא מאוד עמוס.\n\nהשורה התחתונה: סהכ קורס מעניין וחשוב לכל מי שהולך להתעסק עם קוד בתעשייה בעתיד. באמת מוציא אותך מתכנת יותר טוב והסגל איכותי ותותח ברמות, רק חבל שהמבחן אצלנו היה ממש מוגזם אבל נקווה שבשנים הבאות זה ישתפר.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: מעניינות אם כי חוזרות על התרגולים\n\nשם המתרגל/ת: אור\nחוות דעת - תרגולים: מ ל ך !!!\n\nשעורי הבית: ארוכים אך מעניינים\n\nהמבחן: קשה וארוך עד בלתי אפשרי, היה פקטור משמעותי במועד א'\n\nהשורה התחתונה: קורס מעניין אך מבחן לא פשוט\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: מעביר את החומר בצורה מעניינת, רואים שמאוד נלהב ומפגין הרבה ידע ועניין. אם כי לפעמים נכנס יותר מידי לעומק מה שגורם לו לחרוג מהזמנים.\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: יודע טוב את החומר, אבל התרגולים עמוסים מאוד ולא מותאמים לאורך של השיעור.\n\nהמבחן: מועד א' היה קשה משמעותית מהמועדים הקודמים, ארוך ובלתי אפשרי לסיום, ניסיון להכניס את כל קצוות החומר.. ניכר שלסגל כן אכפת וכן קשוב לסטודנטים אז נקווה שהמבחנים הבאים יהיו הוגנים יותר.\n\nהשורה התחתונה: קורס עמוס, חשוב להשקיע בשיעורי בית שיחסית מכסים את רוב החומר. חומר מאוד פרקטי למי שרוצה לעבוד עם תוכנה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: מרצה הכי איכפתי שפגשתי בחיי. בזכות אחמד הבנתי שתכנות זה בהחלט משהו שאני מתחברת עליו ורוצה להתעסק בו.\n\nשעורי הבית:\nלא קשים, אבל דורשים הבנה עמוקה של החומר. מאוד חשובים לשיפור יכולות תכנותיים.\nהמבחן:\nארוך וממש לא קל, אבל לדעתי בהחלט פתיר. הרמה של ההוראה בקורס מאוד גבוהה והמבחן בהתאם.\nהשורה התחתונה:\nקורס מאוד חשוב ומעיין. לא קל, אבל שווה את ההשקעה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: כמרצה אחמד מעולה. ההרצאות שלו מפורטות והבקיאות שלו (כולל ניסיון מהתעשייה שניכר שיש לו) באמת מוסיפות לחוויה. אף אחד לא יכול להתקיל אותו בחיים, בהבטחה.\nככותב מבחנים, זה כבר סיפור אחר.\n\nשם המתרגל/ת: אור ברמן\nחוות דעת - תרגולים: אור אחלה מתרגל, מעביר את החומר מעולה, יש אצלו אחלה אווירה בכיתה והתרגולים היו מאוד טובים. מדבר די מהר, זה אולי החסרון היחיד.\n\nשעורי הבית: יכולים להיות די כבדים אבל קריטיים בשביל להבין את החומר ובאופן מפתיע די רלוונטיים למבחן, למרות שהם תרגילים רטובים.\n\nהמבחן: המבחנים של אחמד קשים בצורה לא פרופורציונלית לקורס עצמו. הוא שואל על הדקויות הכי איזוטריות של החומר ובשביל להצליח צריך באמת להכיר את החומר טוב, להיות על הקורס כל הסמסטר ולשים לב לפרטים קטנים. המבחנים שלו גם ממש ארוכים ובדרך כלל יש פקטור משמעותי. עם זאת מניסיון, אפשר בהחלט להוציא ציון טוב עם לומדים נכון ושמים לב לדגשים של אחמד.\n\nהשורה התחתונה: הקורס עצמו ממש טוב. בהחלט קורס שמלמד את הסטודנטים לתכנת, ולחשוב כמו מתכנתים. מאוד רלוונטי לתואר בנתונים או בתכלס לכל אחד שהולך לכתוב קוד בחיים שלו, אבל הוא כן קורס קשה בגלל המבחן אז אסור לזלזל.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות:\nהרצאות מרתקות, רואים שאחמד עושה את זה כי הוא נהנה ללמד ובאמת רוצה שנבין. במהלך הסמסטר לקראת האמצע עושה שעת תרגול ממבחנים בזום בלי קשר להרצאנ לא חובה אבל נחמד מאוד לתרגל מבחנים ככה לאורך הסמסטר\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: המטלות כתובות כמו תרגיל ממש ארוך בהבנת הנקרא. להבין מה השאלה הרבה יותר קשה מהמטלה עצמה. ברשמה שפעם הוא נתן לנו שבועיים הערכה למטלה של שבועיים ועדיין אנשים לא סיימו וכבר פתחו פער בקורסים אחרים. אפשר לראות את התרגולים המוקלטים או להיות בפרונטלי אומר בדיוק אותו דבר. ממש חייבים לשנות את כתיבת המטלות דחוףףף\n\nשעורי הבית: תפנו לכם זמן נכבד, גם יפילו עליכם צמוד לקראת סוף סמסטר 2 מטלות כבדות. 5 מטלות לדעתי\n\nהמבחן: טרם היה\n\nהשורה התחתונה: החומר מעניין, אחמד מעניין ממש ועשה לי את הקורס\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות:\nמרצה מצוין, יודע את החומר, ומעביר אותו בצורה מאוד עמוקה. לפעמים הוא חוזר על אותו דבר הרבה פעמים, אבל בסופו של דבר הוא ממש טוב.\n\nשם המתרגל/ת: דביר טויטו\nחוות דעת - תרגולים:\nמתרגל לא משהו. מקריא ממצגות, ואפשר לעבור על התרגולים בלי הנוכחות שלו.\nשעורי הבית:\nקשים\nהמבחן:\nאחמד החליט לדפוק לנו מבחן מהסרטים. המבחן גם בדרך כלל *מאוד* לחוץ בזמן\nהשורה התחתונה:\nקורס מעניין וחשוב, חבל שהמבחן היה קשה :(\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד המרצה הכי טוב שנתקלתי בו בטכניון! אכפתי, קשוב, ובעיקר מעניין, אם כי קשה להחזיק ראש במשך 3 שעות הרצאה. אחמד משקיע הרבה מעבר לדרוש בסטודנטים וזה מתבטא בזמינות מסביב לשעון, תשובות ברורות ובנוסף שעות תגבור עם הדרכה פרקטית מעבר לשעות הקורס.\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: גנרי מאוד, מקריא את המצגות (הארוכות מאוד) ולמי שאין רקע בתכנות יכול להיות קצת קשה לחבר את הנקודות לפעמים בגלל שיש הרבה חומר להעביר בתרגול יחסית קצר.\n\nשעורי הבית: דורשים המון המון זמן. לפני הכל זאת משימה בהבנת הנקרא, ארוך מאוד וברוב הפעמים משולבת דרישה למימוש טכניקות שלא למדנו או שלא הובהר באופן ברור כיצד לממש. צריך הרבה עזרה מפורומים באינטרנט, יוטיוב, chatGPT כדי להבין לעומק.\n\nהמבחן: קשה, ארוך, פקטור. אל תצפו לסיים את כל השאלות ותדלגו מראש על שאלות שאתם חלשים בהן שלא שוות את היחס זמן-ניקוד. בסוף, סטטיסטית 85/90% עוברים.\n\nהשורה התחתונה: אחמד מרצה נהדר, המבחן קצת פחות. לא להתבייש לשאול שאלות. בהצלחה!\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: ד\"ר אחמד ג'בארה\nחוות דעת - הרצאות: רואים שמאוד אכפת לו מהסטודנטים.\nאולם, ההרצאות מאוד עמוסות אז הוא די התקשה לפנות זמן לענות לשאלות של סטודנטים.\n\nשם המתרגל/ת: דביר טוויטו/גל צור\nחוות דעת - תרגולים: הייתי אצל שני המתרגלים בחלק מהזמן ורואים שהם מבינים את החומר(האמת שדביר מעט יותר טוב).\nמפנים זמן לשאלות, אולם קורה לעיתים שלא מספיקים להעביר את החומר שבמצגת התרגול אז יש להשלים לבד אחר כך.\n\nשעורי הבית: נוראיים.\nמאוד מאוד מאוד עמוסים, אז אל תופתעו אם תאלצו בכל תרגיל בית להגיש רק ביום האחרון להגשה. המענה בפורום/שעות קבלה של המתרגלים לא מספק וקרה הרבה שנאלצנו הסטודנטים להתייעץ אחד עם השני במקום לשאול מתרגל.\nבנוסף, גם אם אתם נעזרים בבינה מלאכותית/חברים בקוד, תדאגו לשנות אותו כמה שיותר, והסיבה לכך היא שהאלגוריתם שסגל הקורס משתמש בו מאוד רגיש להעתקות ובערך שליש קורס קיבלו לפחות פעם אחד \"חשד להעתקה\" גם אם הקוד הבאמת \"מועתק\" ממש קצר באורכו. בנוסף, תוודאו לפני ההגשה שאתם עומדים בהוראות לכל תרגיל בית וזאת מכיוון שמספיק שיש משהו קטן שלא תואם ואז מקבלים ישירות 0 מבלי יכולת לערער. כמו כן, תתכוננו לקבל את התשובות לתרגילי בית רק לקראת סוף הסמסטר/בזמן תקופת המבחנים.\n\nהמבחן: לא יודע מאיפה להתחיל חחח.\nמבחן עמוס ברמות מטורפות. מרגיש כאילו מדובר בראיון עבודה ולא במבחן שאמור לייצג רמה של סטודנט שרק סיים ללמוד את הקורס. יש פקטור מטורף בהתאם, אז לא לדאוג גם אם לא הספקתם לפתור הכל.\n\nהשורה התחתונה: קורס מאוד חשוב מבחינת הקניית היסודות בתכנות באופן כללי, ולא רק בג'וואה, אז מומלץ להשקיע וכנראה שבהמשך התואר חלק גדול מהעקרונות שנלמדו בקורס זה יבואו לידי ביטוי בקורסים נוספים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: מאוד מרצה טוב כדאי ללכת להרצאות ולרשום הערות על כל מה שהוא אומר, קל לראות שהוא אוהב את מה שהוא מלמד ומתעמק בדברים שמאוד מעניניים לפעמים מתעקב על דברים מובנים.\n\nשם המתרגל/ת: דביר\nחוות דעת - תרגולים: אני אישית לא הלכתי לאף תרגול ולמדתי אותם לבד, הרגשתי שהם רק קוראים מהמצגות וקשה להתרכז בתרגולים אז העדפתי ללמוד אותם לבד, אם אתם לא אוהבים למידה עצמית עדיף ללכת.\n\nשעורי הבית: מאוד מאוד עמוסים כדאי לכם להיות שותפים עם אנשים שאתם מכירים ומוכנים לשבת איתם להרבה שעות, כדאי להשקיע בשעורי הבית וללכת לשעות קבלה ולשאול, לפעמים להתעיץ בסטודנטים אחרים, אבל לשים לב מהחשד אם אתם מתיעצים רק על הרעיונות וכדאי לא לראות את הקוד שלהם כי חשד יכול לגרום ל 0 על עבודה שלקחה מכם ימים, להשתמש באינטרנט וב chatgt רק במקרים חריגות, עדיף לחזור לתרגול ולהרצאות ולא להשתמש בהם כי הוא מטעה לפעמים.\n\nהמבחן: מאוד קשה, ומאוד ארוך תשקיעו בדרך הנכונה, אם יש שאלה שלא מסתדרים בה תחזרו אליה אחרי זה ותמשיכו במבחן.\n\nהשורה התחתונה: לדעתי יותר קשה מאינפי אז תשקיעו בו ואל תחכו למבחן כדי להבין דברים, וצריך להתוכונן טוב למבחן.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: אחמד ג'בארה\nחוות דעת - הרצאות: מרצה מעניין בטירוף, אני נהניתי מההרצאות למרות שזה שלוש שעות רצופות וזה קצת קשוח.\nהוא שואל במבחן על כל משפט שנאמר בהרצאה אז חשוב להקשיב ולהפנים. לא לצבור פער בחומר כי מתקדמים מהר מאוד, אם כי השיעורי בית והתרגולים מאפסים כל פעם על החומר.\n\nשם המתרגל/ת: דביר טויטו\nחוות דעת - תרגולים: אכפתי מאוד לסטודנטים, חד על החומר גם בהבנה העמוקה של הדברים, משקיע, מצגות טובות, וקשה מאוד להקשיב לו. לוקח זמן להתרגל..\nתכלס בתרגולים הוא הקריא את המצגות פשוט, אבל עדיין שווה לבוא בעייני כי זה המון חומר לקרוא לבד ובתרגולים מתחדדים דברים תוך כדי. בהקלטה זה עוד יותר משמים.\n\nשעורי הבית:\n5 תרגילים לאורך הסמסטר, עמוס מאוד. תרגילים כבדים שלקחו לנו באיזור ה20 שעות לתרגיל בטוטאל. להתחיל ברגע שמשתחרר ולבוא לשעות קבלה כשדברים מסתבכים זה מאוד עוזר במקום לשבור את הראש. לעשות אותם כמה שיותר לבד, זה ישתלם למבחן.\n\nהמבחן:\nארוך בטירוף וקשוח. מבחינת אופי השאלות די משקף את מה שהיה בהרצאות ובשיעורי בית. לא לבזבז זמן על השאלת רקורסיה. צריך לשלוט בחומר עד לפרטים הקטנים וגם להיות מהירים מאוד בשאלות קוד היותר ארוכות, עדיף גם על חשבון דיוק בפרטים. פשוט לתרגל כמה שיותר מבחנים קודמים.\n\nהשורה התחתונה:\nבעייני קורס מאוד מעניין ובסיסי, דורש המון השקעה וזמן.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: אחמד ג'ברה\nחוות דעת - הרצאות: אחמד בין המרצים המדהימים שפגשתי ,למרות שהחומר לא פשוט אחמד יודע כיצד לעורר את האולם וליצור עניין בכל סטודנט וסטודנט ,פשוט אלוף !\n\nשם המתרגל/ת: דביר טויטו\nחוות דעת - תרגולים: דביר בסה\"כ מתרגל בסדר ,שולט מעולה בחומר ,הייתי ממליץ לשפר את האינטראקציה אל מול הסטודנטים ,יתר על כן הייתי ממליץ לתת משוב על שעורי הבית כשבוע/שבועיים לאחר הגשתם ולא סמוך למועד המבחן.\n\nשעורי הבית: שעורי הבית אינם פשוטים אך מלמדים היטב את החומר הנלמד.\n\nהמבחן: ארוך בצורה נוראית אך אפשרי.\n\nהשורה התחתונה: קורס נורא עמוס ,ע\"פ דעתי לא מצדיק 3.5 נק\"ז (זכאי ליותר) ,כל הזדמנות שיש לכם ללמוד אצל ד\"ר אחמד גברה קפצו עליה!\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד הוא המרצה היחיד , אז זה לא שיש לכם אפשרות אחרת...\nכמו שאמרו לפניי, הוא מרצה מעולה מבחינת יכול העברת החומר. ההרצאות ארוכות וקל ללכת לאיבוד. החיסרון הגדול שלו זה שהוא לא יודע לבנות מבחנים.\n\nשם המתרגל/ת: גל צור\nחוות דעת - תרגולים: גל בסדר גמור יחסית לסטודנט\n\nשעורי הבית:\nארוכים וקשים. פעמים רבות הייתי צריך להיעזר בStack overflow בשביל לסיים את שיעורי הבית. השתדלתי לא להשתמש בchat gpt ואני יכול להעיד שזה עזר לי לקבל ציון יותר גבוה במבחן מרוב החברים שלי שכן השתמשו בו(פער של כ20 נקודות ויותר). נסו כמה שפחות להיות תלותיים בזה ולנסות לפתור בעצמכם(ככה גם תזכרו את הטריקים של שעורי הבית יותר טוב).\nחיסרון נוסף של הסגל זה שהחזירו תשובות לשיעורי הבית כחודשיים לאחר ביצוע כל אחד מהם וזה יצר מצב שאי אפשר היה ללמוד מהמשובים כמו שצריך וליישם אותם. בנוסף היו קלטים שהם לא פרסמו לאחר ביצוע הבדיקות שלהם וכמעט אי אפשר היה לערער.\nקחו בחשבון ששעורי הבית יגזלו לכם זמן רב וכדאי לתכנן את הלוז שלכם טוב כדי להשקיע גם בשאר הקורסים.\nהמבחן:\nהבעיה העיקרית במבחן היא הזמן. גם אלו עם תוספת הזמן(לצערי אני לא ביניהם) מתקשים לסיים את המבחנים של אחמד בזמן. הטענה של אחמד היא שאנשים עונים לא לעניין ומוסיפים פרטים מיותרים ולכן לא מספיקים לענות על כל המבחן. הבעיה היא שהמבחן מפוצץ במלל(שחלקו בכלל לא חיוני ואתם תבינו את זה כשתתחילו לפתור מבחני עבר) והשאלות מאוד מסיביות. המבחן דורש המון תכנון מראש של מה שהולכים לכתוב ואין לזה מספיק זמן בבחינה. זאת החולשה הגדולה של אחמד וזה לא הולך להשתנות. אחמד נותן פקטורים מסיביים כל סמסטר שהם פקטורים לעניים. כלומר, ככל שאת מקבל ציון נמוך יותר הפקטור שלך גדל. בגלל, שהמבנה די קבוע, הטיפ שלי זה להשקיע בשאלה של תכנות מונחה עצמים שהיא שאלה מסיבית עם הרבה ניקוד ולנסות לתכנן בה כמה שאפשר מבחינת Top down design .\n\nהשורה התחתונה:\nקורס מעניין מבחינת החומר. מרצה שיודע להעביר את החומר , אך לא יודע לכתוב מבחן. בערך כל סמסטר 80 אחוז עוברים, אז אם אתם ממוצעים אתם אמורים להסתדר.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחלה מרצה...\n\nשם המתרגל/ת: דביר (מוקלט)\nחוות דעת - תרגולים: דביר יותר טוב משאר המתרגלים שקיימים\n\nשעורי הבית: אלה לא שיעורי בית... אלה פרוייקטים שלא נגמרים\n\nהמבחן: מבחן קשה מאוד.. יש להתכונן די טוב\n\nהשורה התחתונה: מרצה מאוד טוב אבל המבחנים שלא בכלל לא :)\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: המרצה בין הכי טובים לא רק בפקולטה אלא בטכניון כולו\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: אחלה מתרגל תמיד נכון לעזור\n\nשעורי הבית: זה נכון שהשיעורי בית ארוכים . המלצה שלי לכל ת.ב תיקחו כ-30 שעות עבודה (זה משמעותית יקח פחות מזה אין מה לדאוג ) ופשוט תעבדו על זה לבד ביחד עם stackoverdlow זה יעזור לכם משמעותית במבחן\n\nהמבחן: אני חושב שפה יד את נקודת האכילס של אחמד . אחמד לא כותב מבחנים שהם בהכרח קשים אך הם מאוד ארוכים שאפילו כאלו עם תוספת זמן יתקשו לסיים את המבחן בזמן מה שהוא מפצה על כך עם פקטור .\nהדרך שיש לעבוד בעיני היא :\nאת השאלה של הרקוסיה תשאירו לסוף אם יש זמן נהדר אם לא , לא נורא היא רק 8 נקודות.\nשאלת uml , תתחילו איתה הם לרוב די פשוטות ולא צריך לקחת הרבה זמן לסיים אותם (כ-20-25 דקות )\nתעברו לשאלה ה-3 : זוהי שאלת גדולה שמתעסקת במה שראיתם בתרגיל בית , פשוט תתחילו לפתור על מנת להשיג כמה שיותר נקודות , נתקעתם תעברו לאחת מן שתי השאלות האחרות (תמיד יש גם שאלת הבנה וכדומה לא משהו קשה ) . אל תגיעו בגישה לפתור את כל המבחן אלא תגיעו במטרה לפתור כמה שיותר על מנת להשיג כמה שיותר נקודות ואתם תסיימו בצורה יפה את הקורס .\n\nהשורה התחתונה: אחלה קורס בסך הכל הכללי אפילו עבור אדם כמוני שלא בהכרח מתעניין בפיתוח תוכנה , אני מודה שהקורס הזה חשוב ורלוונטי . עוד המלצה תקראו את מה שאחמד שולח וגם יש ספרים ממש טובים שאם יש נושא שלא ברור לכם עד הסוף אז תקראו אותו ואתם תהיו בסדר\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\n\nחוות דעת - הרצאות: מבחינת אדם, אחמד מקסים, משקיע, ובאמת יעשה הכל בשביל שהסטונדטים יצליחו גם במהלך הסמסטר וגם לקראת המבחן. מבחינת מרצה, דעתי הלא פופולרית זה שהוא לא כזה טוב, מרגיש שהוא חופר ברמות שכבר אתה מאבד את הפואנטה, וגם הוא לקח לנו יותר מדי פעמים את הצהד במהלך הסמסטר כי הוא לא הספיק להשלים את החומר\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: גל גבר רצח, מסביר מעולה, מכיר את כל הסטודנטים והתרגולים באמת עוברים בציל ובכיף. התרגולים עצמם קשים ומלאים בסינטקס אז לגמרי אפשר לצאת בהרגשה שהבנת ואז להבין שבאמת לא הבנת כלום\n\nשעורי הבית: לא נוראיים בכלל אם יש לכם שותף טוב, ערב אחד להקדיש רק לזה וסיימתם\n\nהמבחן: הסמסטר היה יחסית קל אבל צריך הרבה זמן להתכונן כדי לדעת הכל\n\nהשורה התחתונה: נחמד יחסית\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות:\nלא כזה התחברתי\nשם המתרגל/ת: שי\nחוות דעת - תרגולים:\nשי תותח על\nשעורי הבית:\nקשים וארוכים\nהמבחן: האמת היה הוגן\n\nהשורה התחתונה: למי שאוהב לתכנת אחלה קורס, למי שפחות , באסה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות:\nאחמד מרצה מעולה! אומנם הוא מדבר הרבה אבל ממש ממליצה להקשיב לו (כל הניואנסים ממש חשובים לדעתי כדי להבין לעומק את החומר). הוא גם בנאדם ממש טוב ונכון לעזור\n\nשם המתרגל/ת: גל צור\nחוות דעת - תרגולים:\nהתרגולים ממש מובנים ומסודרים! גלצור הוא באמת המתרגל המושלם - יודע את החומר ולהעביר אותו בצורה מיטבית ובנאדם מדהים. מעבר לזה, בכל הגיליונות בית גלצור היה נכון להסביר ולעזור במה שאפשר כדי שנצליח.\nבקיצור סגל מושלם שממש ניסו להתחשב בנו!\n\nשעורי הבית:\nארוכים אבל חשובים.\n\nהמבחן:\nארוך ובודק הבנה מעמיקה של החומר.\n\nהשורה התחתונה:\nממש ממליצה על הקורס!\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד ג'בארה\nחוות דעת - הרצאות: מרצה טוב ומובן.\n\n\nשם המתרגל/ת: גל צור\nחוות דעת - תרגולים: לא הכי מובן, לפעמים מנסה להסביר מושג ורק הופך אותו לפחות מובן\n\nשעורי הבית: מטלות הבית היינן ארוכות ומצריכות עבודה משותפת.\nמלמדות, אך לא בהכרח מכינות למבחן\n\nהמבחן: המבחן משמעותית יותר קשה מכל מטלה בית או השאלות עליהן עוברים בשיעורים.\nבנוסף בדיקת המבחנים היינה שרירותית, אני לדוגמא פתרתי תרגיל באופן זהה כמו סטודנט אחר, הוא קיבל את מרב הנקודות ואני קיבלתי 0 בשאלה.\n\n\nהשורה התחתונה: קורס קשה, מלמד ומורכב.\nחבל מאוד כי המבחן לא ברמה של התרגולים ומטלות הבית וכי הבדיקה לא עקבית.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות:\nמכל המרצים שפגשתי אחמד הכי אוהב ללמד ורוצה להשקיע את זמנו כדי שהכל יהיה מובן.\nההרצאות ארוכות ומייגעות הרבה פעמים, אבל חשובות להבנה של החומר. אחמד מאוד אוהב את התחום, מסביר מכל הלב ויודע לענות על כל שאלה ולהסביר כל דקות, שזה גם נהדר וגם לא קל לעכל בתור סטודנט.\n\nשם המתרגל/ת: גלצור\nחוות דעת - תרגולים:\nגלצור מעביר את הכל באווירה טובה, מעודד שאילת שאלות ותמיד יודע לענות. מעבר לזה בנאדם ממש מקסים ושמח לעזור בכל דבר שצריך (בין השאר בתרגילי הבית שזה חיוני).\nבנוסף, המצגות של התרגולים מפורטות ממש ונוחות לחזרה על החומר.\n\nשעורי הבית:\nארוכים ממש :(\nיוצא תרגיל בערך פעם בשבועיים, יש סה\"כ 6 תרגילים (0-5), כשהסמסטר לא מקוצר כולם חובה.\nמומלץ להקדיש לזה את הזמן ולהבין על כל דבר למה הוא ככה, אם לוקחים קוד של אחרים או שואלים את הצאט זה משתקף בסוף בציון של המבחן...\nמה שלא יושב טוב כדאי לשאול בשעות הקבלה!\n\nהמבחן: ארוך מאוד, יש שאלה בכל נושא שנלמד, כדי להצליח בו צריך להיות מיומן בשטיקים הקטנים שאחמד אוהב (וזה מצריך להקשיב בהרצאות גם כשמעיק). אציין שכל פרט קטן שיש במבחן היה בהרצאות או תרגולים, אף פעם לא שולפים נושאים חדשים שלא הועברו על ידי הסגל.\nהשאלות כוללות הרבה יותר נושאים מכל תרגיל בית וזה אתגר מסוג אחר לגמרי, אז לא לצאת מנקודת הנחה שאם הצלחת את תרגילי הבית תפציץ במבחן.\n\nהשורה התחתונה: קורס פילוסופי בהרבה מובנים, בודק המון הבנה של ההגיון של מאחורי הדברים ולא רק את יכולת לכתוב קוד שעובד.\nהסגל מאוד מסור ורוצה ללמד ומומלץ בחום לנצל את שעות הקבלה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: המרצה מעביר את החומר בצורה ברורה ונהירה, וממש מרגישים את המומחיות והשליטה שלו בנושאים הנלמדים. הוא מציג דוגמאות רלוונטיות ומסביר בצורה מעמיקה את העקרונות הבסיסיים, מה שממש מסייע להבנה מעמיקה של החומר.\n\nשם המתרגל: גלצור\nחוות דעת - תרגולים: גלצור הוא מתרגל יוצא דופן. הוא מצליח לפרק נושאים מורכבים לחלקים פשוטים ומובנים בצורה מעוררת השראה. התרגולים שלו לא רק משלימים את ההרצאות אלא מוסיפים ערך עצום בזכות הדגמות ותרגולים מעשיים. כל הסבר שלו נמסר בבהירות עם אכפתיות אמיתית לסטודנטים – מתרגל מצטיין ומודל לחיקוי.\n\nשעורי הבית: שעורי הבית היו מאתגרים מאוד ודרשו השקעה ניכרת. למרות האורך והקושי, הם תרמו רבות להבנה ולפיתוח כישורי הנדסת התוכנה. בהחלט מדובר במטלות שמדרבנות אותך לחשוב וליישם את מה שלמדת.\n\nהמבחן: המבחן היה קשה, אך הוגן ומותאם לחומר שנלמד. השאלות נבנו בצורה שמאפשרת לבחון הבנה אמיתית ויכולת יישום ולא רק שינון.\n\nהשורה התחתונה: קורס מצוין ומומלץ במיוחד, מרצה ברמה גבוהה מאוד ומתרגל מדהים ששם את הסטודנטים במרכז.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: 10/10 הייתי ממליץ. ממש אכפת לאחמד שיבינו והוא מסביר מעולה. אווירה טובה ומצליח להפוך את זה למעניין.\n\nשם המתרגל/ת: גל צור\nחוות דעת - תרגולים: סבבה, העביר טוב את המצגות. מי שלא מתחבר יכול להבין מהמצגת הכל\n\nשעורי הבית: לא ארוכים מדי אבל דורשים סבלנות\n\nהמבחן: הוגן לגמרי\n\nהשורה התחתונה: כנראה קורס חובה הכי טוב בסמסטר 2\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד גבארה\nחוות דעת - הרצאות: ממש אוהב את הנושאים שהוא מלמד וכיף לראות שאכפת לו מהתלמידים, אבל בעיניי ממש חופר וקשה להישאר מרוכזים בהרצאה. עדיף לראות את ההקלטות על 1.5 ולספוג את עיקר הדברים.\n\nשם המתרגל/ת: שי זינגר\nחוות דעת - תרגולים: אחלה גבר, ממש מפשט את החומר ומלמד בגובה העיניים ובאווירה טובה.\n\nשעורי הבית: מאוד ארוכים ומלאים בניואנסים והחלטות שרירותיות של המתרגל האחראי. תתכוננו להקדיש להם הרבה זמן, וחשוב מאוד לעקוב אחר מוסמכות הקידוד + העקרונות הנלמדים בקורס. לא מספיק שהקוד יעבוד.\n\nהמבחן: לא מאוד קשה אבל כן מאוד ארוך. הוסיפו לנו חצי שעה במהלך המבחן מרוב שהיה ארוך ולא היה זמן. אחמד בוחן על כל הנושאים שהוא מלמד, תקדישו זמן ללמידה למבחן, בעיקר לעשות מבחני עבר כי המבנה של המבחן נשאר די זהה, במיוחד שאלה 3 הידועה לשמצה. בנוסף היה פקטור.\n\nהשורה התחתונה: הקורס עצמו מעניין ולמי שאוהב לתכנת יהיה סבבה, לומדים עקרונות חשובים. דורש הרבה זמן והשקעה אבל אפשר להצליח בו.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: אחמד\nלא יודע איך בביקורות אפשר לכתוב משהו טוב כאן (ההרצאות כן מעניינות וגם החומר, למי שאוהב תכנות אבל זה לא קשור).\nהממוצע של הקורס מזעזע וסתם חבל כי בסוף נותנים לך מבחן לא כדי לבחון אותך על מה שלמדת במהלך הסמסטר ועל עקרונות ופרדיגמות אלא מבחן ברמה של ריאיון עבודה ומטלת תכנות לבית. מה גם שלא בודקים בצורה שווה (איך אני יודע?....)\n\nשעורי הבית: ארוכים ומייגעים אבל אפשריים\n\nהמבחן: לא סביר, כמות של שליש תלמידים נכשלים כל סמסטר מאז שאחמד מרצה כנראה לא אומר כלכך משהו על התלמידים\n\nהשורה התחתונה: לא מומלץ בכלל, ביזיון לתת לקורס כזה להמשיך כל סמסטר עם פאדיחות באורך המבחן (שתמיד הזמן לא מספיק, אם לא מספיק אז יותר מידי חומר/שאלות זה א' ב')\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד מרצה מצוין, קל לראות שהוא מאוד אוהב את החומר שהוא מלמד. ההרצאות היו מעניינות ואינטראקטיביות. חלק מההרצאות הועבר עם מצגות וחלק היה הדגמות של קוד במחשב.\n\nשם המתרגל/ת: גל\nחוות דעת - תרגולים: גל יודע את החומר ומסביר טוב. המצגות של התרגולים הן בעברית ועובדות יותר טוב בתור סיכום של החומר עם דוגמאות.\n\nשעורי הבית: יש כל שבועיים תרגיל בית שעושים בזוגות. לוקח כמה שעות טובות אבל זה תרגול מצוין של החומר, ברמה לא פחות ממבחנים.\n\nהמבחן: יכול להיות קצת לחוץ בזמן, למרות שצוות הקורס מתחשב ובדרך כלל נותן עוד זמן לפי המצב של רוב האנשים. פורמט השאלות והנושאים מאוד עקביים, כך שהיה נוח ללמוד למבחן.\n\nהשורה התחתונה: עבורי זה היה קורס מאוד מעניין. למי שמתאפשר לו לקחת את הקורס בחורף, מאוד מומלץ כי יש משמעותית פחות אנשים וההרצאות היו כמעט כמו שיעורים פרטיים.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד מאוהב בהנדסת תכנה, וזה גורם לו להסחף המון ולדבר ולהדגיש דברים מאוד מאוד קטנים או דקויות ממש הזויות שאתה בטוח שלא רלוונטיות ופתאום בום שאלה של 8 נק על הערה שהוא זרק בשעה 2 של הרצאה 4 במבחן\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: טל אחלה מתרגל, סבלני תמיד לכולם ובאמת ניכר שהוא רוצה לעזור\n\nשעורי הבית: קשים ממש, כל שיעורי בית לוקחים המון זמן, והרבה פעמים ההוראות שלהן לא ברורות או לא מלאות אז יוצא שמהרגע שהמשימה יוצאת עד שצריך להדגיש היא השתנתה כמה פעמים. סיוט לעקוב סיוט לעשות\n\nהמבחן: מה לא נאמר על המבחנים של אחמד, קשים בצורה הזויה, ארוכים ברמה שמוסיפים לכולם עוד חצי שעה מעבר ל3 שיש, ובכל שנה אחמד יכול לשנות לגמרי פורמט של אחת השאלות ואם נפלתם על שנה כזאת הלך עליכם\n\nהשורה התחתונה: הקורס הכי קשה בשנה א, משוכה שכל סטודנט בפקולטה צריך לעבור. בהצלחה באמת\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: רואים שאחמד מאוהב במקצוע שלו. אני חושב שיש לו רגשות עזים ואמיתיים לחלק מספות התכנות. הוא מסביר המון דברים לעומק ואוהב להיכנס לנישות והרבה מאחורי הקלעים של מה שקורה בקוד. מרב נלהבות חצי מהפעמים הוא בקושי שם לב שיש זמן להפסקה ומצידו הוא יכול גם להמשיך לדבר עוד 5 שעות. יש הטוענים שהוא חופר, אבל הוא בסך הכל אוהב ונלהב לשתף את הידע שלו.\n\nשם המתרגל/ת: טל אלוני\nחוות דעת - תרגולים: מושלם. טל עובר בעיקר על התכנים שיופיעו במבחן והוא עובר בדייקנות על על הנושאים שאחמד עובר עליהם, רק מהצד המעשי ולא התאורתי. טל יודע ומבין מה הוא עושה, הוא סבלני, רגוע, וכל ומערך התרגולים שלו לא מרגיש כמו חפירה. זה ממוקד והופך לפעמין למעין שיחה ונסיון פתרון של הכיתה ביחד.\n\nשעורי הבית: יש 6 תרגילי בית שזה בערך אחד לשבועיים. תרגילים מעיקים אבל חייב לעשות כי הציון תקף. כל התרגילי בית מכינים אותכם לבערל שאלה אחת או שתיים שיש במבחן. כל אחד מהם זה מן בניית מערכת כזו וכל פעם עם סיפור אחר ומטרה אחרת. ההוראות ארוכות ולפעמים לא ברורות. קשה להבין מאיפה בכלל להתחיל ומאוד קל לאבד את הימין ואת השמאל. לקח לנו בערך 4 שעות לפני שבכלל מתחילים דיבאגינג. שמעתי גם אל סטונטים שיכולים להעביר על כל תרגיל מעל ל 10 שעות .\n\nהמבחן: מהר תבינו שזה אחד המבחנים הקשים שיש לפקולטה הזו להציע. ול3.5 נקז זה השקעה מרובה. אחמד עלול לכלול איזה סעיף של נישה שהוא אמר בהרצאה ואין לדעת על איזו שאלה אתם תפלו. יש למבחן יש פורמט שחוזר על עצמו (שאלה אחד היא תמיד בנושאים האלו ו 2 בנושא אחר וכו...) אבל תוכן השאלה עלול להשתנות מקצה לקצה וזה מאוד מאוד לא צפוי. המבחן עמוס. וצריך להבין טוב מאוד מה אתה עושה בכל שלב בשביל לא ליפול ללחץ של זמן. זה סוג המבחנים שרב הסטודנטים רק מתפללים לעבור.\n\nהשורה התחתונה: אין מה לעשות. קורס חובה. עוברים גם אותו.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד ממש אוהב את החומר וכיף להקשיב לו. ההרצאות עצמן לא באמת כאלה מעניינות אבל אחמד ברור והשלוש שעות האלה עוברות די בסבבה.\n\nלא הלכתי לתרגולים, לא חושב שזה הכרחי אם יש לכם רקע בחומר(נניח מהתיכון).\nשעורי הבית: ארוכים ומסובכים בלי סיבה. חצי מהזמן יש מידע סותר בין מה שרשום בגיליון למה שרשום בקבצי פלט.\n\nהמבחן: ארוךךךךךך. לא חושב שדיברתי עם אדם אחד שעשה את הכל. הרמת קושי לא גבוהה אבל גם יש ענייני סינטאקס שמרגיש כאילו סתם באו לשדוד נקודות. יש פאקטור של איזה 4 נקודות כמעט כל סמסטר.\n\nהשורה התחתונה: אני אוהב את אחמד אבל וואו קשה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד גבארה\nחוות דעת - הרצאות: אחמד המרצה האהוב עליי עד כה בטכניון, כמה פאשןןןןןן אעאעאעאעאעאע כן יירבו. חשוב לו מאוד להראות ולהסביר לנו מעבר, יחד עם זאת אני חושב שזה די חבל שבזמן ההרצאות מבזבזים די הרבה זמן על הסברים על סינטאקס כי אפשר להתעכב על זה בתרגולים ולתת זמן בהרצאה לקונספטים עצמם או לתבניות עיצוב שזה נושא מאוד חשוב שלא יצא לנו כמעט לגעת בו.\n\nשעורי הבית: יש איזו בודקת אחת בלי שמות שאני רק מאחל לה שתאכל איזה משהו מתוק לפני שהיא מתחילה לבדוק את התרגילים ולתת 0 על כל שטות\n\nהמבחן: לא קל בכלל, מי שבא עם ניסיון יכול להשקיע יותר ברעיונות ופחות בכתיבת קוד וזה עוזר כמובן\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות:\nהבן אדם מת על המקצוע הזה, רואים את זה עליו הוא מסביר את החומר מאוד מאוד מורחב ומחייך וגם פשוט פותח קוד אם צריך וכותב יחד איתנו בהרצאה ומסביר לנו על איך לפתור. נחמד נחמד אבל במבחן הוא מגזים ממש, לפעמים זולג עם הדיבור לחומר שלא קשור למבחן שלנו בכלל\n\nשם המתרגל/ת: טל אלוני\nחוות דעת - תרגולים: בין המתרגלים היחידים שהייתי אצלם שאשכרה יודעים את החומר של הקורס שהם מתרגלים בו! הוא מטורף ונחמד ממש וטוב לדעת שיש מתרגלים כאלה, גם בשעות קבלה לפני המבחן ישב איתנו מלא (יותר משעתיים אפילו) וענה על כל השאלות ועזר לנו\n\nשעורי הבית: התחיל בטוב, התדרדר אחרי כמה.. מורידים מלא על טעות קטנה\n\nהמבחן: קשה של החיים, לא מובן למה הרמה ככה באמת ולמה הם חושבים שזה לגיטימי באמת לכתוב מבחנים כאלה?\n\nהשורה התחתונה: קורס קשה מאוד, מקווה שתיהיו עם טל אלוני\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: אחמד מרצה מעולה, בעל תשוקה ללמד. תמיד עונה על שאלות וזמין לעזרה לסטודנטים\n\nשם המתרגל/ת: שגיא דקל\nחוות דעת - תרגולים: שגיא מתרגל מעולה, מסביר בצורה טובה את החומר, יחזור כמה פעמים שצריך על מנת שנבין בצורה המיטבית את הדגשים.\n\nשעורי הבית: בערך 5 תרגילים, לרוב לא מאוד קשים אבל כן מצריכים המון מחשבה. ההמלצה היא לכתוב בעצמכם כי זה ממש יעזור למבחן\n\nהמבחן: ארוך וקשה מאוד. עדיף להתחיל להתכונן כבר תוך כדי תרגילי הבית. צריך לכתוב הרבה קוד על דף וצריך לזכור את הניואנסים הקטנים של כל דבר\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: אחמד\nחוות דעת - הרצאות: מסביר טוב, אך מיותרות.\n\nשם המתרגל/ת: הקלטות\nחוות דעת - תרגולים: נותנים הבנה כללית של החומר.\n\nהמבחן: פשוט קשה ברמות. המועד ב הוא על התעריף. נתנו שאלות שבכל שאלה הייתה טעות. בגלל זה אנו שבועיים על הקצה ומקווים לפקטור. בכלל לא היה מובן למה כל כך להקשות! ומה קשור אסמבלי?!? מה רצו ממנו?!?\n\nהשורה התחתונה: קורס קשה מאוד. אמן כולנו נעבור.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 5.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nאביב 2025       א' 63  ב' 61  סופי 68  גבארה אחמד\nחורף 2024-2025  א' 61  גבארה אחמד\nאביב 2024       א' 66  ב' 66  סופי 71  גבארה אחמד\nחורף 2023-2024  א' 62  ב' 61  סופי 66  גבארה אחמד\nאביב 2023       א' 59  ב' 56  סופי 61  גבארה אחמד\nחורף 2022-2023  א' 65  ב' 63  סופי 68  גבארה אחמד\nאביב 2022       א' 69  ב' 66  סופי 73\nחורף 2021-2022  א' 69  ב' 64  סופי 69\nאביב 2021       א' 73  ב' 67  סופי 75\nחורף 2020-2021  א' 85  סופי 84  כהן נועם אשר\nאביב 2020       א' 71  ב' 78  סופי 78  כהן נועם אשר\nאביב 2019       א' 72  ב' 62  סופי 71  שלייפמן אלכסנדר\nחורף 2018-2019  א' 68  ב' 69  סופי 76  שלייפמן אלכסנדר\nאביב 2018       א' 70  ב' 73  סופי 73  גבארה אחמד\nחורף 2017-2018  א' 71  ב' 69  סופי 73  גבארה אחמד\nאביב 2017       א' 74  ב' 71  סופי 78  מאיר רשף\nחורף 2016-2017  א' 76  ב' 49  סופי 75  שטוק אנה\nמבחן מועד א': 60\nסופי מועד א': 63\nמבחן מועד ב': 57\nסופי מועד ב': 61\nסופי: 68\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n203 168 35 83 10 98 68.03 70\nאיש סגל תפקיד\nגבארה אחמד מרצה - אחראי מקצוע\nאלוני טל מתרגל - עם הרשאות מרצה אחראי\nסלונימסקי ים מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}