{
  "course_id": "097249",
  "scraped_at": "2025-12-16T13:57:02.179805",
  "information": {
    "raw_text": "00970249 - למידת מכונה בקבלת החלטות סדרתית\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס מתמקד בלמידת מכונה לקבלת החלטות סדרתית תחת אי-ודאות, הרלוונטיים לספקטרום רחב של בעיות כמו: פרסום מקוון, מערכות המלצה, ניסויים קליניים, רשתות תקשורת ועוד. מטרת העל בקורס היא לחקור מגוון של אלגוריתמי למידה המותאמים לסיטואציות אלו, יחד עם הצגת הוכחות ריגורוזיות להבטחות האלגוריתמים, בדרך כלל לגבי מזעור חרטה. הגישה האנליטית בקורס תסתמך על כלים מתקדמים בהסתברות, סטטיסטיקה ובתורת האינפורמציה.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. למדל סיטואציות פרקטיות מהעולם האמיתי כבעיות קבלת החלטות סדרתית.\n2. לתכנן ולנתח אלגוריתמי למידה לבעיות הכוללות קבלת החלטות סדרתית.\n3. לממש ולהפעיל אלגוריתמים סטנדרטיים לבעיות מעולם תוכן זה.\n4 . ליישם עקרונות ייסודיים בתכנון ובניתוח של אלגוריתמים, בניהם חסמי ריכוז מידה, דגימה אקראית, מרטינגלים ועוד.\n\n\n\nמקצועות קדם: 00940224 ו-00960570",
    "title": "00970249 - למידת מכונה בקבלת החלטות סדרתית"
  },
  "feedback": {
    "summary": {
      "text": "חוות דעת אחת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: עומר בן פורת\nחוות דעת - הרצאות: בגדול, הרצאות מצוינות.\nרואים שעומר מגיע ממש מוכן לכל הרצאה, יודע בדיוק מה הוא הולך ללמד ואיך. מנסה לשתף את הסטודנטים תוך כדי השיעור, מסביר למה הוא עושה את מה שהוא עושה וכו'. גם החומר עצמו היה מאוד מעניין בעיניי, והקורס צלל לנושאים של הוכחות מתמטיות בצורה שהיתה חסרה לדעתי בקורסים אחרים.\n\nשם המתרגל/ת: גור קינן\nחוות דעת - תרגולים: לא היו תרגולים, גור היה אחראי על בדיקת שיעורי הבית ושעות קבלה. השתמשתי בשעת קבלה פעם אחת לקראת הפרויקט והוא היה אחלה, אבל חוץ מזה מבחינתי הוא לא ממש היה מורגש בקורס (שזה לאו דווקא משהו שלילי).\n\nשעורי הבית: 80% ציון, חובה להגיש את כל הגילונות למעט אחד. ברוב הסמסטר היו ש\"ב כל שבוע, שהיו למעשה הרחבה של הוכחות או נושאים שדובר עליהם בהרצאה. ממש היו מקרים שעומר כתב איזה משפט על הלוח, ואז סימן שאת זה נוכיח בש\"ב. לדעתי זו אחלה שיטה, הש\"ב היו מאוד רלוונטים. היה גם גרף שיפור - ב 2-3 גליונות הראשונים לפעמים היה קצת קשה להבין איך להתקדם, אז הם הוסיפו \"רמזים\" לשאלות שהיה צריך. הש\"ב היו בזוגות. נתנו ציונים טובים על כל הגליונות (92-100)\n\nהמבחן: אין מבחן, היה פרויקט (שעדיין לא הגשנו) ששווה 80% מהציון.\nזאת לדעתי נקודת החולשה של הקורס. בניגוד לש\"ב, הפרויקט לא היה מספיק מוגדר היטב לדעתי. עשינו אותו (גם בזוגות), השקענו מאמץ שווה ערך ל 3-4 גליונות ש\"ב, אבל קשה לי לדעת אם עשינו מה שהם באמת רצו. נחכה לציון ונראה, אבל הרגיש פחות מחובר.\n\nהשורה התחתונה: קורס מומלץ (עד כדי הציון שעוד לא קיבלנו). שווה את ה-3 נק\"ז ביחס לרמת ההשקעה, וגם מעניין. נחכה לציון ונראה שלא נפלנו...\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 84  סופי 85  בן פורת עומר\nסופי מועד א': 84\nסופי: 85\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n47 42 5 89 0 100 85.283 97\nאיש סגל תפקיד\nבן פורת עומר מרצה - אחראי מקצוע\nקינן גור מתרגל\nשיתוף היסטוגרמות"
  }
}