{
  "course_id": "094222",
  "scraped_at": "2025-12-16T13:21:33.148594",
  "information": {
    "raw_text": "00940222 - הנדסת מערכות מבוססת מודלים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס מציג עקרונות ויישומים של הנדסת מערכות מבוססת מודלים, הגישה המודרנית לארכיטקטורה של מערכות המורכבות מאנשים, חומרה ותוכנה מתוך שימוש בתקן OSI MPO-19450 למידול ותכן של מערכות. נושאים מרכזיים: אוביקט, תהליך, מצב, מבנה, התנהגות ופונקציה של מערכת, נהנה, סביבה, ניהול סיבוכיות, ייצוג גרפי וטקסטואלי, יחסים מבניים ותהליכיים, סוכן, מכשיר, הפשטה-עידון.\n\nמקצועות צמודים: 09400224\n\nהערות: מקצוע צמוד: 940224",
    "title": "00940222 - הנדסת מערכות מבוססת מודלים"
  },
  "feedback": {
    "summary": {
      "text": "20 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "המבחן:\nאין. יש הגשה של פרויקט עם שותפים\nהשורה התחתונה:\nאם צריך נקודות ברשימה ב עם ממוצע יחסית גבוה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2019-2020",
        "content": "שעורי הבית:\nשיעורי בית מציקים, הם מחפשים תשובות ספציפיות ולכן צריך להיעזר בהם הרבה.\nהמבחן:\nאין\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: ניבה\nשעורי הבית: השיעורי בית לא מאוד עמוסים, יש תמיכה טובה מצד הסגל\n\nהמבחן: המבחן הוא עבודה להגשה שעובדים עליה במהלך הסמסטר, ההתנהלות של הסגל קצת מוזרה כי במהלך כל הפגישות שלנו עם הסגל קיבלנו מהם הערות ויישמנו וקיבלנו ציונים בהתאם (מעל 95 לכל משימה), ובמשימה הסופית שמורכבת מאותן משימות קיבלנו 80.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: ניבה/ דוב\nחוות דעת - הרצאות: אין הרצאות, בשעות של ההרצאות והתרגולים יש פגישות ייעוץ על הפרויקט שעובדים עליו כל הסמסטר\n\nשם המתרגל/ת: חנן\nחוות דעת - תרגולים: ממש עוזר בפרויקט אפילו מעבר לשעות של הפגישות\n\nשעורי הבית: יש קורס מקוון(edx) שצריך לראות בו סרטונים ולענות על שאלות, ממש קליל ועוזר להבנת הפרויקט\n\nהמבחן: אין מבחן, יש פרויקט שעובדים עליו כל הסמסטר ומגישים בשלבים.\n\nהשורה התחתונה: קורס ממש מומלץ, רלוונטי לעולם שאחרי הלימודים ולא רק כחומר תיאורטי.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: דב\nחוות דעת - הרצאות: קורס מקוון - קליל\n\nשם המתרגל/ת: אין תרגולים - יש שעות קבלה לדיון בפרויקטים\nחוות דעת - תרגולים: עוזרים הרבה לעבודה על הפרויקט\n\nשעורי הבית: הגשות חלקיות של הפרויקט - בסוף הגשה סופית\n\nהמבחן: אין - ציון פרויקט\n\nהשורה התחתונה: קורס נחמד - עבודה בקבוצות ולימוד עצמי\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: אין\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: קלילים\n\nהמבחן: אין\n\nהשורה התחתונה: לא יודע מה הלך בקורס וקיבלנו ציון מדהים...\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "חוות דעת - הרצאות: השיעורים מתקיימים באתר יעודיי יש הקלטות שצריך לראות מידי שבוע\n\nחוות דעת - תרגולים: אין. יש מפגשים עם המתרגליםם ועוזרים על הפרויקט הסופי\n\nשעורי הבית: יש תרגיליםםם קטניםבאתר הקורס אבל לרוב עובדים על פרויקט בקבוצה של 4-5 אנשים.\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מאוד נחמד, צוות הקורס ברמה ונחמד מאוד, לא קשה ומעניין. אומנם הפרוייקט דורש עבודה רבה ולדעת לחלק את העבודה בקבוצה)\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: ניבה וונגרוביץ'\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: חנן\nחוות דעת - תרגולים: אין\n\nשעורי הבית: יש עבודה לאורך הסמסטר וקורס אינטרנטי\n\nהמבחן: אין\n\nהשורה התחתונה: קורס שמנוהל גרוע מאוד, הציון תלוי בכמה שמתחנפים לסגל.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: ניבה/חנן\nחוות דעת - הרצאות: אין, רק פתיח בהתחלה שלא רלוונטי, והרצאת סיכום בה הסגל ביקש מכל קבוצה להגיד דברים נחמדים על הסגל. בחיי. כל השאר דרך קורס מקוון שיש לו רפרנס מלא.\n\nשם המתרגל/ת: ניבה/חנן\nחוות דעת - תרגולים: אין תרגולים, רק מפגשים שבועיים בהם \"מתייעצים\" על הפרויקט. תלכו רק למי שבודק את התרגיל הבא! הם כל הזמן סותרים אחד את השני ולפעמים גם את עצמם (אותו דבר בדיוק היה שבוע אחד נכון ושבוע אח\"כ טעות חמורה).\n\nשעורי הבית: פרויקט שנפרס על הסמסטר, לא מאוד מובן ודי קליל, ולהשלים את הקורס המקוון.\n\nהמבחן: אין\n\nהשורה התחתונה: אחד מהקורסים הכי פח בפקולטה, כמעט ולא לומדים כלום. מיועד למי שחייב או רוצה קורס של 3.5 נק\"ז עם ציון גבוה שניתן לפי מספר המפגשים שהשתתפת בהם וכמה התחנפת בהם.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "אין מבחן, ממוצע גבוה וקורס ששווה יותר נק\"ז מאלגו והמבני נתונים. בקיצור עקיצת המאה, תמצאו שותפים טובים לכו על הקורס הזה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: דוב\nחוות דעת - הרצאות: הכל מוקלט, ההקלטות קריג'יות וקצת קשות לצפיה\n\nשם המתרגל/ת: חנן\nחוות דעת - תרגולים: זה לא תרגולים אלא פגישות יעוץ לכל קבוצת פרוייקט פעם בשבוע וזה בא להכווין אתכם בפרוייקט\n\nשעורי הבית: באתר חיצוני בשם EDEX וזה חופר אש\n\nהמבחן: פרוייקט\n\nהשורה התחתונה: קל פיצוצים וקצת משעמם\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: מוקלט\nשם המתרגל/ת: חנן\nחוות דעת - תרגולים: אכפתי כל כך, עוזר תמיד באהבה , שנון מאוד, היה שווה לעשות את הקורס רק בגללו.\n\nשעורי הבית: דורשים זמן .\n\nהמבחן: אין\n\nהשורה התחתונה: מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "חוות דעת - הרצאות: אין באמת הרצאות פשוט עובדים כל הסמסטר על פרויקט וראוים סרטונים מוקלטים\n\nשעורי הבית: אין\n\nהמבחן: יש פרויקט אחד גדול. טיפ חשוב: תראו את כל הסרטונים (לא ערוך זה כמה שעות פשוט) ואז תתחילו את הפרויקט ככה תוכלו ישא להתמקד בדברים החשובים. הסגל עוזר אמון ושווה ללכת כל שבוע לשעות קבלה לקבל טיפים\n\nהשורה התחתונה: קורס מעניין\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "חוות דעת - הרצאות:\nקורס דיגיטלי כמעט לחלוטין\nהמבחן:\nאין\nהשורה התחתונה: שווה מאד\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "אין הרצאות חוץ מהשבוע הראשון אלא פגישות שבועיות שקובעים עם הסגל להתקדמות על הפרוייקט.\n\nשם המרצה: ניבה\nחוות דעת - נחמדה ומנסה לעזור אבל לפעמים מפוזרת מאוד.\n\nשם המתרגל/ת: חנן\nחוות דעת - בעיני, לא משהו בכלל. לא היה אלינו נחמד, עקץ אותנו בכל הזדמנות שיכל והתייחס אלינו כמו ילדים בגן. לפעמים בכל זאת ניסה לעזור ולתת טיפים.\n\nהצוות לא מסונכרן בכלל!!! חשוב ללכת לפגישת ייעוץ אצל מי שבודק את התרגילים כי הציונים הם לפי חנפנות וזה לא ייאמן.\n\nשעורי הבית: יש קורס EDX ממוחשב שהוא קאדר לגמרי אבל יש רפרנסים שמספיקים.\n\nהמבחן: יש פרוייקט, עד היום סיימנו את הקורס עם ציון סבבה בלי להבין שם כלום.\n\nהשורה התחתונה: קורס מאוד מוזר, תבואו לפגישות ייעוץ, תתחנפו, תעשו מה שהם מבקשים ויהיה בסדר\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "השורה התחתונה: קורס שהוא בדיחה של מישהו, לא מלמדים אותך כלום בקורס האינטרנטי ואז אתה עושה עבודה לאורך כל הסמסטר בה בוחרים להוריד לך ציון על דברים רנדומלים לגמרי. מה שכן 3.5 נקז בלי מבחן ודי קל להוציא בקורס 80+ בלי להתאמץ\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חנן וניבה\nחוות דעת - הרצאות: אין\n\nשם המתרגל/ת: שרון\nחוות דעת - תרגולים: אין\n\nשעורי הבית: הקורסים אונליין עוזרים להבין קצת איך עובד האופקלאוד, חוץ מזה שורף תזמן, יש רפרנסים שגם איתם תבינו.\n\nהמבחן: פרוייקט בקבוצות של 5, קשה לעבוד בקבוצות כאלה וגם אף אחד לא באמת יודע מה רוצים מאיתנו, אין נכון או לא נכון ולכן גם כשעשיתם משהו בדיוק כמו שאחד המרצים אמר, יכול להיות שהשני בודק וחושב אחרת. לא משנה מה תעשו יכול להיות לא טוב. פשוט תנסו לזרום ולא להתעקש יותר מידי אחד עם השני.\n\nהשורה התחתונה: אין מבחן וציון גבוה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חנן וניבה\nחוות דעת - הרצאות:\nאין הרצאות חוץ מהרצאת פתיחה וסיום. החומר של הקורס עובר בקורס אינטרנטי. באופן כללי לומדים בקורס איך ממדלים משהו פשוט כמו תרשים זרימה ומידול מערכות בצורה מסובכת, לא מובנת ומיותרת. לא ראיתי מקום אחד בתעשייה שמשתמשים בדבר הזה שנלמד בקורס. מהנדס מערכות שלמד בטכניון ומכיר את הפלטפורמה סיפר לי שהוא בחיים לא היה משתמש בדבר כזה כי זה לא מובן ומסובך מדי להבנה. העובדה שצריך קורס שלם בשביל ללמוד את זה מדגישה כמה זה מסבך משהו שאמור להיות פשוט ומובן לכולם.\n\nהיחס של המרצים מזלזל (בעיקר של חנן) והניקוד שיורד על חלקים בפרויקט שרירותי ואינו מוצדק. בפגישות ייעוץ שעושים עם המרצים הם יכולים להגיד לכם איך למדל משהו מסוים ואז להוריד לכם נקודות ולהגיד לכם שזה לא נכון ולהוריד ניקוד. כשתתעמתו עימם על זה הם כמובן יכחישו כל קשר לנאמר.\n\nספציפית יכול להעיד שהקבוצה שלי ואני השקענו מעל ומעבר בקורס הזה (אני חושב שזה היה הקורס שהשקעתי בו הכי הרבה שעות הסמסטר) כדי שהפרויקט יהיה ברמה גבוהה ונקבל ציון גבוה. בסוף קיבלנו ציון שבכלל לא משקף את מידת ההשקעה, היצירתיות והנכונות של המודל שעשינו. הורידו לנו המון נקודות על שטויות קטנות ודברים שהמרצים אמרו לנו לעשות בפגישות ייעוץ.\n\nהמבחן: אין מבחן. מקבלים ציון שרירותי על הפרויקט.\n\nהשורה התחתונה:\nלא ממליץ לקחת אם אתם לא חייבים. אם תשקיעו מספיק תקבלו ציון טוב מספיק אבל תרגישו שבזבזתם את הזמן שלכם ולא למדתם כלום. יש מלא קורסים אחרים בפקולטה שהם טובים ועם סיכוי לקבל ציון גבוה באמת ביחס לכמות ההשקעה שלכם.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: ניבה וחנן\nחוות דעת - הרצאות: יש רק 2 הרצאות, פתיחה וסיום. זה יכול להיות קצת מעיק אבל קחו את זה בקלות. :)\n\nחוות דעת - תרגולים: זה לא בדיוק תרגולים אלא פגישות ייעוץ שאפשר ללכת אליהן כדי להתייעץ על הפרויקט. אפשר לבחור אם בכלל ללכת לייעוץ או לא אבל אני ממליצה בחום. זה ממש יעזור לכם לדייק את כל הדברים היותר מסובכים ופחות ברורים.\nאני חושבת שניבה ממש מצויינת והיא עזרה לנו המון אז לכו אליה אם יש לכם אפשרות! חנן ושרון גם אחלה זה פשוט תלוי למי התחברתם יותר.\n\nשעורי הבית: יש 2 קורסים אינטרנטיים שעושים ב-edx. אפשר לצפות בסרטונים גם בעברית/בערבית (אבל על השאלות עדיין עונים ב-edx בפלטפורמה באנגלית). אני צפיתי בסרטונים בעברית ביוטיוב עם ניבה ואני ממש ממליצה עליהם כי הסרטונים באנגלית של דב היו לי באמת קרינג'יים מדי ולמרות שהבנתי מה הוא אומר לא הצלחתי להבין את הפואנטה שלו. אין באמת סיבה לרפרנס אבל אם אתם ממש תקועים (ויהיו כמה שאלות כאלה) יש רפרנס.\n\nהמבחן: אין מבחן יש פרויקט מתמשך שעובדים עליו לאורך כל הסמסטר ומגישים כל פעם חלק. בטח בהגשות הראשונות הם מאוד רחמניים עם הציונים ולא מורידים יותר מדי נקודות על דברים. חשוב מאוד לקחת את ההערות שלהם ולתקן אותם עד להגשה הסופית שבה מגישים את כל החלקים יחד. טיפ לפרויקט: במהלך הסמסטר מגישים כל חלק בנפרד אז כשאתם עובדים על ההגשה הסופית תראו באמת שיש היגיון וחיבור בין כל החלקים ושכולם מתחברים כמו שצריך.\n\nהשורה התחתונה: זו דעתי האישית בלבד אבל אני מאוד נהניתי בקורס. אהבתי לעבוד על הפרויקט, התחברתי לצוות הקורס ולקבוצה שלי ובסוף קיבלנו ציון נהדר ששיקף בעיניי את מידת ההשקעה.\nזה באמת אחלה קורס אבל הוא כן דורש השקעה. בכל זאת, 3.5 נק\"ז בלי מבחן. תמצאו לכם קבוצה שכיף לכם איתה ולכו על זה!\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 84  סופי 84\nאביב 2023       א' 86  סופי 87  ונגרוביץ ניבה\nחורף 2022-2023  א' 88  סופי 88  ונגרוביץ ניבה\nאביב 2022       א' 86  סופי 86  ונגרוביץ ניבה\nחורף 2021-2022  א' 88  סופי 89\nאביב 2021       א' 93  סופי 93\nחורף 2020-2021  א' 92  סופי 92  דורי דב\nאביב 2020       א' 92  סופי 92  ונגרוביץ ניבה\nחורף 2019-2020  א' 92  סופי 92  דורי דב\nאביב 2019       א' 92  סופי 94  ונגרוביץ ניבה\nחורף 2018-2019  א' 90  סופי 90  דורי דב\nאביב 2018       א' 87  סופי 87  ונגרוביץ ניבה\nחורף 2015-2016  א' 85  סופי 85  ונגרוביץ ניבה\nסופי מועד א': 84\nסופי: 84\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n40 40 0 100 66 95 84.825 87.5\nאיש סגל תפקיד\nונגרוביץ ניבה מרצה\nכהן חנן מרצה\nסגל שרון מתרגל\nשיתוף היסטוגרמות"
  }
}