{
  "course_id": "206964",
  "scraped_at": "2025-12-16T13:49:19.054927",
  "information": {
    "raw_text": "02060964 - תהליכי תכנון ובניה\nפקולטה: הפקולטה לארכיטקטורה ובינוי ערים\nמסגרת לימודים: מקצוע משותף\nנקודות: 2\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nשליטה ביישום תהליכי התכנון, הרישוי והביצוע. בשלב התכנון- בדיקת היתכנות, סקרים ואיסוף נתונים, פרוגרמה, תכנון ראשוני וסופי, תיאום תכנון, עריכה והגשת תכנית, טיפול מול מוסדות התכנון, תיאום תשתיות. בשלבי הרישוי והתכנון לביצוע- תכנון ראשוני וסופי, עריכה והגשת בקשה להיתר, הכרת מערכות הרישוי, תיאום מערכות ויועצים, בקרת תכן ועבודה מול מכון בקרה, תכניות לביצוע, רשימות ומפרטים, הכרת בעלי תפקידים בהליך הרישוי, שינויי תכנון והשלכותיהם על התהליך. בשלבי הביצוע- התנעת תהליך הביצוע, הנחיית יועצים, קבלנים ובעלי מקצוע, הכרת אתר הבניה וארגונו, ציוד בניה ובטיחות בעבודה, בדיקות מעבדה, פיקוח עליון וצמוד, בקרת ביצוע ועבודה מול מכוני בקרה, תיאום עם גורמי תשתית וגורמים מאשרים, שינויים במהלך הביצוע, הכרת בעיות הביצוע, הכרת בעלי תפקידים בתהליך הביצוע. הבנת דרכי ההתקשרות בין השותפים לתהליכי התכנון והביצוע לרבות הכרת חוק המכרזים ואופן עריכת מכרזים.\n\n\nמקצועות ללא זיכוי נוסף: 02060966",
    "title": "02060964 - תהליכי תכנון ובניה"
  },
  "feedback": {
    "summary": {
      "text": "חוות דעת אחת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: לילך מור\nחוות דעת - הרצאות: יש השקעה רבה בהרצאות אך פורמט הזום מוביל את הקורס לכישלון. קשה להקשיב למידע הטכני לאורך זמן.\n\nשעורי הבית: תרגילי הבית עוזרים להבין את החומר אבל בתכלס מי שלא התנסה במשימות כאלו לפני כן יתקשה להשלימן.\n\nהשורה התחתונה: קורס חשוב שאם היה נלמד בשנה שלישית היה רלוונטי הרבה יותר. חשוב להקשיב בשיעור כדי להבין את הדקויות שנדרשות בעבודה הסופית (במיוחד מי שלא מכיר את החומר מראש).\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2022-2023  א' 88  סופי 88  מור לילך\nחורף 2021-2022  א' 88  סופי 88  מור לילך\nסופי מועד א': 88\nסופי: 88\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n29 29 0 100 81 96 88.862 89\nאיש סגל תפקיד\nמור לילך מרצה - אחראי מקצוע\nשיתוף היסטוגרמות"
  }
}