{
  "course_id": "206949",
  "scraped_at": "2025-12-16T13:31:03.804250",
  "information": {
    "raw_text": "02060949 - נ.נ. העיר הקפיטליסטית ומדינת נדלן\nפקולטה: הפקולטה לארכיטקטורה ובינוי ערים\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס עוסק בהשפעה האדירה של כוחות השוק והגלובליזציה של הכסף על ארכיטקטורה ותכנון עירוני! תוך התמקדות בתופעות עירוניות-אדריכליות הייחודיות לכלכלה הקפיטליסטית של המאה ה-12. המעבר בעשורים האחרונים לקפיטליזם פיננסי אשר מושתת ביסודו על ספקולציות בשוק ההון הגדיר מחדש את היחסים בין חברה לארכיטקטורה! לקרקע! לבית - תרבות חדשה התפתחה סביב נדל ן ורווח קבלני! תשואות ושווי קרקע בה יזמים הם אלו שמנווטים ומכתיבים את אופי תכנון המרחב ותשומות הפיתוח. חלק אחד של הקורס יתמקד בטיפולוגיות אדריכליות/ עירוניות גלובליות ומקומיות שהון וכסף משחקיםבהן תפקיד מרכזי. חלקו האחר של הקורס יתמקד בחשיבה ספקולטיבית ובפיתוח תרחישים כלכליים פוסט-קפיטליסטיים וביטויים במרחב האורבני.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. לזהות קשרים! תהליכים והשפעות בין כלכלה לעירוניות ועיצוב אדריכלי.\n2. לנסח שאלות מחקר ביקורתיות במגוון נושאים הנמצאים בהצטלבות שבין אדריכלות/עירוניות! כלכלה ותרבות עכשווית.\n3. לפתח רעיונות ותרחישים אלטרנטיביים אפשריים למציאות הכלכלית-עירונית הנוכחית.\n4. להביע רעיונות מורכבים בשפה חזותית! בכלים אדריכליים.",
    "title": "02060949 - נ.נ. העיר הקפיטליסטית ומדינת נדלן"
  },
  "feedback": {
    "summary": {
      "text": "חוות דעת אחת\nכללי\nעומס",
      "ratings": {
        "כללי": 5.0,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יעל\nחוות דעת - הרצאות: הרצאות מאוד מעניינות\n\nשעורי הבית: אין\n\nהמבחן: אין\n\nהשורה התחתונה: קורס מעניין וקל, בוחרים נושא ומכינים מצגת להגשה, בוחרים תאריך הגשה כבר בתחילת הסמסטר וזה מאוד טוב, בסוף הסמסטר מגישים עבודה כתובה על אותו נושא שבחרתם, קורס לא עמוס.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "לא קיימות היסטוגרמות לקורס זה.\nשיתוף היסטוגרמות"
  }
}