{
  "course_id": "096265",
  "scraped_at": "2025-12-16T13:40:55.508630",
  "information": {
    "raw_text": "00960265 - אלגוריתמים בלוגיקה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס עוסק במידול בעיות הכרעה בעזרת לוגיקות שונות ובאלגוריתמים הנקראים \"פרוצדורות הכרעה\" ( SERUDECORP NOISICED ), לפתרון בעיות אלה.הבעיות בהן הקורס עוסק כוללות בעיות PN קלאסיות וכן בעיות העולות באימות פורמלי של תוכניות מחשב. בין השאר נלמדים אלגוריתמים לפתרון בעיית הספיקות של נוסחאות פסוקיות ( TAS ) ושל מערכות אילוצים ליניאריות. הקורס מתחיל מלימוד של לוגיקה פסוקית ולוגיקה מסדר ראשון.\n\nמקצועות קדם: 00970447\n\nהערות: חובת הגשת תרגילי בית באנגלית.\nרצוי ידע מוקדם ב C++ לצורך פרויקט הגמר.",
    "title": "00960265 - אלגוריתמים בלוגיקה"
  },
  "feedback": {
    "summary": {
      "text": "4 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.5,
        "עומס": 2.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: עופר שטריכמן\nחוות דעת - הרצאות:\nהרצאות מאוד ברורות ועוזרות להבנת החומר מאוד.\nלמרצה מאוד אכפת שנבין את החומר ומוכן להסביר אותו דבר כמה פעמים ובדרכים שונות.\n\nחוות דעת - תרגולים: אין\n\nשעורי הבית: לא קלים ולא קשים במיוחד\n\nהשורה התחתונה: קורס מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: פרופ עופר שטרייכמן\nחוות דעת - הרצאות: הנושא של הקורס מכסה דרכים פרקטיות לפתור את בעיית ה-SAT (שעליה לומדים למשל בקורסים של חישוביות וסיבוכיות במדמח או בפקולטה שלנו). הבעיה עצמה די אפורה לכשעצמה באופי שלה ולכן ישנם חלקים משעממים ויותר טכניים. תאורטית, בעיית ה-SAT (כנראה) לא ניתנת לפתרון במקרה הכללי, אך בגלל שאם ניתן היה לפתור אותה העולם היה מקום הרבה יותר טוב, פיתחו דרכים להתמודד איתה בסדרי גודל מסוימים שכן מייצרים המון תועלת ליישומים מהמון תחומים ופה מגיעה נקודת האור של הקורס - הגישות והאלגוריתמים להתמודדות עם הבעיה יצירתיים ואלו למעשה החלקים המעניינים. ניכר שהתחום מאוד מעניין את המרצה והוא לא סתם ממלא חובה אקדמית ללמד את הקורס. רשומים יחסית מעט סטודנטים מה שמייצר אווירה יותר נחמדה וגם קל יותר לשאול שאלות. לפעמים צריך לשאול את המרצה שאלות מאוד קונקרטיות כדי להוציא תשובה ברורה על נקודה שנראיתה לו ברורה מאליה. ספר הקורס (באנגלית) הוא מקור לא רע ללבן פינות. (אין נוכחות חובה אבל ממש מומלץ להגיע)\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: היו 5 תרגילים, רובם המוחץ יבש. השאלות התאורטיות מגיעות מספר הקורס שאם אני לא טועה עופר כתב (לכן הן גם באנגלית). השאלות מצריכות מחשבה וזמן, אך לא יותר מדי. עופר בונה על זה שיש לסטודנטים בקורס בגרות מתמטית מסוימת ושליטה סבירה בנושאים של מדעי המחשב (כמו אלגוריתמים בסיסיים על עצים, רקורסיה, חישוביות וסיבוכיות וקצת תחשיב הפסוקים בלוגיקה). לחלק משיעורי הבית קיימים רפרנסים באינטרנט. הבדיקה הייתה מקלה (גם אם ניתנו המון הערות) אז ציון הש\"ב היה גבוה לרוב הסטודנטים.\n\nהמבחן: אין, יש פרויקט תכנותי שצריך להציג בכיתה חלק מהתוצאות שלו. עופר מקדיש הרצאה שלמה לרעיונות אפשריים שאפשר לקחת כמו שהם והם יספיקו מבחינתו (לדעתי לחשוב על רעיונות לבד זה לא טריוויאלי. נראה שעופר מודע לכך אז אל חשש). זה נראה מאיים קצת בהתחלה אבל זה מסתכם בלקרוא מאמר שמתחבר ישירות לחומר הקורס. במאמר לרוב יש פסואודו קוד שצריך להטמיע בשלד של SAT SOLVER בסיסי שכתוב ב-C++ שעופר מספק ובעצם הפרויקט זה לעשות לו אופטימיזציה. רוב הזמן הוא בעיקר להבין את הקוד ואיפה צריך להכנס ולשנות דברים או להוריד חלודה מהסינטקס של השפה. ברגע שמבינים איך הוא בנוי ואיזו פונקציה קוראת לאיזו, מדובר בכמה שעות בודדות של כתיבת קוד.\n\nהשורה התחתונה: אחלה קורס, תכלס עד להרצאה האחרונה שבמהלכה עופר הראה איך הוא יישם את הידע התאורטי שמועבר בו באפליקציה מעשית, לא כל כך ברור מה הקשר בינו לפקולטה למדעי הנתונים ולמה הוא לא שייך למדמח. מסתבר שקיים ביקוש בתעשייה לאנשים עם ידע בנושא הזה או לחלק מדברים שנלמדים (intel, nvidia, phillips ועוד מקומות עם חומרה) אז סך הכל יכול להיות תוספת לא רעה לגליון ציונים ופתח לתעסוקה. הרוב גם קיבלו ציונים גבוהים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: עופר\nחוות דעת - הרצאות: ברורות עופר מנוסה מדבר ברור ולאט אין הקלטות.\n\nשעורי הבית: 6 תרגילי בית לאורך הקורס מי שמגיע להצאות יכול לפתור אותם, עופר מאוד עוזר ונותן שעות קבלה אם צריך.\n\nהמבחן: אין יש פרוייקט סוף. קריאת מאמר ומימוש שלו בשפת CPP. השנה היו הרבה מדמחיסטים שהביאו נושאים מתקדמים יותר ומחקריים. אבל גם פרוייקט שמימש רק מאמר קיים שזה מה שאנחנו עשינו היה בסדר. עופר התחשב ועזר נתן ציון טוב.\n\nהשורה התחתונה: עם השקעה סבירה ומי שאוהב את התחום יכול בכיף להגיע ל90 פלוס סופי\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 90  סופי 86  שטריכמן עופר\nחורף 2023-2024  א' 95  סופי 95  שטריכמן עופר\nחורף 2022-2023  א' 91  שטריכמן עופר\nסופי מועד א': 90\nסופי: 86\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n27 25 2 93 0 98 86.962 90\nאיש סגל תפקיד\nשטריכמן עופר מרצה - אחראי מקצוע\nשיתוף היסטוגרמות"
  }
}