{
  "course_id": "095334",
  "scraped_at": "2025-12-16T13:33:12.616308",
  "information": {
    "raw_text": "00950334 - סימולציה-מידול, ניתוח ויישומים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nנלמד היבטים תיאורטיים ויישומיים של סימולציה, בפרט סימולציית מונטה קרלו וסימולציית אירועים בדידה. הקורס יכלול שלושה חלקים עיקריים. החלק הראשון יתמקד בדגימת משתנים אקראיים תוך שימוש בשיטות הפונקציה ההפוכה! קבלה-דחייה וההרכבה. נלמד כיצד ליצור משתנים מקריים נורמליים בלתי מתואמים ומתואמים! כמו גם תהליכי פואסון הומוגניים ולא הומוגניים בזמן. החלק השני יוקדש לסימולציית מאורעות בדידים! ויכלול סימולציהשל מערכות תורים, רשתות מרקוב ומערכות מלאי. נלמד כיצד לבנות ולנתח מודל סימולציית אירועים בדידה ב-PYTHONSIM עבור מגוון מערכות כגון שירות! בריאות, תחבורה, לוגיסטיקה, הפצה וניהול פרויקטים. החלק השלישי של הקורס יתמקד בטכניקות הקטנת שונות ודגימת חשיבות.\n\nמקצועות קדם: (00940314 ו-00940423) או (00940314 ו-00940424)\n\nמקצועות ללא זיכוי נוסף: 00480986 00940334\n\nמועד א': 08-02-2026\nמועד ב': 12-03-2026",
    "title": "00950334 - סימולציה-מידול, ניתוח ויישומים"
  },
  "feedback": {
    "summary": {
      "text": "3 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 4.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: נעה\nחוות דעת - הרצאות: אני יותר מהאנשים של המוקלט, וזה הלך לי טוב היא מסבירה את החומר טוב ועונה על שאלות. אבל היו בחנים בכל הרצאה ומי שעשעה היה לו בונוס לציון הבחינה (זה כן מעיד לבוא להרצאות אבל לא פייר למי שלא מצליח להחזיק בהרצאות)\n\nשם המתרגל/ת: טל קרייצר\nחוות דעת - תרגולים: מדבר בקצב מהיר לא תמיד אפשר להבין אותו, ולרוב לא מדבר משהו חדש שלא נמצא במצגות. ואני לא רוצה לפגוע בו (חס וחלילה) אבל אני חייב לציין ובלי להגזים שטל עשה לי סיוטים, איך שהוא לא משתף פעולה גם על דברים קטנים, ולא מרגישים באמת שאכפת לו ושהוא לא עושה את העבודה שלו מינימום! לא צריך להתעולל או לענות כך לסטודנט שבסך הכל נותן את המקסימום שלו ורוצה לעבור את הקורס עם ציון.\n\nשעורי הבית: תורמים להבנת החומר, היו סה\"כ 4\n\nפרויקט: בבקשה אל תחכו לשבועיים לפני סיום הסמסטר כדי לעבוד עליו, אפשרי לגמרי לעבוד עליו גם לפני (או לפחות לתכנן את הכל ושלא יישאר כלום חוץ מחלק התכנות). היה לנו יותר מדי עמוס, טל לא עזר בסדנאות ודווקא אמר שיהיה לכל קבוצה 15 דקות ובפועל אנחנו לא עברנו 10 דקות. לא תרם לנו בהרבה לצערי וגם לא תיקשר איתנו כמו שצריך, נותן את ההרגשה לפעמים שהשאלות סתומות ומרגישים את זה מאיך שהוא עונה.\n\nהמבחן: קשה, גם כך נועה לא מפרסמת מבחנים משנים קודמות. היו כמה סעיפים אפילו שלדעתי לא מנוסחות טוב ולא מובנות ככ, וכששאלתי עליהם במבחן (ורק על מטרת להבין באמת על מה שואלים) הם לא ענו! אפס התחשבות באמת! למה שאני צריכה לפספס את ה- 5\\6 נקודות האלה רק כי לסגל לא בא להסביר את הסעיף שהם כתבו!!!\n\nהשורה התחתונה: אישית לא הייתי לוקח לו זה לא היה חובה, ולסטודנטי תעו\"נ אני סופר ממליץ לדחות אותו ולא לקחת בסמסטר 5! יש קורסים יותר חשובים לקדמים וגם לשוק העבודה עדיף שתתמקדו בהם.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: נועה\nחוות דעת - הרצאות: נועה מרצה טובה שהפכה את הקורס לרלוונטי וישים. הייתה אופציה לקבל נקודות בונוס לציון הבחינה על סמך בחנים שהתקיימו בכיתה (מה שעודד נוכחות) ובסופו של דבר נחמד לקבל בונוס כי הבחינה לא קלה. הבחנים גם מעודדים חזרה על החומר, השאלות אמנם טכניות אבל אם לא הבנת מה למדת בהרצאה הקודמת אז לא תדע לענות.\n\nשם המתרגל/ת: טל\nחוות דעת - תרגולים: בסמסטר שלנו היה מוקלט וגם פרונטלי, סה\"כ התרגולים כן תרמו להבנת החומר. החלק התכנותי נלמד רק בתרגולים ורלוונטי גם לשיעורי הבית וגם לפרויקט.\n\nשעורי הבית: 4 גיליונות שכדאי לפתור ולהבין כי הם תורמים להבנת החומר וכיוון שאין מבחני עבר לתרגל מהם - שיעורי הבית הם התרגול העיקרי.\nבנוסף יש פרויקט שיכול להרים את הציון אבל הכלים ליישם אותו בפועל נלמדים רק לקראת סוף הסמסטר, מי שרוצה באמת יכול לעשות פרויקט על רמה ולבחון נושאים שמדברים אליו - אבל גם פרויקט בסיסי יכול להתקבל עם ציון טוב. כן דורש השקעה אבל יכול להיבנות באופן בסיסי לפחות על סמך הדוגמאות שמוצגות בתרגולים.\n\nהמבחן: לא קל אבל מבוסס לגמרי על החומר שנלמד בהרצאות, בתרגולים ובשיעורי בית. יש כמה שאלות אתגר שדורשות חשיבה אבל הרוב הופיע בצורה כזו או אחרת במהלך הסמסטר (ודורש זיכרון או תרגול מספיק לקראת הבחינה).\n\nהשורה התחתונה: קורס חובה מפתיע לטובה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 77  סופי 78  ז'יכלינסקי נועה\nחורף 2023-2024  א' 80  סופי 78  ז'יכלינסקי נועה\nסופי מועד א': 77\nסופי: 78\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n39 30 9 77 36 99 78.765 84.5\nאיש סגל תפקיד\nז'יכלינסקי נועה מרצה - אחראי מקצוע\nקרייצר טל מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}