{
  "course_id": "206963",
  "scraped_at": "2025-12-16T13:49:48.523270",
  "information": {
    "raw_text": "02060963 - תחיקת התכנון והבניה\nפקולטה: הפקולטה לארכיטקטורה ובינוי ערים\nמסגרת לימודים: מקצוע משותף\nנקודות: 2\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס בוחן את התכנון הסטטוטורי ככלי למדיניות והסדרה של המרחב. מטרת הקורס לחשוף את הסטודנט לחוק התכנון והבניה, הבנת מערכת התכנון הארצית, סוגי תכניות, מרכיבי תכנית (תשריט, תקנון ונספחים), תקנות התכנון והבניה, תקני בטיחות אש ומילוט, בטיחות המשתמש, נגישות ובריאות ויישומם, חוק המהנדסים והאדריכלים ותקנותיו וכל הנ\"ל על שינוייהם - מאפייניהם ומעמדם, תהליכי דיון ואישור, גמישות בין תכנון לביצוע- הקלות ושימושים חורגים והקניית שיקול דעת. כמו כן, עוסק הקורס בייצוג ושילוב של שיקולי כלכלה, חברה, וסביבה בתהליכי תכנון, כולל יידוע הציבור, שיתוף הציבור וכלי ביצוע.\nתוצאות למידה: בסים הקורס הסטודנט יהיה מסוגל: 1. להכיר את העקרונות העומדים בבסיסו של החוק ויתמצא בחוק התכנון והבנייה ובשינויים החלים בו, תוך פיתוח מיומנות ראשונית בשפת החוק והתכניות, התשריטים, ההוראות, הנספחים וכלי המדיניות ומודעות למאגרי מידע קיימים והגישה אליהם.\n2. לפתח רגישות למורכבות האינטרסים הפרטיים והציבוריים בתכנון ודרכי ייצוגם ושילובם, תוך הבנה בקורתית של הערכים והנהלים המנחים את ההסדרה הציבורית של המרחב.\n3. יתנסה בניתוח תהליך תכנוני מבחינת אינטרסים נוגדים מעורבים ותהליך הסדרתם.\n\n\nמקצועות ללא זיכוי נוסף: 02050301 02060966\n\nמועד א': 05-02-2026\nמועד ב': 05-03-2026",
    "title": "02060963 - תחיקת התכנון והבניה"
  },
  "feedback": {
    "summary": {
      "text": "3 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 1.5,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: טלי שמחה אליקים\nחוות דעת - הרצאות: הרצאות גרועות, פשוט מדקלמת את המצגות\nשגם הן גרועות\nקורס נורא\nמבחן קשה עם שאלות מכשילות\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "הקורס:\nקורס עמוס, קשה ולא פרופורציונלי לנקודות שמקבלים. הנושאים מאוד טכניים וקשה להישאר קשובים לאורך כל השיעורים, תתכוננו להשלמות וללמידה של שעות על גבי שעות למבחן. אפילו משימת האמצע לא באמת חלק מהציון והיא רק מאפשרת לגשת למבחן... תכלס קורס לא הוגן ולא סביר.\n\nהמבחן:\nמבחן קשה מאוד, תקדישו מספר ימים ללמוד אליו. דורש ידע מאוד מעמיק על סעיפים ספציפיים (עשרות מהם) מתוך חוק התכנון והבנייה. לא להשאיר את הלמידה לרגע האחרון כי אתם תכשלו. מבחן לא הוגן, שאלות מכשילות שיקומו ויפלו על מילה אחת. שלא לדבר על ניסוח בעייתי וטעויות בנוסח המבחן עצמו שלא מאפשרות לענות על השאלות כמו שצריך.\n\nשורה תחתונה:\nקורס חובה שלא ניתן לסיים את הלימודים בלעדיו, בהצלחה לכם.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 5.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2023-2024  א' 78  ב' 79  סופי 79  שמחה-אליקים טליה\nחורף 2019-2020  א' 78  ב' 69  סופי 77  שמחה-אליקים טליה\nמבחן מועד א': 78\nסופי מועד א': 78\nסופי מועד ב': 79\nסופי: 79\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n80 80 0 100 62 96 79.875 79\nאיש סגל תפקיד\nשמחה-אליקים טליה מרצה - אחראי מקצוע\nאוסמנוב שיילה מרצה\nשיתוף היסטוגרמות"
  }
}