{
  "course_id": "097325",
  "scraped_at": "2025-12-16T13:59:00.373759",
  "information": {
    "raw_text": "00970325 - תיאוריה ושיטות באופטימיזציה דלילה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 3\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nמציאת פתרונות לבעיות שמכילים מעט משתנים השונים מאפס. יישומים נרחבים במגוון תחומים, כגון עיבוד אותות ותמונות, וסטטיסטיקה. הקורס ילמדתיאוריה ושיטות לאופטימיזציה דלילה החל מתוצאות קלאסיות לבעיות לא מאולצות, ועד שיטות מתקדמות לבעיות עם אילוצים, רגולריזציה ומבני דלילות של קבוצות. הכללה למבנה של דלילות של קבוצות או מטריצות. תוצאות למידה:\nבסיום הקורס הסטודנטים יוכלו ליישם ולנתח שיטות לאופטימיזציה דלילה. בפרט: שיטות היטל הגרדיאנט, שיטות פרוקסימל גראדינט ושיטות בלוקיות.\n\nמקצועות קדם: 00960327 או 00970311 או 00980311",
    "title": "00970325 - תיאוריה ושיטות באופטימיזציה דלילה"
  },
  "feedback": {
    "summary": {
      "text": "2 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 2.5,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: נדב חלק\nחוות דעת - הרצאות: המרצה הכי לא קריזמטי שקיים. פשוט משעמם מאוד, אי אפשר להקשיב למילה שלו. הוא עומד ומקריא מהסיכומים שלו ולא מוסיף שום דבר מעבר. מבטל הרצאות על ימין ועל שמאל (לפעמים גם בסמוך מאוד להרצאה-כי הוא לא התעורר בבוקר). תוכן ההרצאות לא מעניין במיוחד ואפשר לקרוא את הכל לבד מהסיכומים שהוא מעלה למודל. נדב עובר הרבה מאוד זמן על הדברים הפשוטים וכשמגיעים החלקים הקשים הוא מדלג ומשאיר לקריאה עצמית, פשוט גורם להרצאות להיות מיותרות לחלוטין.\n\nשעורי הבית: היו שלושה תרגילי בית בקורס. לא קשים מאוד אבל חלקם לקחו זמן.\n\nהשורה התחתונה: קורס משעמם שלא לומדים בו יותר מידי. הציונים בשיעורי הבית מוגרלים וגם אם יש אנשים שונים עם אותם ציונים בשב אפשר לקבל ציון שונה בסופי, הזוי ולא הוגן. לא מומלץ בכלל למרות הציונים.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 98  סופי 91  חלק שאול נדב\nסופי מועד א': 98\nסופי: 91\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n16 13 3 81 0 99 91.357 98\nאיש סגל תפקיד\nחלק שאול נדב מרצה - אחראי מקצוע\nשיתוף היסטוגרמות"
  }
}