{
  "course_id": "097217",
  "scraped_at": "2025-12-16T13:53:38.931926",
  "information": {
    "raw_text": "00970217 - סמינר בעיבוד שפה טבעית\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 2.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nנושאים עדכניים בעיבוד שפה ממגוון זויות: הנתונים, השערות המחקר, המודלים החישוביים, ניסויים, ניתוח התוצאות ודיון ביקורתי. הקורס יתמקדבבעיות כמו: למידת שפה בנסיבות של ריבוי סביבות שפתיות, שפות, ותמונות, הסקה סיבתית בלמידת שפה, שיטות להבנת מודלים ואפליקציות למדעי החברה ולרפואה. יושם דגש על אתיקה ועל ההשלכות החברתיות של המחקר._\nתוצאות למידה: בסיום הקורס הסטודנטים והסטודנטיות יהיו מסוגלים:\n- לבצע פרויקט מחקר בהיקף קטן על בעיה עדכנית בתחום של עיבוד שפה טבעית.\n- לזהות את הסיפרות המרכזית על בעיה עכשוית בעיבוד שפה טבעית ולסכם אותה באופן ביקורתי._\n\n\nמקצועות קדם: 00970216 או 00970215\n\nהערות: הקורס הינו ברישום ידני.\nלצורך רישום יש לפנות למרצה הקורס רועי רייכרט במייל roiri@technion.ac.il בצירוף גיליון ציונים עד לתאריך ה-20.7.",
    "title": "00970217 - סמינר בעיבוד שפה טבעית"
  },
  "feedback": {
    "summary": {
      "text": "2 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 5.0,
        "עומס": 1.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: רועי רייכארט וניתאי קלדרון\nחוות דעת - הרצאות:\nסמינר במתכונת דיי רגילה. כל שבוע זוג מציג מאמר.\nהסמינר עסק בנושא Natural Language Generation ונגע בהרבה מאוד נושאים שקשורים לתחום. מEvaluation אוטומטי של NLG עד שיטות מתקדמות לג'נרוט טקסט ומודלים חדשים כמו Diffusion Models.\nלפעמים הדיונים הולכים בכיוונים פחות עיקריים אבל סה\"כ מומלץ מאוד.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 95  רייכרט רועי\nחורף 2022-2023  א' 98  סופי 98  רייכרט רועי\nסופי מועד א': 95\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n28 28 0 100 90 100 95.357 95\nאיש סגל תפקיד\nרייכרט רועי מרצה - אחראי מקצוע\nקלדרון נתאי מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}