{
  "course_id": "094594",
  "scraped_at": "2025-12-16T13:17:42.385709",
  "information": {
    "raw_text": "00940594 - עקרונות הכלכלה למהנדסים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס מכסה נושאים נבחרים במיקרו ומאקרו כלכלה. בתחום המיקרו נלמד את תורת הצרכן והיצרן, שיווי משקל בשוק משוכלל ובמונופול, התערבות ממשלתית וסחר בינלאומי. בתחום המאקרו נלמד מושגי היסוד בחשבונאות לאומית, תוצר מקומי גולמי (תמ\"ג), המודל הקיינסיאני, שוק הכסף ומודל .ML-SI\n\nמקצועות קדם: 01040018 או 01040003 או 01040017 או 01040195 או 01040031\n\nמקצועות ללא זיכוי נוסף (מוכלים): 00940501 00940511\n\nמקצועות ללא זיכוי נוסף (מכילים): 00960501\n\nמקצועות ללא זיכוי נוסף: 00940591 00940592 00940593\n\nמועד א': 16-02-2026\nמועד ב': 18-03-2026",
    "title": "00940594 - עקרונות הכלכלה למהנדסים"
  },
  "feedback": {
    "summary": {
      "text": "26 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 1.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: אחלה מרצה שבעולם. מסביר טוב, פותר תרגילים ממבחנים בסוף ההרצאה, אין בכלל צורך לבוא לתרגולים. הרצאות מעניינות, הרבה חומר טכני.\n\nשם המתרגל/ת: אליקים\nחוות דעת - תרגולים: הלכתי רק לתרגול אחד ופרשתי באמצע, באמת שאין צורך עוברים על כל מה שצריך בהרצאות, זה אפילו מבלבל כי חובב מסביר בדרך מסוימת ואליקים בדרך אחרת.\n\nשעורי הבית: הם לא להגשה אבל כדאי לעשות כי זה פשוט אותו סגנון של תרגילים שיהיו במבחנים ועוזר להיות על החומר. בסביבות 5 שאלות כל שבוע על החומר של אותה הרצאה. לא קשים בכלל. הוא פותר את השאלות היותר מסובכות בשעת קבלה אז כדאי ללכת.\n\nהמבחן: קליל, 20 שאלות אמריקאיות עם חומר פתוח לגמרי. הרבה טכניקה, אותן שאלות עם נתונים שונים.\n\nהשורה התחתונה: קורס אש, לא עמוס בכלל, מבחן לא קשה ואפשר להוציא מעל 85 בכיף\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: הרצאות מעניינות וטובות, אני ראיתי רק את ההרצאות מבלי התרגולים כי חובב פותר גם תרגילים בהרצאות. חובב מרצה מעולה, עוזר בשעות קבלה, תורם ומשקיע עבור כל סטודנט המעוניין בעזרה ובהבנה של החומר.\n\nשעורי הבית:\nאין שיעורי בית להגשה, רק תרגילים שחובב מבקש לפתור בכל שבוע ואז עולים לשעות קבלה והוא פותר את חלקן. מומלץ מאוד לפתור את הבעיות של השעות קבלה.\n\nהמבחן: הוגן ומי שמשקיע בקורס גם יקבל ציון טוב\n\nהשורה התחתונה:קורס מומלץ מאוד והמרצה מעולה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מעביר את הכל בהרצאות בצורה מאוד מובנה וגם מפרסם את כל המצגות\nשעורי הבית: אין\n\nהמבחן: מאוד הוגן\n\nהשורה התחתונה: אפשר להוציא ציון טוב בקורס\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מרצה מצויין.\nמעביר הכל בצורה מאוד מסודרת, לפני כל הרצאה מעלה דפי ״שלד״ עם עיקרי הדברים של ההרצאה ככה שאפשר לרשום עליהם או לחכות לסוף ההרצאה והוא מעלה את הדפים עם ההערות שהוא כתב במהלך השיעור, במהלך ההרצאה פותר שאלות בנוסח מבחנים ומסביר הכל.\n\n\nחוות דעת - תרגולים: לא הרגשתי צורך להיות בהם, ההרצאות ממש הספיקו.\n\nשעורי הבית:\nלא להגשה.\nהשאלות הם ממבחנים קודמים, חשוב לעשות אותם, זה עוזר אחר כך בלמידה למבחן.\nחובב פותר את התרגילים בשעות הקבלה שלו, ומקליט את שעות הקבלה.\nמומלץ לראות את שעות הקבלה, הוא נותן דגשים חשובים לפתרון התרגילים.\n\nהמבחן:\nהסמסטר הזה הרגיש שהייתה קפיצת רמה קטנה מסמסטרים קודמים. אבל עדיין המבחן היה הוגן מאוד ולא קשה.\nסוג השאלות והמבנה ידועים מראש.\nהמבחן עם חומר פתוח.\n\nהשורה התחתונה:\nקורס לא עמוס ואפשר בקלות להצליח ולקבל ציון גבוה.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות: מרצה מעולה שמלמד את החומר בצורה טובה. פותר במהלך השיעור תרגילים כך שהשיעור לא רק תיאורטי. מוקלט על 1.5 מסדר לכם את הפינה.\n\nשם המתרגל/ת: לא רלוונטי אין מה ללכת.\n\nשעורי הבית: חובב מפרסם 2-3 שאלות ממבחני עבר בנושא של ההרצאה שהייתה. אין חובה לעשות אותם.\n\nהמבחן: המבנה זהה כמעט לחלוטין למבחני העבר מ2021 והלאה. מכניס קצת טריקים פה ושם אבל לא משהו נורא בכלל. תבינו את החומר בצורה עמוקה ותפתרו כמו שהוא מראה בהרצאה ויש לכם 90+.\n\nהשורה התחתונה: אחלה קורס מעלה ממוצע.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: מרצה מהטובים בפקולטה, לא רק באיכות ההוראה אלא גם בדרך ההוראה - מי ייתן והמרצים האחרים ילמדו ממנו שלא צריך לפחד מהוראה היברידית.\n\nחוות דעת - תרגולים: מי שבא לסמן וי על הקורס לא צריך ללכת לתרגולים, מי שראה הרצאות ושעות קבלה יגיע מוכן ב-100% למבחן. התרגולים מרחיבים על תיאוריה כלכלית שלא שואלים עליה במבחן בכלל.\n\nשעורי הבית: ללא הגשה, שעתיים-שלוש של עבודה בשבוע.\n\nהמבחן: יש עליית קושי רצינית מאוד בשנה-שנתיים האחרונות, ברמה כזאת שהמבחנים מ-2021 ואחורה כבר כמעט ואינם רלוונטיים מרוב שהם קלים. למרבה הצער עליית הקושי מתבטאת בהוספה של עוד ועוד טריקים תלושים מהמציאות שלא באמת בודקים ידע בכלכלה, אלא חשיבה פסיכומטרית.\n\nהמבחן טכני לחלוטין, עמוס בעבודה שחורה וכדי להצליח בו צריך לדעת לפתור תרגילים בצורה אוטומטית. לכן אל תבנו על החומר הפתוח שמותר, כי פשוט אין זמן להתעכב.\n\nהשורה התחתונה: מרצה מצוין, מבחן מגעיל אבל נסבל.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: הרצאות של שלוש שעות שאין שום סיבה שלא יהיו שעה וחצי. ההרצאות נמרחות הרבה יותר מדי ועל כן, מוקלט על 1.75.\n\nחוות דעת - תרגולים: לא הלכתי\n\nשעורי הבית: אין שיעורי בית אלא שאלות לשעת קבלה שחובב פותר. מאוד מאוד חשוב לעשות אותם כי הם אשכרה ברמת מבחן.\n\nהמבחן: מה שמתסכל במבחנים של חובב זה העובדה שאלו מבחנים אמריקאיים של 20 שאלות עם טויסט. לא משנה הדרך, לא משנה כמה החישוב שלך היה נכון, טעית בסימון, טעית. אבל מה שמיוחד אצל חובב זה שיש גם אופציה ד' - יותר מתשובה אחת נכונה או אף תשובה לא נכונה. לדבריו \"הופך את המבחן לפתוח\" אבל בלי האופציה לקבל נקודות על דרך נכונה :( צריך לרוץ במבחן הזה, אין זמן.\n\nהשורה התחתונה: קורס מאוד מאוד טכני וחזרתי אבל חובב תמיד ימצא דרך חדשה להפתיע במבחן.\nאולי יש סיבה שנדבק לו הכינוי \"עקרונות החלחלה\"?\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: הוא מדבר מאוד לאט, אז לפעמים זה מרדים. יש כאלה שבוחרים לראות אותו בהקלטות, אבל קחו בחשבון שאתם צריכים ריכוז בשביל זה.\n\nחוות דעת - תרגולים:\nחד משמעית אל תלכו!!! בזבוז זמן, חלק גדול מהסטודנטים אצלנו הלכו אליו בהתחלה ואחרי כמה פעמים(כולל אני) הפסיקו ללכת. הוא מספיק בקושי שאלה ופותר בדרכים אחרות מחובב. הקטע בקורס הוא לדעת לפתור ולחשוב בדיוק כמו חובב. אם יש לכם זמן חופשי בחיים עדיף שתנצלו אותו על דברים אחרים ולא על זה.\n\nשעורי הבית: נותן מדי פעם משימות שלקוחות ממבחני עבר(משמעותית יותר פשוטות מהמבחן והמבחנים האחרונים). אין חובת הגשה\n\nהמבחן: קודם כל , יש עליית רמה רצינית מ2021. אל תיגעו במבחנים לפני כן, כי הם כמעט ולא רלוונטיים וגם לא צריך כמות תרגול של יותר מ6-8 מבחנים לפני המבחן. לדעתי היה מבחן אקסטרה הוגן אצלנו .\n\nהשורה התחתונה: חובב לא כזה מרצה מדהים כמו שעושים ממנו(זה שהוא מלמד היברידי לא הופך אותו למדהים...). אפשר לקבל ציון מאוד גבוה בקורס, אבל קחו בחשבון שאי אפשר להתעורר 4 ימים לפני המבחן ולהצליח! צריך להיות טיפה בעניינים לאורך הסמסטר. לא הרגשתי שלמדתי יותר מידי כלכלה, אלא יותר למבחן וחבל. לא ממליץ כקורס בחירה בכלל\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "חוות דעת - הרצאות: לא משעממות ולא ממש כיפיות, בין לבין. אהבתי שתוך כדי ההרצאות הוא הרבה פעמים מנסה להכניס נושאים ואינפורמציה שלא ידענו מחיי היומיום!\n\nחוות דעת - תרגולים: פרץ כבר פותר שאלות ממבחנים במהלך ההרצאות, לכן הרגשתי שמיותר ללכת לתרגולים\n\nשעורי הבית: אין\n\nהמבחן: רמה יחסית מעל הרגיל, היו רעיונות חדשות\n\nהשורה התחתונה: ללכת / לצפות בהרצאות ממש חובה, לנסות לפתור את השאלות שהוא פותר בהרצאות לבד (לפני שמסתכלים על הפתרון). לפתור כמה שיותר שאלות ולהדפיס כמה שיותר מבחנים למבחן ולחלק אותם לפי נושאים כך שיהיה קל למצוא כל שאלה.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nהרצאות מועברות באופן היברידי ככה שאפשר להתחבר לזום מהבית ובנוסף חובב מקליט הכל\nההרצאות חשובות להבנת החומר אבל יותר חשוב לראות את השעות קבלה שמועלות פעם בשבוע\nחוות דעת - תרגולים:\nתרגולים לא רלוונטיים כל כך\nשעורי הבית:\nאין שיעורי בית חובה, יש מטלות שבועיות שבדרך כלל הן שאלות ממבחנים.\nשעות הקבלה של חובב הן בעיקר לעזרה בפתרון של המטלות השבועיות.\nהמבחן:\nמבחן הוגן יש הפתעות פה ושם אבל בעיקר בניסוחי השאלות ולא איזה חומר חדש שנכנס\nהכל מאוד שקוף אצל חובב\nהשורה התחתונה:\nקורס מאוד מעניין אפשר להוציא ציון טוב נתראה במיקרו כלכלה 1\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מעביר היברידי ככה שאתה יכול לסבול בכל פלטפורמה שתבחר-זום מוקלט או פרונטלי. אחד המרצים הגרועים שלימדו אותי איי פעם וזה כולל את המורה לאנגלית שלא ידעה אנגלית. מלמד למבחן שלו ולא אשכרה כלכלה אבל גם לא מספיק כדי להבין את החומר.\n\nשם המתרגל/ת: לא רלוונטי\nחוות דעת - תרגולים: לא רלוונטי אל תיקחו\n\nשעורי הבית: אין\n\nהמבחן: למה חובב מתנגד לפרסום פתרונות מלאים ואני צריכה להבין אם הגעתי לתשובה הנכונה בכוונה או בטעות? ניתן להתעורר על הקורס שבוע קודם לעבור על סיכום של מישהו וללמוד לפתור כל מקבץ שאלות בצורה חסרת הבנה לגמרי של החומר.\n\nהשורה התחתונה: נורא, מזעזע סבלתי בכל רגע ואני אומרת את זה בתור אחת שקבלה ציון טוב. המבחן בודק את יכולת הסבל שלך והאם יש לך תוספת זמן או לא...\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: חובב מעביר את ההרצאות גם בזום וגם מקליט שזה תמיד טוב. אני הייתי פיזית אז יכולתי גם לשאול שאלות תוך כדי. בעיקרון הקורס בנוי מכמה נושאים שלא ככ קשורים אחד לשני אבל די מעניינים למי שמעניין אותו הבסיס של כלכלה (קצת מיקרו קצת מאקרו). החומר עצמו לא קשה להבנה ברמה של קורסי מתמטיקה אבל כן כדאי להבין את הנוסחאות, ובעיקר את דרכי הפתרון של שאלות כי זה מה שמצופה במבחן.\n\nחוות דעת - תרגולים: לא הייתי- אין צורך\n\nשעורי הבית: אין. יש אחרי כל שיעור דף משימות רשות- שאלות ממבחני עבר שהוא מציין איזה בדיוק לפתור ואז עושה על זה שעת קבלה בזום ופותר אותן.\n\nהמבחן: עשיתי בינג' על כל השעות קבלה וזה סידר לי בראש בדיוק איך לפתור. המבנה של המבחן זהה תמיד מבחינת סדר הנושאים. כל סמסטר חובב מוצא מקומות קצת להקשות או לשים טריקים אז כן צריך לשים לב ומי שפותר כמו תוכי לא יצליח. גם תמיד יש מסיח של \"יותר מתשובה אחת נכונה/אף אחד לא\". אמריקאי עם חומר פתוח. לנו היו 20 שאלות.\n\nהשורה התחתונה: מי שיזלזל בקורס או יסתמך על החומר הפתוח ייכשל בקלות. מצד שני אפשר בהחלט לקבל 100 אם פותרים בדרך של חובב ומבינים קצת מעבר. סהכ קורס נחמד מאוד- 3.5 נקז של קצת השקעה במהלך הסמסטר, למידה טובה למבחן וציון טוב.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: אחלה בחור אבל מרדים אותך. תודה שקיימים הקלטות.\n\nחוות דעת - תרגולים: אין מה להגיע באמת\n\nשעורי הבית: לא להגשה וחובב פותר אותם בשעות קבלה, שגם אותן הוא מקליט\n\nהמבחן: סבבה לגמרי\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: אחלה\n\nשם המתרגל/ת: לא הלכתי\nחוות דעת - תרגולים: אין\n\nשעורי הבית: אין אבל יש משימות מהמבחנים כדי לחזור על החומר\n\nהמבחן: היה על הפנים הפעם, באמת שהיה תקדים כמעט לכל שאלה מבחינת הטריקים והנתונים שהוסיף לא ברור למה, לא היה זמן לפתור את הכל כי הוא כותב את המבחן בצורה שצריך לבדוק אם כל סעיף נכון ואז זה לא כזה אמריקאי\n\nהשורה התחתונה: מרצה טוב מאוד, חבל שבמבחן במועד הזה החליט להקשות\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: מרצה טוב\n\nשם המתרגל/ת: אין\nחוות דעת - תרגולים: אין\n\nשעורי הבית: נותן משימות מידי פעם ממבחני עבר ופותר בשעת קבלה\n\nהמבחן: קשה מאוד, הממוצע הנמוך ביותר בכל שנות קיום הקורס, אני עם תוספת זמן ולא הספקתי אז ניחשתי שאלות בסוף\n\nהשורה התחתונה: מרצה אחלה אבל בחר להקשות במבחן, היו דברים שלא נראו במבחני עבר וסתם העמיס נתונים, אי אפשר היה באמת לפתור הכל כמו שהוא לימד, חבל....\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: אחלה מרצה ובן אדם\n\nהמבחן: מבחן היה יותר קשה ממבחני עבר, ולא היה מספיק זמן להשלים אותו , לא היה פאקטור למרות הממוצע הנמוך.\n\nהשורה התחתונה: קורס שלא דורש הרבה\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות:\nהכל מוקלט וגם אפשר לעלות בזום במהלך השיעור ולשאול שאלות והכל. ממש נחמד\nהיה לי קצת איטי אז צפיתי בהכל מוקלט על X2\n\nשם המתרגל/ת: לא הלכתי\n\nשעורי הבית:\nאחרי כל שיעור חובב נותן כמה שאלות לא להגשה ואז פותר אותם בשעת קבלה\n\nהמבחן:\nלקראת המבחן צפיתי שוב בכל השעות קבלה וההרצאות, הבאסה זה שאין מאיפה ללמוד חוץ מזה. הוא נגיד פותר שלוש/ ארבע שאלות מכל נושא וזהו, אז אם בלמידה למבחן יש איזה טריק לא מובן או שאלה שהיא קצת שונה אין ממש מאיפה להביא פתרון.. די מבאס גורם לזה שהשעת קבלה לפני המבחן תהיה עמוסה ולא הכי יעילה, מה גם שאצלינו זה היה רק יום לפני המבחן אז זה בכלל לא כזה עוזר.\nהממוצע היה ממש נמוך הסמסטר והמבחן היה מאוד ארוך ולא אפשרי לסיים בשלוש שעות, ובכל זאת לא היה פקטור.. די מבאס\n\nהשורה התחתונה:\nבמהלך הסמסטר לא צריך הרבה השקעה, לקראת המבחן אפשר לחרוש חמישה ימים ולהספיק ללמוד הכל\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב פרץ\nחוות דעת - הרצאות:\nסבירותף חובב לפעמים חסר סבלנות\nשם המתרגל/ת: לא היה צורך\nשעורי הבית: אין שיעורי בית\n\nהמבחן:\nאחרי שנכשלתי במועד ב', החלטתי שזה קורס הבחירה הכי גרוע שקיים בפקולטה הזו, למה? כי חובב יעשה הכל בשביל לדחוף לך מחשבות אובדניות במהלך המבחן.\nאין לך זמן לנשום\nאתה בודק עם הפאקינג חלקות האלו ימינה שמאלה כמו מפגר לבדוק שאין טעויות חישוב, ואז התשובה זה \"אף תשובה לא נכונה\"\nב2 סעיפים!\nכנראה שהדרך היחידה לקבל עובר במבחן הזה היא להיות חבר של הבת של המרצה, אחרת פשוט תוותרו מראש.\nזה לא קורס קשה, זה לא מבחן שבודק ידע, זה פשוט מופע האימיים של חובב, בשביל 5 נקודות בוא תשקיע שעה ואז תהיה בחרדה שאולי יש לך טעות נגררת מפגרת. בקורס שאף אחד בפקולטה בחיים לא ישתמש בידע הזה, ועל זה, על זה המרצה חי.\n\n\nהשורה התחתונה:\nבושה\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: לא ברור מה הידע המועיל שאיתו אמורים לצאת מהקורס כשההרצאה נפתחת ב \"איך לפתור את שאלות 1 עד 2 במבחן של חובב\"\nהרצאות משעממות, שבלוניות וחסרות פואנטה\n\nחוות דעת - תרגולים: לא יודעת לא הלכתי\n\nשעורי הבית: אין\n\nהמבחן: אין מילים להעביר את הטרלול הזה\nכל הסמסטר מלמדים אותך בהרצאות ובשעות קבלה איך לפתור בידיוק את השאלה הספציפית הזאת כשהפואנטה מאחורי מה אתה עושה נשארת עמוק בערפל. ואז במבחן כל השאלות מקבלות טוויסט ככה שבידיוק לא תצליח לפתור אותם- כי הרי לא מקבלים שום כלים בהרצאות. בלי קשר לזה שבכל מבחן יש 20 שאלות שאין מצב להספיק אותם.\nבלמידה למבחן אין פתרונות לאף תרגיל, רק תשובות מסומנות.\nכל המבחן מבוסס על חישובים מסובכים חסרי פואנטה שבאים להתקיל, והוא אמריקאי כמובן, ככה שטעות אחת מפילה את כל השאלה, ולא נשכח את התשובה הנפלאה התמידית של \" אין תשובה או שכל התשובות נכונות\" .\nקורס הבחירה והלא בחירה הכי נורא שהיה לי\n\nהשורה התחתונה: אם לא חייבים, אל\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nהמבחן: מבחן עלוב, לכתוב לנו תחומים של פתרונות, ולתת פתרון לא הגיוני למספר יחידות זה פשוט מבחן עלוב, ברור לגמרי שאני יודעת את התשובה, ואז לתת כתשובה נכונה מספר שלא יכול להתחלק בסבסוד? מה עובר עליך חובב? מה אתה בודק? כמה אני לוקחת סיכונים?\nועוד במבחן אומר לי \"תחשבי האם זה מספר אפשרי\"\nאז לא, לא אפשרי לקבל סבסוד על שליש יחידה, בעולם מתוקן היית נכנס לכלא אם היית מגיש קבלה על 0.3 יחידות מוצר, אם לא הגדרת מראש שזה מוצר שיכול להימכר במשקל זה כנראה תשובה לא נכונה.\n\nהשורה התחתונה: לא אוהבת את הקורס הזה, לא אוהבת את התחכום, לא אוהבת שומדבר בקורסים שלא בודקים מה למדתי\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nחוות דעת - הרצאות: קצת איטי ומונוטוני, עד סוף הסמסטר מעט מאוד נשארו בהרצאות. יש אפשרות גם לעלות בזום. בכל זאת חובב יודע את החומר טוב מאוד ועונה על כל שאלה.\n\nשם המתרגל/ת: אליקים\nחוות דעת - תרגולים: קצת לא מתואם עם ההרצאות. אחרי כמה תרגולים החלטתי לוותר עליהם.\n\nשעורי הבית: אין תרגילים להגשה, אבל אחרי כל הרצאה חובב נותן שאלות מתוך מבחנים קודמים לפתור, והוא עובר עליהם בשעת הקבלה. מומלץ מאוד לפתור, לוקח גג שעה וזה תרגול מצוין.\n\nהמבחן: הפורמט קבוע ברמה שההבדלים העיקריים בין המבחנים זה הנתונים, כלומר מאוד נוח ללמוד לפי נושאים. בעיניי המבחן לחוץ מדי בזמן, כדאי להוריד כמה שאלות (יש נושאים עם כמה שאלות שאפשר להוריד אחת).\n\nהשורה התחתונה: מצד אחד זה הרגיש קורס מאוד טכניוני ויבש, מצד שני החומר חשוב ומעניין, בעיקר כשחובב גולש לכל מיני סיפורים מהעולם האמיתי.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "על הפנים, מדכא, ביזיון שהקורס מועבר בצורה שבה הוא מועבר.\nלא מלמד שום דבר על כלכלה ובא להכשיל במבחן. אם אין הקלות מילואים/תוספת זמן הציון יהיה גרוע מאוד. וגם אם יש צריך לקוות לא ליפול בטריקים זולים של פסיכומטרי.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חוביב\nחוות דעת - הרצאות: גרוע\n\nשעורי הבית: אין\n\nהמבחן: אמריקאי עם 20 שאלות, לא רלוונטי לעולם הכלכלה ומאכזב שסטודנט לתעונ יוצא מפה בלי ידע בסיסי\n\nהשורה התחתונה: DONT\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "אחד הקורסים המאכזבים שחוויתי בתואר. במקום להפוך תחום מעניין כמו כלכלה לנגיש ורלוונטי להנדסה, הקורס נמסר בצורה יבשה, לא ברורה, ומנותקת מהמציאות של סטודנטים להנדסה.\n\nחובב לא מנסה להעביר את החומר בצורה בהירה. ההרצאות מונוטוניות וחסרות אנרגיה. לא ניכר שהוא מתאמץ לוודא שהסטודנטים מבינים;\n\nיש פער בין מה שנאמר בהרצאות למה שנדרש במבחנים. אין תרגול אמיתי שמכין למטלות או לבחינה, והתחושה היא שההצלחה בקורס תלויה יותר בניחוש מאשר בהבנה.\n\nקורס חובה שנראה כאילו הועבר בכפייה – על המרצה, לא על הסטודנטים. חבל שקורס שנועד להקנות מושגי יסוד חשובים ניתן בצורה שמרחיקה את הסטודנטים מהתחום. הייתי ממליץ להימנע, אבל זה קורס חובה – אז פשוט להתכונן ללמוד לבד.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: חובב\nהשורה התחתונה: כנראה הקורס בסטדנרטים הכי נמוכים בטכניון. ואולי גם לא מתעלה על קורסים מקבילים במכללות. לא מלמד כלום. בדבר אחד הוא כן דומה למקצועות אחרים בטכניון. הוא בא להכשיל אתכם.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 1.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nקיץ 2025        א' 62  פרץ חובב\nחורף 2024-2025  א' 63  ב' 60  סופי 68  פרץ חובב\nחורף 2023-2024  א' 71  ב' 62  סופי 74  פרץ חובב\nחורף 2022-2023  א' 70  ב' 64  סופי 72  פרץ חובב\nאביב 2022       א' 65  ב' 66  סופי 68\nחורף 2021-2022  א' 78  ב' 75  סופי 81\nאביב 2021       א' 81  ב' 66  סופי 79\nחורף 2020-2021  א' 80  ב' 73  סופי 81  פרץ חובב\nאביב 2020       א' 82  סופי 79  פרץ חובב\nחורף 2019-2020  א' 76  ב' 71  סופי 79\nאביב 2019       א' 73  ב' 69  סופי 77  פרץ חובב\nחורף 2018-2019  א' 74  ב' 63  סופי 70  פרץ חובב\nאביב 2018       א' 75  ב' 74  סופי 80  פרץ חובב\nחורף 2017-2018  א' 70  ב' 66  סופי 73  פרץ חובב\nאביב 2017       א' 72  ב' 69  סופי 76  פרץ חובב\nחורף 2016-2017  א' 72  ב' 73  סופי 76  פרץ חובב\nאביב 2016       א' 75  ב' 70  סופי 78  פרץ חובב\nחורף 2015-2016  א' 79  ב' 77  סופי 81  פרץ חובב\nאביב 2014       א' 79  ב' 79  פרץ חובב\nסופי מועד א': 62\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n26 19 7 73 30 100 62.231 62.5\nאיש סגל תפקיד\nפרץ חובב מרצה - אחראי מקצוע\nשיתוף היסטוגרמות"
  }
}