{
  "course_id": "094314",
  "scraped_at": "2025-12-16T13:24:52.901392",
  "information": {
    "raw_text": "00940314 - מודלים סטוכסטיים בחקר בצועים\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nקורס זה עוסק בבנית מודלים מתמטיים של מערכות סטוכסטיות וכולל את מושגי היסוד של תורת התהליכים הסטוכסטיים. הקורס מתרכז בנושאים הבאים: שרשרות מרקוב, תהליכי פואסון והכללותיהם ותהליכי קפיצה מרקוביים (תהליכי לידה ומוות, תהליכי תורים מרקובים וכו').\n\nמקצועות קדם: (00940412 ו-01040065) או (00940412 ו-01040016) או (00940412 ו-01040166) או (00940411 ו-01040065) או (00940411 ו-01040016) או (00940411 ו-01040166)\n\nמקצועות ללא זיכוי נוסף: 00940390\n\nמועד א': 06-02-2026\nמועד ב': 16-03-2026",
    "title": "00940314 - מודלים סטוכסטיים בחקר בצועים"
  },
  "feedback": {
    "summary": {
      "text": "35 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: אורן לואידור\nחוות דעת - הרצאות:\nחומר לא קשה במיוחד. כדאי להיות על החומר\nשם המתרגל/ת: עידו פלדמן\nחוות דעת - תרגולים:\nאפשר לעבור על התרגולים בלי קשר לתרגול\nשעורי הבית:\nכל שבוע יש ת\"ב שייקח בערך יום. מומלץ להיות עקבי ולעשות את הש\"ב איך שיוצא ולהיות על החומר. ישתלם מאוד לקראת המבחן\nהמבחן:\nאם עושים את הש\"ב כמו שצריך המבחן לא אמור להיות קשה מדיי ויחסית מובטח ציון טוב\nהשורה התחתונה:\nעמוס טיפה ולא מעניין במיוחד\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2019-2020",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: מרצה מעולה, עונה לשאלות, בעל חוש הומור\n\nשם המתרגל/ת: ניצן\nחוות דעת - תרגולים: מדהימה! מסבירה מצויין ועוזרת תמיד\n\nשעורי הבית: גיליונות שבועיים לא קשים במיוחד, קצת ארוכים\n\nהמבחן: מבחן הוגן\n\nהשורה התחתונה: ליאוניד מרצה מצויין, קורס מעניין ולא קשה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "השורה התחתונה: קורס מאוד מעניין אך קשה\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2020",
        "content": "שם המרצה: אורן לואידור\nשם המתרגל/ת: עידו פלדמן\nחוות דעת - תרגולים: מתרגל ממש טוב\n\nשעורי הבית: הגשה שבועית, אנחנו היינו צריכים להגיש 9 גיליונות לפחות, לוקחים הרבה זמן ולא פשוטים, אבל כדאי מאוד לעשות, עוזרים בלמידת הקורס והצלחה במבחן.\n\nהמבחן: קשה מאוד, אבל אפשרי להוציא ציון טוב\n\nהשורה התחתונה: קורס מאוד מעניין, אבל קשה ודורש התמדה לאורך הסימסטר\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: ליאוניד מיטניק\n\nחוות דעת - הרצאות:\nמרצה נהדר שנמצא שנים בתחום, החומר לא הכי פשוט אבל עם הדוגמאות שהוא מביא לרוב מבינים הכל בזמן ההרצאה (ואם לא הוא תמיד זמין לשאלות אפילו הרבה זמן אחרי שנגמר השיעור)\nטיפה לא שם לב לזמנים של ההפסקות אז כדאי להזכיר לו.\n\n\nשם המתרגל/ת: אלכס צ'פמן\nחוות דעת - תרגולים:\nיש תרגול של שעה פעם בשבוע, יש המון חומר להספיק בתרגול אז לרוב רצים ואו שלא מתעמקים בפתרונות או שלא מספיקים הכל.\nמתרגל שפיץ, משקיע המון. התרגולים עוזרים מאוד בהבנה של החומר ועוזרים מאוד לפתור את השיעורי בית\n\nשעורי הבית:\nמתפרסמים כל שבוע ולא קשים מידי, כדאי לעשות אותם\n\nהמבחן:\nמאוד לחוץ בזמן להספיק הכל. יש הרבה שאלות קצרות אבל אם נתקעים על אחת זה משבש את תכנון הזמנים לשאר המבחן ויש סיכוי שלא תספיק הכל\n\nהשורה התחתונה: קורס סבבה סה\"כ\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: ליאוניד מיטניק\nחוות דעת - הרצאות: בסדר מינוס\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: עובר סופר מהר על השאלות, תרגול של שעה לא מספיק בכלל להטמיע את החומר\n\nשעורי הבית: קשים אבל מרופרנסים\n\nהמבחן: קשה ברמות אין מספיק זמן והיה פקטור 15 נקודות במועד ב (ממוצע 50 לפני פקטור), היה פקטור 12 נקודות מועד א\n\nהשורה התחתונה: קורס מזעזע, לא מעניין, לא ברור מה המטרה שלו (כנראה לאמלל סטודנטים), לעבור ולברוח\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: לואינד\nחוות דעת - הרצאות: חשוב מאוד להיות בהרצאות.\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מעביר את התרגולים ממש מהר.\n\nשעורי הבית: הגשה שבועית\n\nהמבחן: מצריך הבנה לחומר למרות זשהוא טכני.\n\nהשורה התחתונה: טוב אך קשה :)\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: מרצה סהכ סבבה, לא כריזמטי במיוחד אבל נחמד ועונה על שאלות של סטודנטים ולא משנה כמה הן שטותיות, שזה דבר חשוב במיוחד בגלל שהחומר לא מובן ומבלבל\n\nשם המתרגל/ת: אלכס צ'פנין\nחוות דעת - תרגולים: מתרגל תותח, מעביר תחומר בצורה טובה ממש למרות שהתרגולים ממש קצרים בזמן וקצת קשה להכניס הכל בשעה אחת\n\nשעורי הבית: גליון שבועי לא מסובך אבל ארוך עם 4 5 שאלות ו4 5 סעיפים לשאלה-יש רפרנס מאוד מדוייק לכל התרגילים.\n\nהמבחן: מבחן לחוץ בזמן, אצלנו היה 7 שאלות אמריקאיות ו2 שאלות פתוחות עם 8 סעיפים. לרוב שלושת השאלות האמריקאיות הראשונות דיי קלות ומשמה זה הולך ומסתבך וכנ\"ל לגבי הסעיפים של השאלות הפתוחות. בסופו של דבר הממוצע של מועד א היה אצלנו +- 72 לאחר נרמול של 3 נק ועוד 0.05 מהציון המקורי.\n\nהשורה התחתונה: חלקים בחומר מעניינים וחלקים משעממים, מבחן לא קשה מידי אם מתרגלים מספיק זמן ונשארים על החומר במהלך הקורס.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: חלק מהזמן רלוונטי חלק לא. המרצה משקיע זמן מיותר בהוכחת משפטים אך אין דרישה להוכיח משפטים במבחן.\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מזעזע. תרגול של 50 דק לא מספיק להעביר לסטודנטים כלום. מדבר מהר ולא עונה על חלק מהשאלות בטענה שזה דברים שכבר צריך לדעת. מדלג על שאלות בתרגול.\n\nשעורי הבית: מרופרנסים.\n\nהמבחן: קשה וקצר בזמן. 4 סטודנטים מתוך 160 קיבלו מעל 80 לפני הפקטור.\n\nהשורה התחתונה: קורס קשה ועמוס. ליאוניד ואלכס לא מעבירים את החומר בצורה ברורה. לנסות לסכם לבד את החומר אחרי ההרצאות ולפתור את המטלות לבד, ואז אם יהיה פקטור ויתמזל מזלכם תעברו את הקורס.\nכללי\nעומס",
        "ratings": {
          "כללי": 1.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2021",
        "content": "שם המרצה: לאוניד\nשם המתרגל/ת: אלכס צ'פנין\n\nחוות דעת - תרגולים: מפרסם חוו\"ד רק כדי לפרגן לאלכס, מתרגל מאוד חד וברור, ישיר ופרקטי. לא מבזבז זמן ונותן את כל הכלים. נותן אינטואיציה לתרגילים ולנושאים שקשים יותר להבנה.\nניכר שחשובה לו ההוראה ושכל סטודנט יצא עם הבנת החומר. הלוואי שהיה מתרגל יותר קורסים בפקולטה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: לאוניד\nחוות דעת - הרצאות: צפיתי בהקלטות משנה שעברה. לאוניד מסביר באופן יחסית ברור אבל אין וידאו וזה קצת מבאס. בגדול ההרצאות בעיקר עוזרות להגיע מוכן לתרגולים, למרות שיש פה ושם טריקים ושטיקים שרואים רק בהרצאה, אז שווה לפחות לעבור על סיכומים.\n\nשם המתרגל/ת: אלכס צ'אפנין\nחוות דעת - תרגולים: מתרגל מעולה, אלכס מבין את החומר לעומק ויודע להסביר את הדרך חשיבה שלו לפיתרון תרגילים בצורה מאוד יסודית וברורה. מקווה שישאירו את ההקלטות שלו גם לדורות הבאים.\n\nשעורי הבית: צריך להגיש 9 גיליונות די עמוסים מתוך 12, אפשר בזוגות. יש רפרנסים מלאים ולא בודקים לעומק, אבל הם הכרחיים להבנת החומר.\n\nהמבחן: טכני לחלטין, צריך לפתור הרבה מבחני עבר כי השאלות תמיד חוזרות על עצמן בניסוחים שונים. כדי להוריד ממוצע לפעמים הצוות מנפיץ שאלות מוזרות כמו נוסחת הקונבולוציה מהסתברות (שלא רואים בקורס) ואז שיהיה לכם בהצלחה, אבל הרוב הוגן.\n\nהשורה התחתונה: קורס חביב שבעיקר דורש למידה אינטנסיבית למבחן.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: לאוניד\nחוות דעת - הרצאות: ההרצאות מאוד משעממות, ראיתי רק את ההרצאות בתחילת הסמסטר. אפשר להבין את החומר רק מהתרגולים.\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: אלכס מעולה. הוא מספיק להעביר חומר תאורטי בתחילת התרגול וגם לפתור את כל התרגילים המתוכננים. מעביר את התרגולים בצורה מעולה ואפשר להגיע רק לתרגולים שלו בלי להגיע להרצאות.\n\nשעורי הבית: לא קשים בכלל, הכל מרופרנס וגם שאלות יחסית בסדר.\n\nהמבחן: נתנו לנו מבחן קשה עם פקטור של נקודה....\n\nהשורה התחתונה: כדאי ללכת לתרגולים של אלכס\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: לא ממש ברורות/מעניינות, אבל ליאוניד יחסית מסודר\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: הקלטות משנה שעברה מעולות, בלייב הוא קצת מהיר אבל אפשר לראות בקצב שלך ואלכס מסביר טוב\n\nשעורי הבית: גיליון כל שבוע, היה רפרנס להכל\n\nהמבחן: קשה אבל דומה למבחנים של שנים קודמות, לאלו של ליאוניד (ובדרכ מעלים הרבה שאפשר לתרגל)\n\nהשורה התחתונה: קורס עמוס ולא קל\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: ליאוניד יושב ולא קם אפילו לרגע. מדבר בצורה מונוטונית ולא ברורה. אחרי 3 הרצאות שלא הבנתי כלום פשוט הפסקתי ללכת והבנתי טוב יותר מלקרוא סיכום וללכת לתרגול\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: חשוב לו שכולם יבינו הכל, עונה על כל השאלות גם אחרי התרגול. לפעמים ממהר אבל זה נובע מכך שהתרגול רק שעה.\n\nשעורי הבית: תרגיל בית שבועי בזוגות או יחידים על הנושא של אותו שבוע. 4-5 שאלות שיכולות להיות ארוכות אבל מרופרנסות לגמרי.\n\nהמבחן: 7 שאלות אמריקאיות (28 נק') ועוד 2 שאלות פתוחות עם סעיפים (36 נק' כל אחת). מבחן שאם לומדים אליו טוב אפשר להצליח. כמובן שכמו בכל מבחן טוב בסטוכסטיים יהיו שאלות הזויות אבל אפשר לקבל ציון נורמלי למרות הממוצע המחריד\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד מיטניק\nחוות דעת - הרצאות: לא באתי להרצאות והסתדרתי עם תרגילי הבית. עוברים על כל החומר בתרגול.\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: תותח על. עובר על ה PDF ומסביר את החומר בצורה די מובנת ואחרי זה בשאלות הוא נותן לנו אינטואיציה ולא רק את המעברים הטכניים.\n\nשעורי הבית: תרגיל בית כל שבוע. למרות שהם ירגישו לכם ארוכים כדי להשקיע בהם ולעשות אותם לבד. מבינים את החומר הכי טוב בתרגילי הבית.\n\nהמבחן: 7 שאלות אמריקאיות ו2 שאלות פתוחות מרובות סעיפים. השאלות האמריקאיות היו יותר קשות משנים קודמות ו2 הפתוחות היו בסדר בגדול. תפתרו את הדברים בצורה יסודית כי קל לעשות טעויות מתמטיות בדרך.\nהמבחנים יחסית חוזרים על עצמם מבחינת רעיונות הפתרון לכן כדי לפתור מלא מבחנים כהכנה טובה.\n\nהשורה התחתונה: קורס לא ממש עמוס אבל חשוב להיות על החומר כדי להצליח במבחן.\nמכירים בקורס את הנושא של תהליכים ואיך הם מתנהגים לאחר זמן מסויים וזה כן פותח את הראש לדברים שלא ראינו עד הסמסטר הזה.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: לא הגעתי פרונטלי, ראיתי מוקלט מסמסטרים קודמים. בהרצאות מציגים הרבה הוכחות ומונחים שלא בהכרח רלוונטיים למבחן, אבל יש גם כמה נוסחאות שלא עוברים עליהם בתרגולים שחשוב להכיר וכדאי שיהיו בדף הנוסחאות.\n\nשם המתרגל/ת: אלכס (מוקלט)\nחוות דעת - תרגולים: מדהים וכל מילה מיותרת\n\nשעורי הבית: גיליון שבועי, די מעיק ותקוע בגרון. תמיד יש גם שאלת מאטלב לא קשה במיוחד\n\nהמבחן: מיקס של שאלות אמריקאיות ופתוחות, כולל שאלת מאטלב ששווה 4 נקודות. קל מאוד ליפול על טעויות חישוב.\n\nהשורה התחתונה: לפתור מלא מבחני עבר, בסוף אפשרי לגמרי לקבל ציון טוב במבחן. קורס חמוד אבל לא מעבר\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: לאוניד\nחוות דעת - הרצאות: כוללות הרבה הוכחות, פחות פרקטי. כדאי פשוט לראות מוקלט\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: אלכס מעולה. עובר על התאוריה בתחילת התרגול ועוד מספיק את כל התרגול בזמן. אפשר להגיע רק לתרגולים שלו מבלי לראות את ההרצאות.\n\nשעורי הבית: לא קשים, הכל גם מרופרנס\n\nהמבחן: הרמה גבוהה יותר מהשיעורי בית, אבל יש לו מבנה ברור וסגנון שאלות שחוזרות על עצמן כל סמסטר. לתרגל הרבה מבחנים קודמים.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: לאוניד\nחוות דעת - הרצאות: לדעתי ההרצאות משעממות וגם לא נחוצות. הן מלאות בהוכחות שלא רלוונטיות למבחן בשום צורה. ממליץ לראות במהירות כפולה הקלטות או לעבור רק על רשימות\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מתרגל מצוין. התרגולים מאוד ממוקדים ופרקטיים וסופר חשובים למבחן. אלכס מצוין ומעביר את התרגול באופן ברור ומלא למרות שהתרגול לחוץ בזמן\n\nשעורי הבית: גיליון שבועי. לא קשה במיוחד והכל מרופרנס לחלוטין. רצוי לעשות אותם כי הם מהווים תרגול די טוב של החומר אבל לא מכינים מספיק למבחן.\n\nהמבחן: טריקי ומציק. הוא די טכני אבל יש מלא טריקים ונוסחאות. כדאי פשוט לפתור כמה שיותר מבחני עבר וככה אפשר לצאת עם ציון טוב\n\nהשורה התחתונה: קורס לא מעניין במיוחד. פשוט המשך של הסתברות. יש מבחן מציק אבל תפתרו מלא מבחנים וכנראה שתהיו בסדר\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות:\nהחומר מעניין, מלמד קשרים בין הסתברויות שונות ועוד, ההרצאות מייגעות, אבל אין ממש איך להתחמק\n\n\nשם המתרגל/ת: -\nחוות דעת - תרגולים: -\n\nשעורי הבית:\nגיליונות שדורשים 3-6 שעות עבודה\n\nהמבחן:\nתואם את הגיליונות.\n\nהשורה התחתונה:\n-\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: ליאוניד מרצה טוב מאד, יש לציין שההרצאות בחלקי ההוכחות מיותרות לפתירת המבחן ושיעורי הבית ובעיניי הן בגדר העשרה. בכל אופן ליאוניד פוגע בול עם בדוגמאות וההסברים, תרגישו בנוח לשאול הכל\n\nשם המתרגל/ת: עומר ציצלסקי\nחוות דעת - תרגולים: המתרגל הכי טוב. מצליח להעביר תרגול בצורה קולעת למרות החוסר בזמן. עונה על שאלות רלוונטיות, ומתייחס גם לאחר התרגול ובשעות הקבלה אם מבקשים. ממולץ מאוד להגיע לתרגולים, ואם כבר מגיעים אז רק לשל עומר.\n\nשעורי הבית:\nלא קשים, חשובים לבחינה, קונספט של עובר או לא עובר, אבל חשוב להשקיע. גיליון כל שבוע, כמה שעות לגיליון לא יותר מזה.\n\nהמבחן: נותן וייב של פסיכומטרי, עשרים ומשהו שאלות בשלוש שעות, חשוב לצבור מהירות ומיומנות, מעבר לא דורש מחשבה מחוץ לקופסא (אולי רק בחלק קטן).\n\nהשורה התחתונה: ניתן לקבל ציון טוב בקורס, אסור לפספס תרגולים, אפשר לדלג על ההוכחות בהרצאות. אחלה קורס באמת\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: לאוניד\nחוות דעת - הרצאות: לא הלכתי ואין צורך בכלל. תחסוך לעצמך את ה3 שעות\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מתרגל מציון, וכל מה שנדרש להצחלה בקורס\n\nשעורי הבית: גיליון שבועי מרופרנס לחלוטין. יש תכנות במטלאב גם זה קצת מעצבן\n\nהמבחן: לא פשוט\n\nהשורה התחתונה: סביר\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2022",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: אין לי מושג, לא נראלי שמישהו הלך.\n\nשם המתרגל/ת: ציצלסקי\nחוות דעת - תרגולים: ציצלסקי די עשה מעל ומעבר בתרגולים, הוא השתדל מאוד להסביר דברים כמה פעמים ומכמה זוויות שונות כשאנשים לא הבינו. הוא גם היה תמיד זמין לשעות קבלה והשקיע בשביל שאנשים יבינו.\n\nשעורי הבית: בדיחה, ואם אתם ממש רוצים יש להכל רפרנסים.\n\nהמבחן: מועד א' סבבה לגמרי, מועד ב' ביזיוני עם שאלות שבאות להפיל בכוח.\n\nהשורה התחתונה: קורס יחסית חשוב, אני ממליץ להשקיע בהבנה שלו (לא מבחינת ציון מבחן ששם תמיד אפשר ליפול על שטויות כמו האמריקאיות וכו', אלא מבחינת ההבנה של החומר). סיכוי גבוה מאוד שתיתקלו ברעיונות שהיו בקורס בהמשך הלימודים.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: יש לפעמים חלקים מיותרים בהרצאות של כל מיני הוכחות שלא תצטרכו לשחזר לא בתרגילי בית ולא במבחן, אבל לדעתי הן היו די מעשירות. חוץ מזה אי אפשר לוותר על ההרצאות ולהגיע רק לתרגולים ובלי קשר ליאוניד מרצה סבבה\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מטורף\n\nשעורי הבית: מרופרנסים\n\nהמבחן: היה מבחן קשה אבל פרגנו בפקטור\n\nהשורה התחתונה: קורס מעניין מאוד, עם כמה ימים של למידה אפשר להוציא אחלה ציון כי רעיונות חוזרים\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: איתי\nחוות דעת - הרצאות: לא הייתי , ראיתי קצת את ההקלטות של לאוניד אבל ויתרתי עליהן מהר , איתי החליף לנו את הנושא של תורים במרטינלים שאני ספציפית אהבתי\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מטורף תותח על וכל מילה נוספת מיותרת\n\nשעורי הבית: אצלנו לא היה בניגוד לשנים אחרות מאטלב וניתן היה לרפרנס הכל אבל השיעורי בית לא כאלו נוראים וקשים (ובגלל ההפגנות היינו צריכים להגיש רק 7 :) )\n\nהמבחן: בעיני מאוד הוגן\n\nהשורה התחתונה: אחלה קורס ,מרגיש קצת כמו הסתברות 2 אבל קורס שאני מאוד נהנתי ממנו ומהחומר שלו ולא הרגשתי צורך בהרצאות\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: לי היה יותר נוח לראות הקלטות של לאוניד, כמעט אותו חומר, הורידו את הנושא של תורים והחליפו במרטינגלים.\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: ראיתי מוקלט, מצוין.\n\nשעורי הבית: מרופרנסים\n\nהמבחן: לא פשוט, אבל עם הרבה מבחני עבר תהיו מכוסים כמעט ב100%.\n\nהשורה התחתונה: -\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר אביב 2023",
        "content": "שם המרצה: איתי אריאלי\nחוות דעת - הרצאות: לא אהבתי, קצב איטי מידי בשבילי ואיבדתי ריכוז, ממליץ לראות את ההקלטות של לאוניד או לעבור על המחברות, לפעמים משתמשים בדברים שם לש\"ב או מבחנים אבל לא הרבה\n\nשם המתרגל/ת: אלכס\nחוות דעת - תרגולים: מושלם, הציל לי את הקורס.\n\nשעורי הבית: מרופרנס מלא, אצלנו הורידו את הקוד וזה הקל משמעותית, חשובים כדי להגיע לרמה של המבחנים\n\nהמבחן: קשה אך הוגן, המבחנים בכללי מאוד קשים, דורש הבנה דומה למבחנים בהסתברות.\nקל להוציא 60 קשה להוציא מעל 80\nהשורה התחתונה: חומר מעניין, חשוב להבין בעיקר תרגולים וקצת הרצאות, חשוב להבין את השיעורי בית כי בלי זה לא תצליחו מעל 60 במבחן.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: לא ללכת חבל\n\nשם המתרגל/ת: אלכס מוקלט\nחוות דעת - תרגולים: לא ללכת חבל.\n\nלא ראיתי את הסגל לא מכיר את הסגל אני רק אלכס וכדאי גם לכם.\n\nהמבחן: מבחני עבר ממש לא ברורים שווה להתעמק בתרגולים של אלכס ואפשר להצליח\n\nהשורה התחתונה: רק לראות אלכס ולהפנים את השיעורים בית בעיקר החלק הרציף והתקמ לא פשוטים בכלל\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: לאוניד מלך ההסתברות\nחוות דעת - הרצאות: סה\"כ אחלה מרצה. אני ממש לא חושב שכל ההרצאות מיותרות. זה נכון שחלק מאוד מיותר ובמבחן של לאוניד אין הוכחות או הפכרות, אבל יש חלקים מסויימים מההוכחות שחוזרים בתרגילים רבים. בנוסף יש משפטים כמו burke וחינצ'ין פולצ'ק שלא מופיעים בתרגול בצורה יישומית ובהרצאות נותנים להם יותר דגש. אין בכלל הבדל בין ההקלטות להרצאות הפיזיות, אבל השנה לאוניד הצליח לדחוף עוד נושא שקושר לסימולציות של משפט ארגודי בהרצאה 6 שלא הופיע בהקלטות והיה בשיעורי בית ומי שלא היה הסתבך איתו יותר(למרות שהיה אפשר להיעזר בצאט GPT כי זה היה תרגיל של סימולציה בפייתון). לאוניד לא הוריד לנו חומר הסמסטר בגלל המלחמה, אלא להיפך, רק הוסיף והספיק ללמד חומר של 13 הרצאות בתקופה של 12(חבל על החוסר התחשבות).\n\nשם המתרגל/ת: הייתי בהתחלה אצל יונתן קוחלי ולאחר מכן עברתי לאיתי פקטורמן .\nחוות דעת - תרגולים: יונתן לא היה חזק בחומר, הרגשנו שהוא יודע אותו, אבל בטח לא ברמה של לתרגל ומישהו שחי את החומר. עוד דוגמה לצערי לאלוניסט שמקבל 100 בקורס ולא יודע לתרגל והבדיחה על חשבוננו(דומה מאוד למתרגלים במסחר וכנראה זאת חונטה). איתי היה הרבה יותר טוב, אבל לא ברמה של אלכס האגדי מההקלטות. מאוד ממליץ על אלכס ולא על חונטת האלוניסטים שהולכת ותופחת בפקולטה במקום להביא חברה מתואר שני ש\"חיים את החומר\" ואפשר לסמוך עליהם.\n\nשעורי הבית: קשים מאוד. מי שאומר שהם קלים מרפרנס בבוודאות. ברמה של שיעורי הבית מהסתברות או קצת אפילו יותר. לנו לא וויתרו על תרגילי הסימוציה בניגוד לסמסטר קודם, ההבדל שהם היו במקום בMATLAB בפייתון. יש אפשרות להגיש בזוגות והם מהווים 15 אחוז מהציון הסופי בקורס. תאכלס יש רפרנסים להכל חוץ מהסימולציות בפייתון(שהיו במאטלאב פעם). בכלל העומס כנראה בשלב כלשהו תצטרכו לרפרנס.\n\nהמבחן: קשה מאוד. עשיתי רק את מועד ב ונתנו רק פקטור 6 נק בניגוד למועד א שבו נתנו 10 נק. יצאתי די מרוצה בסהכ , אבל לפני המבחן היתה אזעקה וממש לא התחשבו בזה בפקטור לצערי. המבחן לא היה נוראי לדעתי , בערך ברמה של מועד א. שימו לב לטעויות חישוב אפשר לשלם על זה הרבה באמריקאי ובמהלך המבחן. הנושא הכי קשה בקורס הוא בעיקר האחרון של תק\"מ שהוא בערך כל מה שראיתם בתחילת הקורס רק במקרה רציף(מבנה הקרוס דומה ברעיון להסתברות) ולכן שימו דגש עליו ותראו שאתם מבינים. הרמה של השאלות במבחן עליו גבוהה הרבה יותר מהתרגולים וההרצאה. בנוסף לנו כן הייתה שאלת סימולציה של קוד במבחן בשווי 4 נק בנושא של תק\"מ ואני חייב לומר שהבדיקה עליה הייתה מקלה. קיבלתי את כל 4 הנק והיו חסרות לי שם כמה לולאות .\n\nהשורה התחתונה: קורס קשה. תיקחו אותו ברצינות אחרת קשה לקבל ציון טוב. מאוד משעמם לדעתי , בעיקר חשוב למי שמתעניין בתהליכים אקראיים וניהול תורים\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2024",
        "content": "שם המרצה: ליאוניד\nחוות דעת - הרצאות: היה סה\"כ בסדר. אבל מרגיש שללכת רק לתרגולים מספיק בשביל להבין את החומר.\n\nחוות דעת - תרגולים: עדיף לראות את הזום.\n\nשעורי הבית: בסדק ויש רפרנס\n\nהמבחן: מבנה שתמיד חוזר על עצמו. אם יש מספיק זמן ללמוד למבחן אז בקלות אפשר להוציא ציון טוב.\n\nהשורה התחתונה: בסדר\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יעקב\nחוות דעת - הרצאות: יעקב נחמד ומנסה אבל מאוד מבולגן, סימונים לא קונסיסטנטיים ופתרונות ארוכים שלא לצורך, אבל כן סבבה סך הכל\n\nשם המתרגל/ת: מנחם\nחוות דעת - תרגולים: אני לא הייתי, יש גבול אחרי שלוש שעות רצוף הרצאה ללכת לעוד שעה תרגול. לפני המבחן ראיתי מרתון מוקלטות אלכס, מומלץ בהחלט\n\nשעורי הבית: מרופרנסים ונתנו רק שישה גיליונות בזוגות, באמת לא נורא\n\nהמבחן: יעקב שינה משמעותית את החומר ואת מבנה הבחינה וזה הקשה מאוד על הלמידה. אבל סך הכל לא היה מאוד אסוני וניתן 10 נקודות פקטור\n\nהשורה התחתונה: אפשר להזניח את הקורס כל הסמסטר ולהוציא 70+ יחסית בקלות, אבל ציון גבוה כן דורש השקעה והבנה גדולה של החומר, קורס נחמד ולא פורמלי בכלל, מי שלא סובל מהסתברות יסתדר.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יעקב\nחוות דעת - הרצאות: יעקב מבולגן כמו תמיד, בגדול מבינים את החומר.\n\nשם המתרגל/ת: מנחם פרנקו\nחוות דעת - תרגולים: מסביר טוב, אבל לא ממש חייב את התרגולים כדי להבין\n\nשעורי הבית: 5 גיליונות, עוזרים להבין איך לפתור תרגילים\n\nהמבחן: בסופו של דבר הוגן\n\nהשורה התחתונה: קורס די מעניין, יש דברים קצת טכניים אבל חשוב לתרגל\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יעקב בביצ'נקו\nחוות דעת - הרצאות: יעקב בפן האישי הוא אחד המרצים הנחמדים ביותר בפקולטה הוא סבלני מאוד ואפשר לשאול אותו שאלות בלי להרגיש ממנו תחושה רעה גם אם לא מבינים. אם זאת, כמרצה הוא מאוד מבולגן הוא עובר מנושא לנושא וקופץ מדבר לדבר צריך לדעת להקשיב לו כמו שצריך ולהבין על מה חשוב להתקע ועל מה לא כמו כן להיות עם סיכום מוכן מראש על ההרצאות שלו.\n\nשם המתרגל/ת: אלכס - הקלטות\nחוות דעת - תרגולים: אלכס תותח ראיתי את המוקלטים וסידר אותי. אלכס מסביר את זה בצורה מאוד ברורה וקל לעקוב אחריו הוא לא איטי ולרוב אפילו מספיק יותר ממה שהמתרגל בכיתה מספיק ממליץ בחום.\n\nשעורי הבית: די מה שנלמד בכיתה בסוף ביחס לקורסים אחרים המבחן מרגיש די טכני לכן חשוב לפתור את תרגילי הבית כדי להבין את הטכניקה של הפתרון אבל אם יש תרגיל מפיל לסת אין גם סיבה להתקע כמעט הכל ממוחזר.\n\nהמבחן: יעקב החליט לשנות את פורמט הבחינה ביחס לבחינות של לאוניד הוא החליט במקום תורים ללמד מארטינגלים והוריד את רוב רובו של נושא התק\"מ ובנוסף היה 6 שאלות פתוחות שצריך לבחור 5 מהן הדברים הללו יצרו מצב שהיה קשה לתרגל מבחינות קודמות, בסופו של דבר מועד היה היה סוג של שוק בעקבות הדברים שצייניתי אבל לאחר עיכול הפורמט אני חושב שהמבחן שלו סה\"כ הוגן והבדיקה לא הייתה קשוחה יתר על המידה. מבחן די הגון - במידה ומי שקורא את זה עושה בחינה בפורמט שאלות פתוחות ממליץ לתרגל בחינות מלפני 2018 שם זה בפורמט הזה.\n\nהשורה התחתונה: אחלה קורס סוג של המשך של הסבתברות אבל לדעתי קל יותר מבחינה מסוימת שהוא פחות טריקים מגעילים ויותר טכני חשוב להבין את התרגולים טוב ולא להזניח תרגול עצמי בתרגילי בית משם תסתדרו במבחן\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "חוות דעת - הרצאות: לא הלכתי\n\nשם המתרגל/ת: יוני\nחוות דעת - תרגולים: אחלה גבר אבל מי שעייף אפשר לראות אלכס מוקלט או סתם לקרוא את הPDF\n\nשעורי הבית: רפרנס\n\nהמבחן: הרבה טריקים אבל יש בדרך כלל מספיק ימים ללמוד והם די חוזרים על עצמם\n\nהשורה התחתונה: מלג מתמטי עם מספיק חרישה למבחן.\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 1.0
        }
      },
      {
        "semester": "סמסטר אביב 2025",
        "content": "שם המרצה: ליאוניד מיטניק\nחוות דעת - הרצאות: ליאוניד נחמד מאד, מסביר טוב ועונה על שאלות\n\nשם המתרגל/ת: הקלטות אלכס\nחוות דעת - תרגולים: מעולה, אלכס אחד הטובים מסביר ממש ברור\n\nשעורי הבית: לא מאד קשים ומחדדים טוב את הנקודות שחשוב לדעת\n\nהמבחן: היה מועד די קשה לדעתי, אבל ניתן פקטור גדול של 13 נק שפיצה על זה\n\nהשורה התחתונה: קורס ממש מעניין שמשפר את צורת החשיבה\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nאביב 2025       א' 68  ב' 67  סופי 70  מיטניק לאוניד\nחורף 2024-2025  א' 71  ב' 74  סופי 76  בביצ'נקו יעקב\nאביב 2024       א' 69  ב' 69  סופי 72  מיטניק לאוניד\nחורף 2023-2024  א' 71  ב' 61  סופי 71  מיטניק לאוניד\nאביב 2023       א' 73  ב' 75  סופי 83  אריאלי איתי\nחורף 2022-2023  א' 71  ב' 65  סופי 71  מיטניק לאוניד\nאביב 2022       א' 72  ב' 66  סופי 73\nחורף 2021-2022  א' 71  ב' 59  סופי 67\nאביב 2021       א' 72  ב' 69  סופי 73\nחורף 2020-2021  א' 70  ב' 65  סופי 71  מיטניק לאוניד\nאביב 2020       א' 76  ב' 75  סופי 79  לואידור אורן\nחורף 2019-2020  א' 69  ב' 59  סופי 68  מיטניק לאוניד\nאביב 2019       א' 72  ב' 64  סופי 73  מיטניק לאוניד\nחורף 2018-2019  א' 68  ב' 61  סופי 69  מיטניק לאוניד\nאביב 2018       א' 78  ב' 70  סופי 79  לואידור אורן\nחורף 2017-2018  א' 62  ב' 65  סופי 67  יופה דימיטרי ז\"\nאביב 2015       א' 70  ב' 71  סופי 73  לואידור אורן\nמבחן מועד א': 64\nסופי מועד א': 68\nמבחן מועד ב': 63\nסופי מועד ב': 67\nסופי: 70\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n213 158 55 74 30 100 70.542 70\nאיש סגל תפקיד\nמיטניק לאוניד מרצה - אחראי מקצוע\nפרנקו מנחם מתרגל - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}