{
  "course_id": "094170",
  "scraped_at": "2025-12-16T13:11:06.486630",
  "information": {
    "raw_text": "00940170 - שיטות בהנדסת תעשיה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: לימודי הסמכה\nנקודות: 3.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס דן במגוון שיטות בהנדסת תעשיה. ילמדו טכניקות לחקר תהליכים והצגתם, מדידת עבודה, ניהול רזה, שש סיגמא, פיתוח זריז של תוכנה, ארגונומיה ועקרונות תכנון מוצר. ינתן דגש על יישום השיטות השונות בעזרת אמצעים מתקדמים הכוללים איסוף נתונים אוטומטי בעזרת חיישנים ושימוש באלגוריתמים ומערכות לומדות לצורך ניתוח הנתונים.\n\nמקצועות קדם: (00940423 ו-01140051) או (01140051 ו-00940424)\n\nמועד א': 12-02-2026\nמועד ב': 08-03-2026",
    "title": "00940170 - שיטות בהנדסת תעשיה"
  },
  "feedback": {
    "summary": {
      "text": "9 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.5,
        "עומס": 3.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2020-2021",
        "content": "שם המרצה: שלומי\nחוות דעת - הרצאות: רלוונטיות ומעניינות\n\nשם המתרגל/ת: רועי אשור\n\nהמבחן: פייר\n\nהשורה התחתונה: הקורס התנהל בצורה קצת מבולגנת אבל סה''כ מעניין ומובן\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: אוי שלומי שלומי\n\nקחו מלא חומר שלאו דווקא קשור אחד לשני ותסתדרו\nבן אדם מעניין וניכר שהוא בעל עניין רב בחומר הקורס\nאבל קשה מאוד להבין אותו , הרצאות מבולגנות ועמוסות בחומר שמועבר ללא הסבר מהבסיס , מניח הרבה ידע מוקדם שלא לכל הסטודנטים יש\n\nשם המתרגל/ת: למא\nחוות דעת - תרגולים: מקסימה , תמיד שם בשביל הסטודנטים\n\nשעורי הבית: 4 גליונות ארוכים אבל לא נוראים בכלל\nפרויקט מתגלגל לאורך הסמסטר\n\nהמבחן: עוד לא היה ואין לי מושג איך הוא הולך להראות ומה אני צריך ללמוד לקראתו\n\nהשורה התחתונה:\nחלק מהקורס מרגיש מאוד מאוד טרויאלי ברמה של למה אנחנו צריכים ללמוד את זה בכלל וחלק מהקורס מעניין ומאיר\nקורס נחמד\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות:\nארוכות ועמוסות...קשה לעקוב אחרי המרצה ולהבין מה צריך להסיק מזה.... אבל במבחן הוא יכול לשאול על כל מילה שהוא אמר אז כדאי מאוד לוודא שיש מישהו שעומד בקצב ומסכם\nשם המתרגל/ת: למא\nחוות דעת - תרגולים:\nבעיקר מתעסקים בפרויקט, מאוד עוזרים..\nשעורי הבית:\nמעט שיעורי בית שמבוססים על שאלות ממבחנים..\nיש פרויקט לאורך הקורס שבתכלס די המצאנו את כל הנתונים ואז לא נדרשת יותר מידי השקעה\nהמבחן:\nסטנדרטי...לא מסובך מידי..\nהשורה התחתונה: קורס עם ציון סבבה שלא צריך להשקיע בו יותר מידי\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 2.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: ד\"ר שלומי לויפר\nשם המתרגל/ת: למא וותד\nחוות דעת - תרגולים: מתרגלת מעולה. באה לקראת הסטודנטים. רואים שהיא מבינה את החומר ומסבירה אותו בצורה מעולה ומעניינת.\n\nשעורי הבית: בנוסף לתרגילי הבית, יש פרויקט מתגלגל לאורך הסמסטר. הפרויקט מאוד עמוס.\n\nהמבחן: לא קשה. חשוב לא לפספס אף נושא שנלמד בהרצאות כי הוא יכול להופיע במבחן.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: שלומי לויפר\nחוות דעת - הרצאות: מתחלק לחלקים נחמדים וחלקים שממש מרגיש שאין טעם לבזבז עליהם זמן. שלומי נחמד מאוד, אבל קשה להתרכז בהרצאה שלו 3 שעות.\n\nשם המתרגל/ת: למא\nחוות דעת - תרגולים: למא מקסימה! מסבירה הכל ברור ועונה על כל השאלות. ממש נחמד בשיעורים שלה. מאוד באה לקראתנו וגמישה לגבי בקשות.\nעזרה מאוד בפרוייקט.\n\nשעורי הבית: 5 בסמסטר, לא עמוסים מידי אבל לא תמיד ברורים. יש פרוייקט במהלך הסמסטר שמאוד מעמיס. מרגיש שיש המון לעשות בכל פרק ויש זמני הגשה יחסית קצרים כי יש כמה פרקים להגיש.\n\nהמבחן: יחסית הוגן.\n\nהשורה התחתונה: קורס נחמד מאוד, אם לא היה את הפרוייקט היה באמת קורס קליל.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 3.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: שלומי\nחוות דעת - הרצאות: לפעמים מעניינות, לפעמים לא רלוונטיות כל כך. שלומי עבר על המצגות בפעם הראשונה מולנו אז יצא שהוא דילג על הרבה.\n\nשם המתרגל/ת: למא\nחוות דעת - תרגולים: מושלמת!! מעבירה את החומר באופן ברור ותמיד השקיעה 100%.\n\nשעורי הבית: יש 5 תרגילי בית שהם סבבה לגמרי, וגם פרויקט מתמשך. את שניהם עושים בשלישיות. הפרויקט קצת מעצבן כי הוא דורש עבודה בעסק/מפעל, אבל כל עוד השקעת למא נתנה ציון טוב. לקראת ההגשות יותר עמוס.\n\nהמבחן: ארוך ולא הכי ברור, ואין מספיק מבחני עבר ללמוד מהם. אבל לא קשה במיוחד.\n\nהשורה התחתונה: אני חשבתי שהקורס מעניין ואחלה.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: שלומי\nחוות דעת - הרצאות: שלומי מרצה ממש מונוטונית. לא הגעתי כמעט להרצאות ובדיעבד חשוב ממש להגיע. בבחינה בחנו על מלא שטויות קטנות שהיו רשומות במצגת והוא הסביר בעל פה ולא היה על זה תרגול.\n\nשם המתרגל/ת: למא\nחוות דעת - תרגולים: היא תגיד שהיא זמינה במייל אז תדעו שהיא לא. היא יודעת להסביר אבל לא היו תרגולים על כל החומר שנלמד בהרצאות וזה הקשה בלמידה למבחן.\n\nשעורי הבית: לא קשים מידי, חשובים כדי להבין את החומר שמלמדים. יש פרויקט עצום, אנחנו לא הבנו את סדר הגודל שלו עד שהתחלנו לעבוד עליו. הוא דרש המוןןןןןן זמן והמון תשומת לב, דורש ללכת כמה פעמים למפעל/מקום שאתם רוצים לשפר תהליך כלשהו בו. בסוף הציונים על ההגשות הם סבירים.\n\nהמבחן: מבחני עבר היו ממש סבירים אבל משהו השנה השתנה. הייתה שאלה לא פתירה. האמריקאי בוחן על כל פיפס ששלומי אי פעם אמר בהרצאה.\n\nהשורה התחתונה: קורס לא באמת מלמד, לא יצאתי עם שיטות בהנדסת תעשייה שישמשו אותי בפועל בחיים.\nכללי\nעומס",
        "ratings": {
          "כללי": 2.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: שלומי\nחוות דעת - הרצאות: שלומי הוא מרצה טוב בסה\"כ אבל החומר פשוט יותר מדי מפוזר, לומדים הרבה נושאים בפרק זמן קצר, לדעתי להתמקד בכמות נושאים קטנה יותר היה פשוט יותר מלמד.\n\nשם המתרגל/ת: למא\nחוות דעת - תרגולים: יש בתרגולים חזרה טובה על נושאים מרכזיים בחומר, אבל עיקר הזמן היה על הפרויקט, שזה טוב לדעתי כי זה עזר לכוון מה בדיוק לעשות ואיך. ממליצה להיעזר בלמא כמה שיותר בפרויקט.\n\nשעורי הבית: 5 שיעורי בית בזוגות עם רפרנס + פרויקט מחולק ל-3 חלקים. הפרויקט כן עמוס במידה מסוימת ודורש לחקור תהליך במקום עבודה, אבל הוא נפרש על רוב הסמסטר וזה לא מאוד לחוץ בזמן.\n\nהמבחן: קצת מאתגר ללמוד למבחן כי יש המון חומר ויש מבחני עבר ללא פתרון (חוץ מאחד יחסית ישן). צריך לזכור את החומר די לדקויות אבל סה\"כ המבחן היה הוגן.\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 82  סופי 83  לויפר שלומי\nחורף 2023-2024  א' 81  סופי 84  לויפר שלומי\nחורף 2022-2023  א' 84  ב' 80  סופי 85  לויפר שלומי\nחורף 2021-2022  א' 87  ב' 82  סופי 85\nחורף 2020-2021  א' 87  סופי 87  לויפר שלומי\nחורף 2019-2020  א' 83  סופי 83  לויפר שלומי\nסופי מועד א': 82\nסופי: 83\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n39 37 2 95 68 94 83.784 85\nאיש סגל תפקיד\nלויפר שלומי מרצה - אחראי מקצוע\nוותד למא מתרגל\nשיתוף היסטוגרמות"
  }
}