{
  "course_id": "014952",
  "scraped_at": "2025-12-16T13:34:13.544960",
  "information": {
    "raw_text": "00140952 - סקר קרקעות - מערכות מידע\nפקולטה: הפקולטה להנדסה אזרחית וסביבתית\nמסגרת לימודים: לימודי הסמכה\nנקודות: 2.5\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nקביעת הציון עפ\"י ציוני תרגילים במשך הסמסטר, ועפ\"י ציון פרויקט גמר שהוא בהיקף משמעותי הכולל מיפוי בעזרת כלי הממ\"ג וניתוח שטח באמצעותתצלומי אוויר ומפות נושאיות. לא תתקיים בחינה. גם חובת הנוכחות בשעורים ובסיורים משוקללת. כלים לביצוע סקרי קרקע כמו יכולות לתיאור חתך הקרקע בשדה, פיענוח תצלומי אוויר, מפות גיאולוגיות ומפות טופוגרפיות. שימוש בממ\"ג (מערכות מידע גיאוגרפיות) ככלי ליצירת שכבות מידע למפת קרקע, לשימושי קרקע ולתכנון שטחים. דרישות הקורס כוללות גם השתתפות חובה בשני סיורים שיתקיימו בימי שישי. משך כל סיור כ- 5 שעות. בשבוע של הסיור או אחריו לא יתקיים שעור.\n\nמקצועות קדם: 00140003\n\nמקצועות ללא זיכוי נוסף: 00740022\n\nאחראים: אינג' רם זיידנברג",
    "title": "00140952 - סקר קרקעות - מערכות מידע"
  },
  "feedback": {
    "summary": {
      "text": "4 חוות דעת\nכללי\nעומס",
      "ratings": {
        "כללי": 4.0,
        "עומס": 4.0
      }
    },
    "reviews": [
      {
        "semester": "",
        "content": "",
        "ratings": {
          "": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2021-2022",
        "content": "שם המרצה: רמי\nחוות דעת - הרצאות: הרצאות מעניינות ממש! מרצה משקיע ובאמת אכפת לו להעביר את החומר כך שכולם יבינו.\n\nשם המתרגל/ת: עופר\nחוות דעת - תרגולים: שיטת התרגולים - של כיתה הפוכה, ממש יעילה. בעיניי, זו הדרך הכי טובה ללמד תוכנה. עופר נמצא בכיתה בזמן השיעור וקשוב לענות על כל שאלה\n\nשעורי הבית: מאתגרים אבל מלמדים המון\n\nהמבחן: יש פרויקט, באמת מסכם את מה שלומדים בקורס.\n\nהשורה התחתונה: מומלץ\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 4.0
        }
      },
      {
        "semester": "סמסטר חורף 2022-2023",
        "content": "שם המרצה: רמי זיידנברג\nחוות דעת - הרצאות: מלמד בצורה מאוד מעניינת, הקורס עצמו מעניין ונותן המון מידע שלדעתי כל סטודנט צריך לדעת. רמי מנסה לשתף את כולם ולכן גם מתכנן סיורים ונותן פיידבאק על הדוחות באופן מפורט.\n\nשם המתרגל/ת: עופר שניר\nחוות דעת - תרגולים: תרגולים מאוד קצרים, מסבירים טוב את השימוש בתוכנת QGIS ועופר עונה לכל השאלות.\n\nשעורי הבית: כבדים וצריכים השקעה, לוקחים זמן אבל בסופו של דבר מלמדים איך להשתמש בתוכנה\n\nהמבחן: אין- יש פרויקט סופי קשה ועמוס אך הציון שניתן מאוד גבוה, וטוב לדעת איך משתמשים בתוכנה\n\nהשורה התחתונה: מומלץ אך לבחור בזמנים נכונים ולא עמוסים מדי.\nכללי\nעומס",
        "ratings": {
          "כללי": 4.0,
          "עומס": 5.0
        }
      },
      {
        "semester": "סמסטר חורף 2023-2024",
        "content": "שם המרצה: רמי\nחוות דעת - הרצאות:\nאם אתם רוצים לקום כל שלישי בבוקר ולהתאהב במרצה כל פעם מחדש זה המקום בשבילכם. אחד המרצים המעניינים שהיו לי. הוא איש עם ים ידע\nכללי\nעומס",
        "ratings": {
          "כללי": 5.0,
          "עומס": 3.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2021-2022  א' 87  סופי 87  זיידנברג רם\nסופי מועד א': 87\nסופי: 87\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n12 12 0 100 55 98 87.417 95\nאיש סגל תפקיד\nזיידנברג רם מרצה - אחראי מקצוע\nקובלר קרן סגל מנהלי - עם הרשאות מרצה אחראי\nבלסברג עליזה סגל מנהלי - עם הרשאות מרצה אחראי\nמלכה אופירה סגל מנהלי - עם הרשאות מרצה אחראי\nשיתוף היסטוגרמות"
  }
}