{
  "course_id": "097622",
  "scraped_at": "2025-12-16T13:53:09.284649",
  "information": {
    "raw_text": "00970622 - מבוא למדעי הקוגניציה\nפקולטה: מדעי הנתונים וההחלטות\nמסגרת לימודים: מקצוע משותף\nנקודות: 2\n\nקטלוג מקצועות מקוון\nחיפוש קבוצה בפייסבוק\nסריקות מבחנים\nקבוצת וואטסאפ/טלגרם\n\nהקורס יסקור תחומי מחקר, תיאוריות, מודלים וממצאים אמפיריים מרכזיים בחקר הקוגניציה האנושית. בין הנושאים\nשילמדו: היסודות הפילוסופיים של מדעי הקוגניציה, ייצוגים מנטליים, למידה, שפה, ראייה, קשב וזיכרון. דגש מיוחד\nיינתן על מודלים חישוביים בקוגניציה, והקשרים בין מדעי הקוגניציה לבינה מלאכותית.\nתוצאות למידה:\nבסוף הקורס הסטודנטים יוכלו\n- לאפיין את התחומים והשאלות המרכזיות בחקר הקוגניציה.\n- להסביר שיטות מחקר, ממצאים אמפיריים, מודלים ותיאוריות מרכזיות בתחומי הקוגניציה.\n- לאפיין קשרים מרכזיים בין בינה אנושית לבינה מלאכותית.",
    "title": "00970622 - מבוא למדעי הקוגניציה"
  },
  "feedback": {
    "summary": {
      "text": "חוות דעת אחת\nכללי\nעומס",
      "ratings": {
        "כללי": 3.0,
        "עומס": 4.0
      }
    },
    "reviews": [
      {
        "semester": "סמסטר חורף 2024-2025",
        "content": "שם המרצה: יבגני ברזק\nחוות דעת - הרצאות: חמודי. רואים שהוא נהנה להרצות והחומר חשוב לו. בכללי ההרצאות נחמדות ועם נוכחות חובה, אבל לא באמת חייבים להקשיב יותר מדי.\n\nשעורי הבית: מוגזמים אבל מעניינים. היה צריך לקרוא מאמרים ולכתוב עליהם חיבור באורך עמוד. הבעיה העיקרית הייתה בבדיקה המחמירה הלא קונססיטנטית בין המתרגלים השונים.\n\nהמבחן: יש פרזנטציה במקום. תעמדו בהוראות המאוד ספציפיות והכל יהיה בסדר\n\nהשורה התחתונה: נחמד, דרישות קצת מוגזמות לקורס של 2 נקז\nכללי\nעומס",
        "ratings": {
          "כללי": 3.0,
          "עומס": 4.0
        }
      }
    ]
  },
  "histograms": {
    "raw_text": "עליכם לשתף את ההיסטגרמות שלכם לפני שתוכלו להציג היסטוגרמות שסטודנטים אחרים שיתפו. השיתוף אוטומטי ולוקח מספר דקות.\nשיתוף היסטוגרמותכבר שיתפתישיתוף בפעם אחרת\nחורף 2024-2025  א' 88  סופי 88  ברזק יבגני\nחורף 2023-2024  א' 91  סופי 91  ברזק יבגני\nחורף 2022-2023  סופי 94  ברזק יבגני\nסופי מועד א': 88\nסופי: 88\nסטודנטים עברו נכשלו אחוז עוברים ציון מינימלי ציון מקסימלי ממוצע חציון\n37 36 1 97 74 95 88.639 90\nאיש סגל תפקיד\nברזק יבגני מרצה - אחראי מקצוע\nליאון אלה מתרגל\nשיתוף היסטוגרמות"
  }
}